greatscottgadgets/ubertooth/firmware/common/lpc17.h
/*
 * lpc17.h
 *
 * registers and bit definitions for NXP LPC17xx microcontrollers
 *
 * based on information contained in:
 *
 * UM10360
 * LPC17xx User manual
 * Rev. 2 -- 19 August 2010
 *
 * Copyright 2010 Michael Ossmann
 *
 * This file is part of Project Ubertooth.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2, or (at your option)
 * any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; see the file COPYING.  If not, write to
 * the Free Software Foundation, Inc., 51 Franklin Street,
 * Boston, MA 02110-1301, USA.
 */

#ifndef __LPC17_H
#define __LPC17_H

#include <stdint.h>
 
#define LPC17_REG(a)   (*(volatile uint32_t *)(a))
#define LPC17_REG8(a)  (*(volatile uint8_t *)(a))
#define LPC17_REG16(a) (*(volatile uint16_t *)(a))


/* system control registers */

/* External Interrupts */
#define EXTINT   LPC17_REG(0x400FC140) /* External Interrupt Flag Register */
#define EXTMODE  LPC17_REG(0x400FC148) /* External Interrupt Mode register */
#define EXTPOLAR LPC17_REG(0x400FC14C) /* External Interrupt Polarity Register */

/* Reset */
#define RSID LPC17_REG(0x400FC180) /* Reset Source Identification Register */

/* Syscon Miscellaneous Registers */
#define SCS LPC17_REG(0x400FC1A0) /* System Control and Status */

/* Reset Source Identification Register (RSID - 0x400F C180) */
#define RSID_POR  (0x1 << 0)
#define RSID_EXTR (0x1 << 1)
#define RSID_WDTR (0x1 << 2)
#define RSID_BODR (0x1 << 2)

/* External Interrupt flag register (EXTINT - 0x400F C140) */
#define EXTINT_EINT0 (0x1 << 0)
#define EXTINT_EINT1 (0x1 << 1)
#define EXTINT_EINT2 (0x1 << 2)
#define EXTINT_EINT3 (0x1 << 3)

/* External Interrupt Mode register (EXTMODE - 0x400F C148) */
#define EXTMODE_EXTMODE0 (0x1 << 0)
#define EXTMODE_EXTMODE1 (0x1 << 1)
#define EXTMODE_EXTMODE2 (0x1 << 2)
#define EXTMODE_EXTMODE3 (0x1 << 3)

/* External Interrupt Polarity register (EXTPOLAR - 0x400F C14C) */
#define EXTPOLAR_EXTPOLAR0 (0x1 << 0)
#define EXTPOLAR_EXTPOLAR1 (0x1 << 1)
#define EXTPOLAR_EXTPOLAR2 (0x1 << 2)
#define EXTPOLAR_EXTPOLAR3 (0x1 << 3)

/*  System Controls and Status register (SCS - 0x400F C1A0) */
#define SCS_OSCRANGE (0x1 << 4)
#define SCS_OSCEN    (0x1 << 5)
#define SCS_OSCSTAT  (0x1 << 6)


/* clocking and power control registers */

/* Clock source selection */
#define CLKSRCSEL LPC17_REG(0x400FC10C) /* Clock Source Select Register */

/* Phase Locked Loop (PLL0, Main PLL) */
#define PLL0CON  LPC17_REG(0x400FC080) /* PLL0 Control Register */
#define PLL0CFG  LPC17_REG(0x400FC084) /* PLL0 Configuration Register */
#define PLL0STAT LPC17_REG(0x400FC088) /* PLL0 Status Register */
#define PLL0FEED LPC17_REG(0x400FC08C) /* PLL0 Feed Register */

/* Phase Locked Loop (PLL1, USB PLL) */
#define PLL1CON  LPC17_REG(0x400FC0A0) /* PLL1 Control Register */
#define PLL1CFG  LPC17_REG(0x400FC0A4) /* PLL1 Configuration Register */
#define PLL1STAT LPC17_REG(0x400FC0A8) /* PLL1 Status Register */
#define PLL1FEED LPC17_REG(0x400FC0AC) /* PLL1 Feed Register */

/* Clock dividers */
#define CCLKCFG   LPC17_REG(0x400FC104) /* CPU Clock Configuration Register */
#define USBCLKCFG LPC17_REG(0x400FC108) /* USB Clock Configuration Register */
#define PCLKSEL0  LPC17_REG(0x400FC1A8) /* Peripheral Clock Selection register 0 */
#define PCLKSEL1  LPC17_REG(0x400FC1AC) /* Peripheral Clock Selection register 1 */

/* Power control */
#define PCON  LPC17_REG(0x400FC0C0) /* Power Control Register */
#define PCONP LPC17_REG(0x400FC0C4) /* Power Control for Peripherals Register */

/* Utility */
#define CLKOUTCFG LPC17_REG(0x400FC1C8) /* Clock Output Configuration Register */

/* Clock Source Select register (CLKSRCSEL - 0x400F C10C) */
#define CLKSRCSEL_CLKSRC (0x3 << 4)

/* PLL0 Control register (PLL0CON - 0x400F C080) */
#define PLL0CON_PLLE0 (0x1 << 0)
#define PLL0CON_PLLC0 (0x1 << 1)

/* PLL0 Configuration register (PLL0CFG - 0x400F C084) */
#define PLL0CFG_MSEL0 (0x7FFF << 0)
#define PLL0CFG_NSEL0 (0xFF << 16)

/* PLL0 Status register (PLL0STAT - 0x400F C088) */
#define PLL0STAT_MSEL0      (0x7FFF << 0)
#define PLL0STAT_NSEL0      (0xFF << 16)
#define PLL0STAT_PLLE0_STAT (0x1 << 24)
#define PLL0STAT_PLLC0_STAT (0x1 << 25)
#define PLL0STAT_PLOCK0     (0x1 << 26)

/* PLL0 Feed register (PLL0FEED - 0x400F C08C) */
#define PLL0FEED_SEQUENCE PLL0FEED = 0xAA; PLL0FEED = 0x55

/* PLL1 Control register (PLL1CON - 0x400F C0A0)  */
#define PLL1CON_PLLE1 (0x1 << 0)
#define PLL1CON_PLLC1 (0x1 << 1)

/* PLL1 Configuration register (PLL1CFG - 0x400F C0A4) */
#define PLL1CFG_MSEL1 (0x1F << 0)
#define PLL1CFG_PSEL1 (0x3 << 5)

/* PLL1 Status register (PLL1STAT - 0x400F C0A8) */
#define PLL1STAT_MSEL1      (0x1F << 0)
#define PLL1STAT_PSEL1      (0x3 << 5)
#define PLL1STAT_PLLE1_STAT (0x1 << 8)
#define PLL1STAT_PLLC1_STAT (0x1 << 9)
#define PLL1STAT_PLOCK1     (0x1 << 10)

/* PLL1 Feed register (PLL1FEED - 0x400F C0AC) */
#define PLL1FEED_SEQUENCE PLL1FEED = 0xAA; PLL1FEED = 0x55

/* CPU Clock Configuration register (CCLKCFG - 0x400F C104) */
#define CCLKCFG_CCLKSEL (0xFF << 0)

/* USB Clock Configuration register (USBCLKCFG - 0x400F C108) */
#define USBCLKCFG_USBSEL (0xF << 0)

/* Peripheral Clock Selection register 0 (PCLKSEL0 - 0x400F C1A8) */
#define PCLKSEL0_PCLK_WDT    (0x3 << 0)
#define PCLKSEL0_PCLK_TIMER0 (0x3 << 2)
#define PCLKSEL0_PCLK_TIMER1 (0x3 << 4)
#define PCLKSEL0_PCLK_UART0  (0x3 << 6)
#define PCLKSEL0_PCLK_UART1  (0x3 << 8)
#define PCLKSEL0_PCLK_PWM1   (0x3 << 12)
#define PCLKSEL0_PCLK_I2C0   (0x3 << 14)
#define PCLKSEL0_PCLK_SPI    (0x3 << 16)
#define PCLKSEL0_PCLK_SSP1   (0x3 << 20)
#define PCLKSEL0_PCLK_DAC    (0x3 << 22)
#define PCLKSEL0_PCLK_ADC    (0x3 << 24)
#define PCLKSEL0_PCLK_CAN1   (0x3 << 26)
#define PCLKSEL0_PCLK_CAN2   (0x3 << 28)
#define PCLKSEL0_PCLK_ACF    (0x3 << 30)

/* Peripheral Clock Selection register 1 (PCLKSEL1 - 0x400F C1AC) */
#define PCLKSEL1_PCLK_QEI     (0x3 << 0)
#define PCLKSEL1_PCLK_GPIOINT (0x3 << 2)
#define PCLKSEL1_PCLK_PCB     (0x3 << 4)
#define PCLKSEL1_PCLK_I2C1    (0x3 << 6)
#define PCLKSEL1_PCLK_SSP0    (0x3 << 10)
#define PCLKSEL1_PCLK_TIMER2  (0x3 << 12)
#define PCLKSEL1_PCLK_TIMER3  (0x3 << 14)
#define PCLKSEL1_PCLK_UART2   (0x3 << 16)
#define PCLKSEL1_PCLK_UART3   (0x3 << 18)
#define PCLKSEL1_PCLK_I2C2    (0x3 << 20)
#define PCLKSEL1_PCLK_I2S     (0x3 << 22)
#define PCLKSEL1_PCLK_RIT     (0x3 << 26)
#define PCLKSEL1_PCLK_SYSCON  (0x3 << 28)
#define PCLKSEL1_PCLK_MC      (0x3 << 30)

