greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* Power Mode Control register (PCON - 0x400F C0C0) */
#define PCON_PM0     (0x1 << 0)
#define PCON_PM1     (0x1 << 1)
#define PCON_BODRPM  (0x1 << 2)
#define PCON_BOGD    (0x1 << 3)
#define PCON_BORD    (0x1 << 4)
#define PCON_SMFLAG  (0x1 << 8)
#define PCON_DSFLAG  (0x1 << 9)
#define PCON_PDFLAG  (0x1 << 10)
#define PCON_DPDFLAG (0x1 << 11)

/* Power Control for Peripherals register (PCONP - 0x400F C0C4) */
#define PCONP_PCTIM0  (0x1 << 1)
#define PCONP_PCTIM1  (0x1 << 2)
#define PCONP_PCUART0 (0x1 << 3)
#define PCONP_PCUART1 (0x1 << 4)
#define PCONP_PCPWM1  (0x1 << 6)
#define PCONP_PCI2C0  (0x1 << 7)
#define PCONP_PCSPI   (0x1 << 8)
#define PCONP_PCRTC   (0x1 << 9)
#define PCONP_PCSSP1  (0x1 << 10)
#define PCONP_PCADC   (0x1 << 12)
#define PCONP_PCCAN1  (0x1 << 13)
#define PCONP_PCCAN2  (0x1 << 14)
#define PCONP_PCGPIO  (0x1 << 15)
#define PCONP_PCRIT   (0x1 << 16)
#define PCONP_PCMCPWM (0x1 << 17)
#define PCONP_PCQEI   (0x1 << 18)
#define PCONP_PCI2C1  (0x1 << 19)
#define PCONP_PCSSP0  (0x1 << 21)
#define PCONP_PCTIM2  (0x1 << 22)
#define PCONP_PCTIM3  (0x1 << 23)
#define PCONP_PCUART2 (0x1 << 24)
#define PCONP_PCUART3 (0x1 << 25)
#define PCONP_PCI2C2  (0x1 << 26)
#define PCONP_PCI2S   (0x1 << 27)
#define PCONP_PCGPDMA (0x1 << 29)
#define PCONP_PCENET  (0x1 << 30)
#define PCONP_PCUSB   (0x1 << 31)

/* Clock Output Configuration register (CLKOUTCFG - 0x400F C1C8) */
#define CLKOUTCFG_CLKOUTSEL  (0xF << 0)
#define CLKOUTCFG_CLKOUTDIV  (0xF << 4)
#define CLKOUTCFG_CLKOUT_EN  (0x1 << 8)
#define CLKOUTCFG_CLKOUT_ACT (0x1 << 9)


/* flash accelerator registers */
#define FLASHCFG LPC17_REG(0x400FC000) /* Flash Accelerator Configuration Register */

/* Flash Accelerator Configuration register (FLASHCFG - 0x400F C000) */
#define FLASHCFG_FLASHTIM (0xF << 12)


/* NVIC registers */

#define ISER0 LPC17_REG(0xE000E100) /* Interrupt Set-Enable Register 0 */
#define ISER1 LPC17_REG(0xE000E104) /* Interrupt Set-Enable Register 1 */
#define ICER0 LPC17_REG(0xE000E180) /* Interrupt Clear-Enable Register 0 */
#define ICER1 LPC17_REG(0xE000E184) /* Interrupt Clear-Enable Register 1 */
#define ISPR0 LPC17_REG(0xE000E200) /* Interrupt Set-Pending Register 0 */
#define ISPR1 LPC17_REG(0xE000E204) /* Interrupt Set-Pending Register 1 */
#define ICPR0 LPC17_REG(0xE000E280) /* Interrupt Clear-Pending Register 0 */
#define ICPR1 LPC17_REG(0xE000E284) /* Interrupt Clear-Pending Register 1 */
#define IABR0 LPC17_REG(0xE000E300) /* Interrupt Active Bit Register 0 */
#define IABR1 LPC17_REG(0xE000E304) /* Interrupt Active Bit Register 1 */
#define IPR0  LPC17_REG(0xE000E400) /* Interrupt Priority Register 0 */
#define IPR1  LPC17_REG(0xE000E404) /* Interrupt Priority Register 1 */
#define IPR2  LPC17_REG(0xE000E408) /* Interrupt Priority Register 2 */
#define IPR3  LPC17_REG(0xE000E40C) /* Interrupt Priority Register 3 */
#define IPR4  LPC17_REG(0xE000E410) /* Interrupt Priority Register 4 */
#define IPR5  LPC17_REG(0xE000E414) /* Interrupt Priority Register 5 */
#define IPR6  LPC17_REG(0xE000E418) /* Interrupt Priority Register 6 */
#define IPR7  LPC17_REG(0xE000E41C) /* Interrupt Priority Register 7 */
#define IPR8  LPC17_REG(0xE000E420) /* Interrupt Priority Register 8 */
#define STIR  LPC17_REG(0xE000EF00) /* Software Trigger Interrupt Register */

/* Interrupt Set-Enable Register 0 register (ISER0 - 0xE000 E100) */
#define ISER0_ISE_WDT    (0x1 << 0) /* Watchdog Timer Interrupt Enable */
#define ISER0_ISE_TIMER0 (0x1 << 1) /* Timer 0 Interrupt Enable */
#define ISER0_ISE_TIMER1 (0x1 << 2) /* Timer 1. Interrupt Enable */
#define ISER0_ISE_TIMER2 (0x1 << 3) /* Timer 2 Interrupt Enable */
#define ISER0_ISE_TIMER3 (0x1 << 4) /* Timer 3 Interrupt Enable */
#define ISER0_ISE_UART0  (0x1 << 5) /* UART0 Interrupt Enable */
#define ISER0_ISE_UART1  (0x1 << 6) /* UART1 Interrupt Enable */
#define ISER0_ISE_UART2  (0x1 << 7) /* UART2 Interrupt Enable */
#define ISER0_ISE_UART3  (0x1 << 8) /* UART3 Interrupt Enable */
#define ISER0_ISE_PWM    (0x1 << 9) /* PWM1 Interrupt Enable */
#define ISER0_ISE_I2C0   (0x1 << 10) /* I2C0 Interrupt Enable */
#define ISER0_ISE_I2C1   (0x1 << 11) /* I2C1 Interrupt Enable */
#define ISER0_ISE_I2C2   (0x1 << 12) /* I2C2 Interrupt Enable */
#define ISER0_ISE_SPI    (0x1 << 13) /* SPI Interrupt Enable */
#define ISER0_ISE_SSP0   (0x1 << 14) /* SSP0 Interrupt Enable */
#define ISER0_ISE_SSP1   (0x1 << 15) /* SSP1 Interrupt Enable */
#define ISER0_ISE_PLL0   (0x1 << 16) /* PLL0 (Main PLL) Interrupt Enable */
#define ISER0_ISE_RTC    (0x1 << 17) /* Real Time Clock (RTC) Interrupt Enable */
#define ISER0_ISE_EINT0  (0x1 << 18) /* External Interrupt 0 Interrupt Enable */
#define ISER0_ISE_EINT1  (0x1 << 19) /* External Interrupt 1 Interrupt Enable */
#define ISER0_ISE_EINT2  (0x1 << 20) /* External Interrupt 2 Interrupt Enable */
#define ISER0_ISE_EINT3  (0x1 << 21) /* External Interrupt 3 Interrupt Enable */
#define ISER0_ISE_ADC    (0x1 << 22) /* ADC Interrupt Enable */
#define ISER0_ISE_BOD    (0x1 << 23) /* BOD Interrupt Enable */
#define ISER0_ISE_USB    (0x1 << 24) /* USB Interrupt Enable */
#define ISER0_ISE_CAN    (0x1 << 25) /* CAN Interrupt Enable */
#define ISER0_ISE_DMA    (0x1 << 26) /* GPDMA Interrupt Enable */
#define ISER0_ISE_I2S    (0x1 << 27) /* I2S Interrupt Enable */
#define ISER0_ISE_ENET   (0x1 << 28) /* Ethernet Interrupt Enable */
#define ISER0_ISE_RIT    (0x1 << 29) /* Repetitive Interrupt Timer Interrupt Enable */
#define ISER0_ISE_MCPWM  (0x1 << 30) /* Motor Control PWM Interrupt Enable */
#define ISER0_ISE_QEI    (0x1 << 31) /* Quadrature Encoder Interface Interrupt Enable */

/* Interrupt Set-Enable Register 1 register (ISER1 - 0xE000 E104) */
#define ISER1_ISE_PLL1   (0x1 << 0) /* PLL1 (USB PLL) Interrupt Enable */
#define ISER1_ISE_USBACT (0x1 << 1) /* USB Activity Interrupt Enable */
#define ISER1_ISE_CANACT (0x1 << 2) /* CAN Activity Interrupt Enable */

/* Interrupt Clear-Enable Register 0 (ICER0 - 0xE000 E180) */
#define ICER0_ICE_WDT    (0x1 << 0) /* Watchdog Timer Interrupt Disable */
#define ICER0_ICE_TIMER0 (0x1 << 1) /* Timer 0 Interrupt Disable */
#define ICER0_ICE_TIMER1 (0x1 << 2) /* Timer 1. Interrupt Disable */
#define ICER0_ICE_TIMER2 (0x1 << 3) /* Timer 2 Interrupt Disable */
#define ICER0_ICE_TIMER3 (0x1 << 4) /* Timer 3 Interrupt Disable */
#define ICER0_ICE_UART0  (0x1 << 5) /* UART0 Interrupt Disable */
#define ICER0_ICE_UART1  (0x1 << 6) /* UART1 Interrupt Disable */
#define ICER0_ICE_UART2  (0x1 << 7) /* UART2 Interrupt Disable */
#define ICER0_ICE_UART3  (0x1 << 8) /* UART3 Interrupt Disable */
#define ICER0_ICE_PWM    (0x1 << 9) /* PWM1 Interrupt Disable */
#define ICER0_ICE_I2C0   (0x1 << 10) /* I2C0 Interrupt Disable */
#define ICER0_ICE_I2C1   (0x1 << 11) /* I2C1 Interrupt Disable */
#define ICER0_ICE_I2C2   (0x1 << 12) /* I2C2 Interrupt Disable */
#define ICER0_ICE_SPI    (0x1 << 13) /* SPI Interrupt Disable */
#define ICER0_ICE_SSP0   (0x1 << 14) /* SSP0 Interrupt Disable */
#define ICER0_ICE_SSP1   (0x1 << 15) /* SSP1 Interrupt Disable */
#define ICER0_ICE_PLL0   (0x1 << 16) /* PLL0 (Main PLL) Interrupt Disable */
#define ICER0_ICE_RTC    (0x1 << 17) /* Real Time Clock (RTC) Interrupt Disable */
#define ICER0_ICE_EINT0  (0x1 << 18) /* External Interrupt 0 Interrupt Disable */
#define ICER0_ICE_EINT1  (0x1 << 19) /* External Interrupt 1 Interrupt Disable */
#define ICER0_ICE_EINT2  (0x1 << 20) /* External Interrupt 2 Interrupt Disable */
#define ICER0_ICE_EINT3  (0x1 << 21) /* External Interrupt 3 Interrupt Disable */
#define ICER0_ICE_ADC    (0x1 << 22) /* ADC Interrupt Disable */
#define ICER0_ICE_BOD    (0x1 << 23) /* BOD Interrupt Disable */
#define ICER0_ICE_USB    (0x1 << 24) /* USB Interrupt Disable */
#define ICER0_ICE_CAN    (0x1 << 25) /* CAN Interrupt Disable */
#define ICER0_ICE_DMA    (0x1 << 26) /* GPDMA Interrupt Disable */
#define ICER0_ICE_I2S    (0x1 << 27) /* I2S Interrupt Disable */
#define ICER0_ICE_ENET   (0x1 << 28) /* Ethernet Interrupt Disable */
#define ICER0_ICE_RIT    (0x1 << 29) /* Repetitive Interrupt Timer Interrupt Disable */
#define ICER0_ICE_MCPWM  (0x1 << 30) /* Motor Control PWM Interrupt Disable */
#define ICER0_ICE_QEI    (0x1 << 31) /* Quadrature Encoder Interface Interrupt Disable */

