greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* Interrupt Clear-Enable Register 1 register (ICER1 - 0xE000 E184) */
#define ICER1_ICE_PLL1   (0x1 << 0) /* PLL1 (USB PLL) Interrupt Disable */
#define ICER1_ICE_USBACT (0x1 << 1) /* USB Activity Interrupt Disable */
#define ICER1_ICE_CANACT (0x1 << 2) /* CAN Activity Interrupt Disable */

/* Interrupt Set-Pending Register 0 register (ISPR0 - 0xE000 E200) */
#define ISPR0_ISP_WDT    (0x1 << 0) /* Watchdog Timer Interrupt Pending set */
#define ISPR0_ISP_TIMER0 (0x1 << 1) /* Timer 0 Interrupt Pending set */
#define ISPR0_ISP_TIMER1 (0x1 << 2) /* Timer 1. Interrupt Pending set */
#define ISPR0_ISP_TIMER2 (0x1 << 3) /* Timer 2 Interrupt Pending set */
#define ISPR0_ISP_TIMER3 (0x1 << 4) /* Timer 3 Interrupt Pending set */
#define ISPR0_ISP_UART0  (0x1 << 5) /* UART0 Interrupt Pending set */
#define ISPR0_ISP_UART1  (0x1 << 6) /* UART1 Interrupt Pending set */
#define ISPR0_ISP_UART2  (0x1 << 7) /* UART2 Interrupt Pending set */
#define ISPR0_ISP_UART3  (0x1 << 8) /* UART3 Interrupt Pending set */
#define ISPR0_ISP_PWM    (0x1 << 9) /* PWM1 Interrupt Pending set */
#define ISPR0_ISP_I2C0   (0x1 << 10) /* I2C0 Interrupt Pending set */
#define ISPR0_ISP_I2C1   (0x1 << 11) /* I2C1 Interrupt Pending set */
#define ISPR0_ISP_I2C2   (0x1 << 12) /* I2C2 Interrupt Pending set */
#define ISPR0_ISP_SPI    (0x1 << 13) /* SPI Interrupt Pending set */
#define ISPR0_ISP_SSP0   (0x1 << 14) /* SSP0 Interrupt Pending set */
#define ISPR0_ISP_SSP1   (0x1 << 15) /* SSP1 Interrupt Pending set */
#define ISPR0_ISP_PLL0   (0x1 << 16) /* PLL0 (Main PLL) Interrupt Pending set */
#define ISPR0_ISP_RTC    (0x1 << 17) /* Real Time Clock (RTC) Interrupt Pending set */
#define ISPR0_ISP_EINT0  (0x1 << 18) /* External Interrupt 0 Interrupt Pending set */
#define ISPR0_ISP_EINT1  (0x1 << 19) /* External Interrupt 1 Interrupt Pending set */
#define ISPR0_ISP_EINT2  (0x1 << 20) /* External Interrupt 2 Interrupt Pending set */
#define ISPR0_ISP_EINT3  (0x1 << 21) /* External Interrupt 3 Interrupt Pending set */
#define ISPR0_ISP_ADC    (0x1 << 22) /* ADC Interrupt Pending set */
#define ISPR0_ISP_BOD    (0x1 << 23) /* BOD Interrupt Pending set */
#define ISPR0_ISP_USB    (0x1 << 24) /* USB Interrupt Pending set */
#define ISPR0_ISP_CAN    (0x1 << 25) /* CAN Interrupt Pending set */
#define ISPR0_ISP_DMA    (0x1 << 26) /* GPDMA Interrupt Pending set */
#define ISPR0_ISP_I2S    (0x1 << 27) /* I2S Interrupt Pending set */
#define ISPR0_ISP_ENET   (0x1 << 28) /* Ethernet Interrupt Pending set */
#define ISPR0_ISP_RIT    (0x1 << 29) /* Repetitive Interrupt Timer Interrupt Pending set */
#define ISPR0_ISP_MCPWM  (0x1 << 30) /* Motor Control PWM Interrupt Pending set */
#define ISPR0_ISP_QEI    (0x1 << 31) /* Quadrature Encoder Interface Interrupt Pending set */

/* Interrupt Set-Pending Register 1 register (ISPR1 - 0xE000 E204) */
#define ISPR1_ISP_PLL1   (0x1 << 0) /* PLL1 (USB PLL) Interrupt Pending set */
#define ISPR1_ISP_USBACT (0x1 << 1) /* USB Activity Interrupt Pending set */
#define ISPR1_ISP_CANACT (0x1 << 2) /* CAN Activity Interrupt Pending set */

/* Interrupt Clear-Pending Register 0 register (ICPR0 - 0xE000 E280) */
#define ICPR0_ICP_WDT    (0x1 << 0) /* Watchdog Timer Interrupt Pending clear */
#define ICPR0_ICP_TIMER0 (0x1 << 1) /* Timer 0 Interrupt Pending clear */
#define ICPR0_ICP_TIMER1 (0x1 << 2) /* Timer 1. Interrupt Pending clear */
#define ICPR0_ICP_TIMER2 (0x1 << 3) /* Timer 2 Interrupt Pending clear */
#define ICPR0_ICP_TIMER3 (0x1 << 4) /* Timer 3 Interrupt Pending clear */
#define ICPR0_ICP_UART0  (0x1 << 5) /* UART0 Interrupt Pending clear */
#define ICPR0_ICP_UART1  (0x1 << 6) /* UART1 Interrupt Pending clear */
#define ICPR0_ICP_UART2  (0x1 << 7) /* UART2 Interrupt Pending clear */
#define ICPR0_ICP_UART3  (0x1 << 8) /* UART3 Interrupt Pending clear */
#define ICPR0_ICP_PWM    (0x1 << 9) /* PWM1 Interrupt Pending clear */
#define ICPR0_ICP_I2C0   (0x1 << 10) /* I2C0 Interrupt Pending clear */
#define ICPR0_ICP_I2C1   (0x1 << 11) /* I2C1 Interrupt Pending clear */
#define ICPR0_ICP_I2C2   (0x1 << 12) /* I2C2 Interrupt Pending clear */
#define ICPR0_ICP_SPI    (0x1 << 13) /* SPI Interrupt Pending clear */
#define ICPR0_ICP_SSP0   (0x1 << 14) /* SSP0 Interrupt Pending clear */
#define ICPR0_ICP_SSP1   (0x1 << 15) /* SSP1 Interrupt Pending clear */
#define ICPR0_ICP_PLL0   (0x1 << 16) /* PLL0 (Main PLL) Interrupt Pending clear */
#define ICPR0_ICP_RTC    (0x1 << 17) /* Real Time Clock (RTC) Interrupt Pending clear */
#define ICPR0_ICP_EINT0  (0x1 << 18) /* External Interrupt 0 Interrupt Pending clear */
#define ICPR0_ICP_EINT1  (0x1 << 19) /* External Interrupt 1 Interrupt Pending clear */
#define ICPR0_ICP_EINT2  (0x1 << 20) /* External Interrupt 2 Interrupt Pending clear */
#define ICPR0_ICP_EINT3  (0x1 << 21) /* External Interrupt 3 Interrupt Pending clear */
#define ICPR0_ICP_ADC    (0x1 << 22) /* ADC Interrupt Pending clear */
#define ICPR0_ICP_BOD    (0x1 << 23) /* BOD Interrupt Pending clear */
#define ICPR0_ICP_USB    (0x1 << 24) /* USB Interrupt Pending clear */
#define ICPR0_ICP_CAN    (0x1 << 25) /* CAN Interrupt Pending clear */
#define ICPR0_ICP_DMA    (0x1 << 26) /* GPDMA Interrupt Pending clear */
#define ICPR0_ICP_I2S    (0x1 << 27) /* I2S Interrupt Pending clear */
#define ICPR0_ICP_ENET   (0x1 << 28) /* Ethernet Interrupt Pending clear */
#define ICPR0_ICP_RIT    (0x1 << 29) /* Repetitive Interrupt Timer Interrupt Pending clear */
#define ICPR0_ICP_MCPWM  (0x1 << 30) /* Motor Control PWM Interrupt Pending clear */
#define ICPR0_ICP_QEI    (0x1 << 31) /* Quadrature Encoder Interface Interrupt Pending clear */

/* Interrupt Clear-Pending Register 1 register (ICPR1 - 0xE000 E284) */
#define ICPR1_ICP_PLL1   (0x1 << 0) /* PLL1 (USB PLL) Interrupt Pending clear */
#define ICPR1_ICP_USBACT (0x1 << 1) /* USB Activity Interrupt Pending clear */
#define ICPR1_ICP_CANACT (0x1 << 2) /* CAN Activity Interrupt Pending clear */

/* Interrupt Active Bit Register 0 (IABR0 - 0xE000 E300) */
#define IABR0_IAB_WDT    (0x1 << 0) /* Watchdog Timer Interrupt Active */
#define IABR0_IAB_TIMER0 (0x1 << 1) /* Timer 0 Interrupt Active */
#define IABR0_IAB_TIMER1 (0x1 << 2) /* Timer 1. Interrupt Active */
#define IABR0_IAB_TIMER2 (0x1 << 3) /* Timer 2 Interrupt Active */
#define IABR0_IAB_TIMER3 (0x1 << 4) /* Timer 3 Interrupt Active */
#define IABR0_IAB_UART0  (0x1 << 5) /* UART0 Interrupt Active */
#define IABR0_IAB_UART1  (0x1 << 6) /* UART1 Interrupt Active */
#define IABR0_IAB_UART2  (0x1 << 7) /* UART2 Interrupt Active */
#define IABR0_IAB_UART3  (0x1 << 8) /* UART3 Interrupt Active */
#define IABR0_IAB_PWM    (0x1 << 9) /* PWM1 Interrupt Active */
#define IABR0_IAB_I2C0   (0x1 << 10) /* I2C0 Interrupt Active */
#define IABR0_IAB_I2C1   (0x1 << 11) /* I2C1 Interrupt Active */
#define IABR0_IAB_I2C2   (0x1 << 12) /* I2C2 Interrupt Active */
#define IABR0_IAB_SPI    (0x1 << 13) /* SPI Interrupt Active */
#define IABR0_IAB_SSP0   (0x1 << 14) /* SSP0 Interrupt Active */
#define IABR0_IAB_SSP1   (0x1 << 15) /* SSP1 Interrupt Active */
#define IABR0_IAB_PLL0   (0x1 << 16) /* PLL0 (Main PLL) Interrupt Active */
#define IABR0_IAB_RTC    (0x1 << 17) /* Real Time Clock (RTC) Interrupt Active */
#define IABR0_IAB_EINT0  (0x1 << 18) /* External Interrupt 0 Interrupt Active */
#define IABR0_IAB_EINT1  (0x1 << 19) /* External Interrupt 1 Interrupt Active */
#define IABR0_IAB_EINT2  (0x1 << 20) /* External Interrupt 2 Interrupt Active */
#define IABR0_IAB_EINT3  (0x1 << 21) /* External Interrupt 3 Interrupt Active */
#define IABR0_IAB_ADC    (0x1 << 22) /* ADC Interrupt Active */
#define IABR0_IAB_BOD    (0x1 << 23) /* BOD Interrupt Active */
#define IABR0_IAB_USB    (0x1 << 24) /* USB Interrupt Active */
#define IABR0_IAB_CAN    (0x1 << 25) /* CAN Interrupt Active */
#define IABR0_IAB_DMA    (0x1 << 26) /* GPDMA Interrupt Active */
#define IABR0_IAB_I2S    (0x1 << 27) /* I2S Interrupt Active */
#define IABR0_IAB_ENET   (0x1 << 28) /* Ethernet Interrupt Active */
#define IABR0_IAB_RIT    (0x1 << 29) /* Repetitive Interrupt Timer Interrupt Active */
#define IABR0_IAB_MCPWM  (0x1 << 30) /* Motor Control PWM Interrupt Active */
#define IABR0_IAB_QEI    (0x1 << 31) /* Quadrature Encoder Interface Interrupt Active */

/* Interrupt Active Bit Register 1 (IABR1 - 0xE000 E304) */
#define IABR1_IAB_PLL1   (0x1 << 0) /* PLL1 (USB PLL) Interrupt Active */
#define IABR1_IAB_USBACT (0x1 << 1) /* USB Activity Interrupt Active */
#define IABR1_IAB_CANACT (0x1 << 2) /* CAN Activity Interrupt Active */

/* Interrupt Priority Register 0 (IPR0 - 0xE000 E400) */
#define IPR0_IP_WDT    (0x1F << 3) /* Watchdog Timer Interrupt Priority */
#define IPR0_IP_TIMER0 (0x1F << 11) /* Timer 0 Interrupt Priority */
#define IPR0_IP_TIMER1 (0x1F << 19) /* Timer 1 Interrupt Priority */
#define IPR0_IP_TIMER2 (0x1F << 27) /* Timer 2 Interrupt Priority */

/* Interrupt Priority Register 1 (IPR1 - 0xE000 E404) */
#define IPR1_IP_TIMER3 (0x1F << 3) /* Timer 3 Interrupt Priority */
#define IPR1_IP_UART0  (0x1F << 11) /* UART0 Interrupt Priority */
#define IPR1_IP_UART1  (0x1F << 19) /* UART1 Interrupt Priority */
#define IPR1_IP_UART2  (0x1F << 27) /* UART2 Interrupt Priority */

/* Interrupt Priority Register 2 (IPR2 - 0xE000 E408) */
#define IPR2_IP_UART3 (0x1F << 3) /* UART3 Interrupt Priority */
#define IPR2_IP_PWM   (0x1F << 11) /* PWM Interrupt Priority */
#define IPR2_IP_I2C0  (0x1F << 19) /* I2C0 Interrupt Priority */
#define IPR2_IP_I2C1  (0x1F << 27) /* I2C1 Interrupt Priority */

/* Interrupt Priority Register 3 (IPR3 - 0xE000 E40C) */
#define IPR3_IP_I2C2 (0x1F << 3) /* I2C2 Interrupt Priority */
#define IPR3_IP_SPI  (0x1F << 11) /* SPI Interrupt Priority */
#define IPR3_IP_SSP0 (0x1F << 19) /* SSP0 Interrupt Priority */
#define IPR3_IP_SSP1 (0x1F << 27) /* SSP1 Interrupt Priority */

/* Interrupt Priority Register 4 (IPR4 - 0xE000 E410) */
#define IPR4_IP_PLL0  (0x1F << 3) /* PLL0 (Main PLL) Interrupt Priority */
#define IPR4_IP_RTC   (0x1F << 11) /* Real Time Clock (RTC) Interrupt Priority */
#define IPR4_IP_EINT0 (0x1F << 19) /* External Interrupt 0 Interrupt Priority */
#define IPR4_IP_EINT1 (0x1F << 27) /* External Interrupt 1 Interrupt Priority */

/* Interrupt Priority Register 5 (IPR5 - 0xE000 E414) */
#define IPR5_IP_EINT2 (0x1F << 3) /* External Interrupt 2 Interrupt Priority */
#define IPR5_IP_EINT3 (0x1F << 11) /* External Interrupt 3 Interrupt Priority */
#define IPR5_IP_ADC   (0x1F << 19) /* ADC Interrupt Priority */
#define IPR5_IP_BOD   (0x1F << 27) /* BOD Interrupt Priority */

/* Interrupt Priority Register 6 (IPR6 - 0xE000 E418) */
#define IPR6_IP_USB (0x1F << 3) /* USB Interrupt Priority */
#define IPR6_IP_CAN (0x1F << 11) /* CAN Interrupt Priority */
#define IPR6_IP_DMA (0x1F << 19) /* GPDMA Interrupt Priority */
#define IPR6_IP_I2S (0x1F << 27) /* I2S Interrupt Priority */

/* Interrupt Priority Register 7 (IPR7 - 0xE000 E41C) */
#define IPR7_IP_ENET  (0x1F << 3) /* Ethernet Interrupt Priority */
#define IPR7_IP_RIT   (0x1F << 11) /* Repetitive Interrupt Timer Interrupt Priority */
#define IPR7_IP_MCPWM (0x1F << 19) /* Motor Control PWM Interrupt Priority */
#define IPR7_IP_QEI   (0x1F << 27) /* Quadrature Encoder Interface Interrupt Priority */

/* Interrupt Priority Register 8 (IPR8 - 0xE000 E420) */
#define IPR8_IP_PLL1   (0x1F << 3) /* PLL1 (USB PLL) Interrupt Priority */
#define IPR8_IP_USBACT (0x1F << 11) /* USB Activity Interrupt Priority */
#define IPR8_IP_CANACT (0x1F << 19) /* CAN Activity Interrupt Priority */

/* Software Trigger Interrupt Register (STIR - 0xE000 EF00) */
#define STIR_INTID (0x1FF << 0)

/* Cortex-M3 interrupt IDs */
#define IRQ_NonMaskableInt   (-14)
#define IRQ_MemoryManagement (-12)
#define IRQ_BusFault         (-11)
#define IRQ_UsageFault       (-10)
#define IRQ_SVCall           (-5)
#define IRQ_DebugMonitor     (-4)
#define IRQ_PendSV           (-2)
#define IRQ_SysTick          (-1)

/* LPC17xx interrupt IDs */
#define IRQ_WDT      (0)
#define IRQ_TIMER0   (1)
#define IRQ_TIMER1   (2)
#define IRQ_TIMER2   (3)
#define IRQ_TIMER3   (4)
#define IRQ_UART0    (5)
#define IRQ_UART1    (6)
#define IRQ_UART2    (7)
#define IRQ_UART3    (8)
#define IRQ_PWM      (9)
#define IRQ_I2C0     (10)
#define IRQ_I2C1     (11)
#define IRQ_I2C2     (12)
#define IRQ_SPI      (13)
#define IRQ_SSP0     (14)
#define IRQ_SSP1     (15)
#define IRQ_PLL0     (16)
#define IRQ_RTC      (17)
#define IRQ_EINT0    (18)
#define IRQ_EINT1    (19)
#define IRQ_EINT2    (20)
#define IRQ_EINT3    (21)
#define IRQ_ADC      (22)
#define IRQ_BOD      (23)
#define IRQ_USB      (24)
#define IRQ_CAN      (25)
#define IRQ_DMA      (26)
#define IRQ_I2S      (27)
#define IRQ_ENET     (28)
#define IRQ_RIT      (29)
#define IRQ_MCPWM    (30)
#define IRQ_QEI      (31)
#define IRQ_PLL1     (32)
#define IRQ_USBACT   (33)
#define IRQ_CANACT   (34)

/* pin connect block registers */
#define PINSEL0     LPC17_REG(0x4002C000) /* Pin function select register 0 */
#define PINSEL1     LPC17_REG(0x4002C004) /* Pin function select register 1 */
#define PINSEL2     LPC17_REG(0x4002C008) /* Pin function select register 2 */
#define PINSEL3     LPC17_REG(0x4002C00C) /* Pin function select register 3 */
#define PINSEL4     LPC17_REG(0x4002C010) /* Pin function select register 4 */
#define PINSEL7     LPC17_REG(0x4002C01C) /* Pin function select register 7 */
#define PINSEL8     LPC17_REG(0x4002C020) /* Pin function select register 8 */
#define PINSEL9     LPC17_REG(0x4002C024) /* Pin function select register 9 */
#define PINSEL10    LPC17_REG(0x4002C028) /* Pin function select register 10 */
#define PINMODE0    LPC17_REG(0x4002C040) /* Pin mode select register 0 */
#define PINMODE1    LPC17_REG(0x4002C044) /* Pin mode select register 1 */
#define PINMODE2    LPC17_REG(0x4002C048) /* Pin mode select register 2 */
#define PINMODE3    LPC17_REG(0x4002C04C) /* Pin mode select register 3 */
#define PINMODE4    LPC17_REG(0x4002C050) /* Pin mode select register 4 */
#define PINMODE5    LPC17_REG(0x4002C054) /* Pin mode select register 5 */
#define PINMODE6    LPC17_REG(0x4002C058) /* Pin mode select register 6 */
#define PINMODE7    LPC17_REG(0x4002C05C) /* Pin mode select register 7 */
#define PINMODE9    LPC17_REG(0x4002C064) /* Pin mode select register 9 */
#define PINMODE_OD0 LPC17_REG(0x4002C068) /* Open drain mode control register 0 */
#define PINMODE_OD1 LPC17_REG(0x4002C06C) /* Open drain mode control register 1 */
#define PINMODE_OD2 LPC17_REG(0x4002C070) /* Open drain mode control register 2 */
#define PINMODE_OD3 LPC17_REG(0x4002C074) /* Open drain mode control register 3 */
#define PINMODE_OD4 LPC17_REG(0x4002C078) /* Open drain mode control register 4 */
#define I2CPADCFG   LPC17_REG(0x4002C07C) /* I2C Pin Configuration register */

/* Pin function select register 0 (PINSEL0 - 0x4002 C000) */
#define PINSEL0_P0_0  (0x3 << 0)
#define PINSEL0_P0_1  (0x3 << 2)
#define PINSEL0_P0_2  (0x3 << 4)
#define PINSEL0_P0_3  (0x3 << 6)
#define PINSEL0_P0_4  (0x3 << 8)
#define PINSEL0_P0_5  (0x3 << 10)
#define PINSEL0_P0_6  (0x3 << 12)
#define PINSEL0_P0_7  (0x3 << 14)
#define PINSEL0_P0_8  (0x3 << 16)
#define PINSEL0_P0_9  (0x3 << 18)
#define PINSEL0_P0_10 (0x3 << 20)
#define PINSEL0_P0_11 (0x3 << 22)
#define PINSEL0_P0_15 (0x3 << 30)

/* Pin function select register 1 (PINSEL1 - 0x4002 C004) */
#define PINSEL1_P0_16 (0x3 << 0)
#define PINSEL1_P0_17 (0x3 << 2)
#define PINSEL1_P0_18 (0x3 << 4)
#define PINSEL1_P0_19 (0x3 << 6)
#define PINSEL1_P0_20 (0x3 << 8)
#define PINSEL1_P0_21 (0x3 << 10)
#define PINSEL1_P0_22 (0x3 << 12)
#define PINSEL1_P0_23 (0x3 << 14)
#define PINSEL1_P0_24 (0x3 << 16)
#define PINSEL1_P0_25 (0x3 << 18)
#define PINSEL1_P0_26 (0x3 << 20)
#define PINSEL1_P0_27 (0x3 << 22)
#define PINSEL1_P0_28 (0x3 << 24)
#define PINSEL1_P0_29 (0x3 << 26)
#define PINSEL1_P0_30 (0x3 << 28)

/* Pin function select register 2 (PINSEL2 - 0x4002 C008) */
#define PINSEL2_P1_0  (0x3 << 0)
#define PINSEL2_P1_1  (0x3 << 2)
#define PINSEL2_P1_4  (0x3 << 8)
#define PINSEL2_P1_8  (0x3 << 16)
#define PINSEL2_P1_9  (0x3 << 18)
#define PINSEL2_P1_10 (0x3 << 20)
#define PINSEL2_P1_14 (0x3 << 28)
#define PINSEL2_P1_15 (0x3 << 30)

/* Pin function select register 3 (PINSEL3 - 0x4002 C00C) */
#define PINSEL3_P1_16 (0x3 << 0)
#define PINSEL3_P1_17 (0x3 << 2)
#define PINSEL3_P1_18 (0x3 << 4)
#define PINSEL3_P1_19 (0x3 << 6)
#define PINSEL3_P1_20 (0x3 << 8)
#define PINSEL3_P1_21 (0x3 << 10)
#define PINSEL3_P1_22 (0x3 << 12)
#define PINSEL3_P1_23 (0x3 << 14)
#define PINSEL3_P1_24 (0x3 << 16)
#define PINSEL3_P1_25 (0x3 << 18)
#define PINSEL3_P1_26 (0x3 << 20)
#define PINSEL3_P1_27 (0x3 << 22)
#define PINSEL3_P1_28 (0x3 << 24)
#define PINSEL3_P1_29 (0x3 << 26)
#define PINSEL3_P1_30 (0x3 << 28)
#define PINSEL3_P1_31 (0x3 << 30)

