greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* Pin function select register 4 (PINSEL4 - 0x4002 C010) */
#define PINSEL4_P2_0  (0x3 << 0)
#define PINSEL4_P2_1  (0x3 << 2)
#define PINSEL4_P2_2  (0x3 << 4)
#define PINSEL4_P2_3  (0x3 << 6)
#define PINSEL4_P2_4  (0x3 << 8)
#define PINSEL4_P2_5  (0x3 << 10)
#define PINSEL4_P2_6  (0x3 << 12)
#define PINSEL4_P2_7  (0x3 << 14)
#define PINSEL4_P2_8  (0x3 << 16)
#define PINSEL4_P2_9  (0x3 << 18)
#define PINSEL4_P2_10 (0x3 << 20)
#define PINSEL4_P2_11 (0x3 << 22)
#define PINSEL4_P2_12 (0x3 << 24)
#define PINSEL4_P2_13 (0x3 << 26)

/* Pin function select register 7 (PINSEL7 - 0x4002 C01C) */
#define PINSEL7_P3_25 (0x3 << 18)
#define PINSEL7_P3_26 (0x3 << 20)

/* Pin function select register 9 (PINSEL9 - 0x4002 C024) */
#define PINSEL9_P4_28 (0x3 << 24)
#define PINSEL9_P4_29 (0x3 << 26)

/* Pin function select register 10 (PINSEL10 - 0x4002 C028) */
#define PINSEL10_GPIOTRACE (0x1 << 3)

/* Pin Mode select register 0 (PINMODE0 - 0x4002 C040) */
#define PINMODE0_P0_00MODE (0x3 << 0)
#define PINMODE0_P0_01MODE (0x3 << 2)
#define PINMODE0_P0_02MODE (0x3 << 4)
#define PINMODE0_P0_03MODE (0x3 << 6)
#define PINMODE0_P0_04MODE (0x3 << 8)
#define PINMODE0_P0_05MODE (0x3 << 10)
#define PINMODE0_P0_06MODE (0x3 << 12)
#define PINMODE0_P0_07MODE (0x3 << 14)
#define PINMODE0_P0_08MODE (0x3 << 16)
#define PINMODE0_P0_09MODE (0x3 << 18)
#define PINMODE0_P0_10MODE (0x3 << 20)
#define PINMODE0_P0_11MODE (0x3 << 22)
#define PINMODE0_P0_15MODE (0x3 << 30)

/* Pin Mode select register 1 (PINMODE1 - 0x4002 C044) */
#define PIMODE1_P0_16MODE (0x3 << 0)
#define PIMODE1_P0_17MODE (0x3 << 2)
#define PIMODE1_P0_18MODE (0x3 << 4)
#define PIMODE1_P0_19MODE (0x3 << 6)
#define PIMODE1_P0_20MODE (0x3 << 8)
#define PIMODE1_P0_21MODE (0x3 << 10)
#define PIMODE1_P0_22MODE (0x3 << 12)
#define PIMODE1_P0_23MODE (0x3 << 14)
#define PIMODE1_P0_24MODE (0x3 << 16)
#define PIMODE1_P0_25MODE (0x3 << 18)
#define PIMODE1_P0_26MODE (0x3 << 20)

/* Pin Mode select register 2 (PINMODE2 - 0x4002 C048) */
#define PINMODE2_P1_00MODE (0x3 << 0)
#define PINMODE2_P1_01MODE (0x3 << 2)
#define PINMODE2_P1_04MODE (0x3 << 8)
#define PINMODE2_P1_08MODE (0x3 << 16)
#define PINMODE2_P1_09MODE (0x3 << 18)
#define PINMODE2_P1_10MODE (0x3 << 20)
#define PINMODE2_P1_14MODE (0x3 << 28)
#define PINMODE2_P1_15MODE (0x3 << 30)

/* Pin Mode select register 3 (PINMODE3 - 0x4002 C04C) */
#define PINMODE3_P1_16MODE (0x3 << 0)
#define PINMODE3_P1_17MODE (0x3 << 2)
#define PINMODE3_P1_18MODE (0x3 << 4)
#define PINMODE3_P1_19MODE (0x3 << 6)
#define PINMODE3_P1_20MODE (0x3 << 8)
#define PINMODE3_P1_21MODE (0x3 << 10)
#define PINMODE3_P1_22MODE (0x3 << 12)
#define PINMODE3_P1_23MODE (0x3 << 14)
#define PINMODE3_P1_24MODE (0x3 << 16)
#define PINMODE3_P1_25MODE (0x3 << 18)
#define PINMODE3_P1_26MODE (0x3 << 20)
#define PINMODE3_P1_27MODE (0x3 << 22)
#define PINMODE3_P1_28MODE (0x3 << 24)
#define PINMODE3_P1_29MODE (0x3 << 26)
#define PINMODE3_P1_30MODE (0x3 << 28)
#define PINMODE3_P1_31MODE (0x3 << 30)

/* Pin Mode select register 4 (PINMODE4 - 0x4002 C050) */
#define PINMODE4_P2_00MODE (0x3 << 0)
#define PINMODE4_P2_01MODE (0x3 << 2)
#define PINMODE4_P2_02MODE (0x3 << 4)
#define PINMODE4_P2_03MODE (0x3 << 6)
#define PINMODE4_P2_04MODE (0x3 << 8)
#define PINMODE4_P2_05MODE (0x3 << 10)
#define PINMODE4_P2_06MODE (0x3 << 12)
#define PINMODE4_P2_07MODE (0x3 << 14)
#define PINMODE4_P2_08MODE (0x3 << 16)
#define PINMODE4_P2_09MODE (0x3 << 18)
#define PINMODE4_P2_10MODE (0x3 << 20)
#define PINMODE4_P2_11MODE (0x3 << 22)
#define PINMODE4_P2_12MODE (0x3 << 24)
#define PINMODE4_P2_13MODE (0x3 << 26)

/* Pin Mode select register 7 (PINMODE7 - 0x4002 C05C) */
#define PINMODE7_P3_25MODE (0x3 << 18)
#define PINMODE7_P3_26MODE (0x3 << 20)

/* Pin Mode select register 9 (PINMODE9 - 0x4002 C064) */
#define PINMODE9_P4_28MODE (0x3 << 24)
#define PINMODE9_P4_29MODE (0x3 << 26)

/*
 * skipped:
 *
 * Open Drain Pin Mode select register 0 (PINMODE_OD0 - 0x4002 C068)
 * Open Drain Pin Mode select register 1 (PINMODE_OD1 - 0x4002 C06C)
 * Open Drain Pin Mode select register 2 (PINMODE_OD2 - 0x4002 C070)
 * Open Drain Pin Mode select register 3 (PINMODE_OD3 - 0x4002 C074)
 * Open Drain Pin Mode select register 4 (PINMODE_OD4 - 0x4002 C078)
 */

/* I2C Pin Configuration register (I2CPADCFG - 0x4002 C07C) */
#define I2CPADCFG_SDADRV0 (0x1 << 0)
#define I2CPADCFG_SDAI2C0 (0x1 << 1)
#define I2CPADCFG_SCLDRV0 (0x1 << 2)
#define I2CPADCFG_SCLI2C0 (0x1 << 3)


/* GPIO registers */
#define FIO0DIR  LPC17_REG(0x2009C000) /* Fast GPIO Port Direction control register 0 (FIODIR) */
#define FIO1DIR  LPC17_REG(0x2009C020) /* Fast GPIO Port Direction control register 1 (FIODIR) */
#define FIO2DIR  LPC17_REG(0x2009C040) /* Fast GPIO Port Direction control register 2 (FIODIR) */
#define FIO3DIR  LPC17_REG(0x2009C060) /* Fast GPIO Port Direction control register 3 (FIODIR) */
#define FIO4DIR  LPC17_REG(0x2009C080) /* Fast GPIO Port Direction control register 4 (FIODIR) */
#define FIO0MASK LPC17_REG(0x2009C010) /* Fast Mask register for port 0 (FIOMASK) */
#define FIO1MASK LPC17_REG(0x2009C030) /* Fast Mask register for port 1 (FIOMASK) */
#define FIO2MASK LPC17_REG(0x2009C050) /* Fast Mask register for port 2 (FIOMASK) */
#define FIO3MASK LPC17_REG(0x2009C070) /* Fast Mask register for port 3 (FIOMASK) */
#define FIO4MASK LPC17_REG(0x2009C090) /* Fast Mask register for port 4 (FIOMASK) */
#define FIO0PIN  LPC17_REG(0x2009C014) /* Fast Port 0 Pin value register using FIOMASK (FIOPIN) */
#define FIO1PIN  LPC17_REG(0x2009C034) /* Fast Port 1 Pin value register using FIOMASK (FIOPIN) */
#define FIO2PIN  LPC17_REG(0x2009C054) /* Fast Port 2 Pin value register using FIOMASK (FIOPIN) */
#define FIO3PIN  LPC17_REG(0x2009C074) /* Fast Port 3 Pin value register using FIOMASK (FIOPIN) */
#define FIO4PIN  LPC17_REG(0x2009C094) /* Fast Port 4 Pin value register using FIOMASK (FIOPIN) */
#define FIO0SET  LPC17_REG(0x2009C018) /* Fast Port 0 Output Set register using FIOMASK (FIOSET) */
#define FIO1SET  LPC17_REG(0x2009C038) /* Fast Port 1 Output Set register using FIOMASK (FIOSET) */
#define FIO2SET  LPC17_REG(0x2009C058) /* Fast Port 2 Output Set register using FIOMASK (FIOSET) */
#define FIO3SET  LPC17_REG(0x2009C078) /* Fast Port 3 Output Set register using FIOMASK (FIOSET) */
#define FIO4SET  LPC17_REG(0x2009C098) /* Fast Port 4 Output Set register using FIOMASK (FIOSET) */
#define FIO0CLR  LPC17_REG(0x2009C01C) /* Fast Port 0 Output Clear register using FIOMASK (FIOCLR) */
#define FIO1CLR  LPC17_REG(0x2009C03C) /* Fast Port 1 Output Clear register using FIOMASK (FIOCLR) */
#define FIO2CLR  LPC17_REG(0x2009C05C) /* Fast Port 2 Output Clear register using FIOMASK (FIOCLR) */
#define FIO3CLR  LPC17_REG(0x2009C07C) /* Fast Port 3 Output Clear register using FIOMASK (FIOCLR) */
#define FIO4CLR  LPC17_REG(0x2009C09C) /* Fast Port 4 Output Clear register using FIOMASK (FIOCLR) */

/* GPIO interrupt registers */
#define IO0IntEnR   LPC17_REG(0x40028090) /* IntEnR: GPIO Interrupt Enable for Rising edge */
#define IO2IntEnR   LPC17_REG(0x400280B0) /* IntEnR: GPIO Interrupt Enable for Rising edge */
#define IO0IntEnF   LPC17_REG(0x40028094) /* IntEnF: GPIO Interrupt Enable for Falling edge */
#define IO2IntEnF   LPC17_REG(0x400280B4) /* IntEnF: GPIO Interrupt Enable for Falling edge */
#define IO0IntStatR LPC17_REG(0x40028084) /* IntStatR: GPIO Interrupt Status for Rising edge */
#define IO2IntStatR LPC17_REG(0x400280A4) /* IntStatR: GPIO Interrupt Status for Rising edge */
#define IO0IntStatF LPC17_REG(0x40028088) /* IntStatF: GPIO Interrupt Status for Falling edge */
#define IO2IntStatF LPC17_REG(0x400280A8) /* IntStatF: GPIO Interrupt Status for Falling edge */
#define IO0IntClr   LPC17_REG(0x4002808C) /* IntClr: GPIO Interrupt Clear */
#define IO2IntClr   LPC17_REG(0x400280AC) /* IntClr: GPIO Interrupt Clear */
#define IOIntStatus LPC17_REG(0x40028080) /* IntStatus: GPIO overall Interrupt Status */

/* byte accessible FIODIR registers */
#define FIO0DIR0 LPC17_REG8(0x2009C000)
#define FIO1DIR0 LPC17_REG8(0x2009C020)
#define FIO2DIR0 LPC17_REG8(0x2009C040)
#define FIO3DIR0 LPC17_REG8(0x2009C060)
#define FIO4DIR0 LPC17_REG8(0x2009C080)
#define FIO0DIR1 LPC17_REG8(0x2009C001)
#define FIO1DIR1 LPC17_REG8(0x2009C021)
#define FIO2DIR1 LPC17_REG8(0x2009C041)
#define FIO3DIR1 LPC17_REG8(0x2009C061)
#define FIO4DIR1 LPC17_REG8(0x2009C081)
#define FIO0DIR2 LPC17_REG8(0x2009C002)
#define FIO1DIR2 LPC17_REG8(0x2009C022)
#define FIO2DIR2 LPC17_REG8(0x2009C042)
#define FIO3DIR2 LPC17_REG8(0x2009C062)
#define FIO4DIR2 LPC17_REG8(0x2009C082)
#define FIO0DIR3 LPC17_REG8(0x2009C003)
#define FIO1DIR3 LPC17_REG8(0x2009C023)
#define FIO2DIR3 LPC17_REG8(0x2009C043)
#define FIO3DIR3 LPC17_REG8(0x2009C063)
#define FIO4DIR3 LPC17_REG8(0x2009C083)

