greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* half-word accessible FIODIR registers */
#define FIO0DIRL LPC17_REG16(0x2009C000)
#define FIO1DIRL LPC17_REG16(0x2009C020)
#define FIO2DIRL LPC17_REG16(0x2009C040)
#define FIO3DIRL LPC17_REG16(0x2009C060)
#define FIO4DIRL LPC17_REG16(0x2009C080)
#define FIO0DIRU LPC17_REG16(0x2009C002)
#define FIO1DIRU LPC17_REG16(0x2009C022)
#define FIO2DIRU LPC17_REG16(0x2009C042)
#define FIO3DIRU LPC17_REG16(0x2009C062)
#define FIO4DIRU LPC17_REG16(0x2009C082)

/* byte accessible FIOSET registers */
#define FIO0SET0 LPC17_REG8(0x2009C018)
#define FIO1SET0 LPC17_REG8(0x2009C038)
#define FIO2SET0 LPC17_REG8(0x2009C058)
#define FIO3SET0 LPC17_REG8(0x2009C078)
#define FIO4SET0 LPC17_REG8(0x2009C098)
#define FIO0SET1 LPC17_REG8(0x2009C019)
#define FIO1SET1 LPC17_REG8(0x2009C039)
#define FIO2SET1 LPC17_REG8(0x2009C059)
#define FIO3SET1 LPC17_REG8(0x2009C079)
#define FIO4SET1 LPC17_REG8(0x2009C099)
#define FIO0SET2 LPC17_REG8(0x2009C01A)
#define FIO1SET2 LPC17_REG8(0x2009C03A)
#define FIO2SET2 LPC17_REG8(0x2009C05A)
#define FIO3SET2 LPC17_REG8(0x2009C07A)
#define FIO4SET2 LPC17_REG8(0x2009C09A)
#define FIO0SET3 LPC17_REG8(0x2009C01B)
#define FIO1SET3 LPC17_REG8(0x2009C03B)
#define FIO2SET3 LPC17_REG8(0x2009C05B)
#define FIO3SET3 LPC17_REG8(0x2009C07B)
#define FIO4SET3 LPC17_REG8(0x2009C09B)

/* half-word accessible FIOSET registers */
#define FIO0SETL LPC17_REG16(0x2009C018)
#define FIO1SETL LPC17_REG16(0x2009C038)
#define FIO2SETL LPC17_REG16(0x2009C058)
#define FIO3SETL LPC17_REG16(0x2009C078)
#define FIO4SETL LPC17_REG16(0x2009C098)
#define FIO0SETU LPC17_REG16(0x2009C01A)
#define FIO1SETU LPC17_REG16(0x2009C03A)
#define FIO2SETU LPC17_REG16(0x2009C05A)
#define FIO3SETU LPC17_REG16(0x2009C07A)
#define FIO4SETU LPC17_REG16(0x2009C09A)

/* byte accessible FIOCLR registers */
#define FIO0CLR0 LPC17_REG8(0x2009C01C)
#define FIO1CLR0 LPC17_REG8(0x2009C03C)
#define FIO2CLR0 LPC17_REG8(0x2009C05C)
#define FIO3CLR0 LPC17_REG8(0x2009C07C)
#define FIO4CLR0 LPC17_REG8(0x2009C09C)
#define FIO0CLR1 LPC17_REG8(0x2009C01D)
#define FIO1CLR1 LPC17_REG8(0x2009C03D)
#define FIO2CLR1 LPC17_REG8(0x2009C05D)
#define FIO3CLR1 LPC17_REG8(0x2009C07D)
#define FIO4CLR1 LPC17_REG8(0x2009C09D)
#define FIO0CLR2 LPC17_REG8(0x2009C01E)
#define FIO1CLR2 LPC17_REG8(0x2009C03E)
#define FIO2CLR2 LPC17_REG8(0x2009C05E)
#define FIO3CLR2 LPC17_REG8(0x2009C07E)
#define FIO4CLR2 LPC17_REG8(0x2009C09E)
#define FIO0CLR3 LPC17_REG8(0x2009C01F)
#define FIO1CLR3 LPC17_REG8(0x2009C03F)
#define FIO2CLR3 LPC17_REG8(0x2009C05F)
#define FIO3CLR3 LPC17_REG8(0x2009C07F)
#define FIO4CLR3 LPC17_REG8(0x2009C09F)

/* half-word accessible FIOCLR registers */
#define FIO0CLRL LPC17_REG16(0x2009C01C)
#define FIO1CLRL LPC17_REG16(0x2009C03C)
#define FIO2CLRL LPC17_REG16(0x2009C05C)
#define FIO3CLRL LPC17_REG16(0x2009C07C)
#define FIO4CLRL LPC17_REG16(0x2009C09C)
#define FIO0CLRU LPC17_REG16(0x2009C01E)
#define FIO1CLRU LPC17_REG16(0x2009C03E)
#define FIO2CLRU LPC17_REG16(0x2009C05E)
#define FIO3CLRU LPC17_REG16(0x2009C07E)
#define FIO4CLRU LPC17_REG16(0x2009C09E)

/* byte accessible FIOPIN registers */
#define FIO0PIN0 LPC17_REG8(0x2009C014)
#define FIO1PIN0 LPC17_REG8(0x2009C034)
#define FIO2PIN0 LPC17_REG8(0x2009C054)
#define FIO3PIN0 LPC17_REG8(0x2009C074)
#define FIO4PIN0 LPC17_REG8(0x2009C094)
#define FIO0PIN1 LPC17_REG8(0x2009C015)
#define FIO1PIN1 LPC17_REG8(0x2009C035)
#define FIO2PIN1 LPC17_REG8(0x2009C055)
#define FIO3PIN1 LPC17_REG8(0x2009C075)
#define FIO4PIN1 LPC17_REG8(0x2009C095)
#define FIO0PIN2 LPC17_REG8(0x2009C016)
#define FIO1PIN2 LPC17_REG8(0x2009C036)
#define FIO2PIN2 LPC17_REG8(0x2009C056)
#define FIO3PIN2 LPC17_REG8(0x2009C076)
#define FIO4PIN2 LPC17_REG8(0x2009C096)
#define FIO0PIN3 LPC17_REG8(0x2009C017)
#define FIO1PIN3 LPC17_REG8(0x2009C037)
#define FIO2PIN3 LPC17_REG8(0x2009C057)
#define FIO3PIN3 LPC17_REG8(0x2009C077)
#define FIO4PIN3 LPC17_REG8(0x2009C097)

/* half-word accessible FIOPIN registers */
#define FIO0PINL LPC17_REG16(0x2009C014)
#define FIO1PINL LPC17_REG16(0x2009C034)
#define FIO2PINL LPC17_REG16(0x2009C054)
#define FIO3PINL LPC17_REG16(0x2009C074)
#define FIO4PINL LPC17_REG16(0x2009C094)
#define FIO0PINU LPC17_REG16(0x2009C016)
#define FIO1PINU LPC17_REG16(0x2009C036)
#define FIO2PINU LPC17_REG16(0x2009C056)
#define FIO3PINU LPC17_REG16(0x2009C076)
#define FIO4PINU LPC17_REG16(0x2009C096)

/* byte accessible FIOMASK registers */
#define FIO0MASK0 LPC17_REG8(0x2009C010)
#define FIO1MASK0 LPC17_REG8(0x2009C030)
#define FIO2MASK0 LPC17_REG8(0x2009C050)
#define FIO3MASK0 LPC17_REG8(0x2009C070)
#define FIO4MASK0 LPC17_REG8(0x2009C090)
#define FIO0MASK1 LPC17_REG8(0x2009C011)
#define FIO1MASK1 LPC17_REG8(0x2009C031)
#define FIO2MASK1 LPC17_REG8(0x2009C051)
#define FIO3MASK1 LPC17_REG8(0x2009C071)
#define FIO4MASK1 LPC17_REG8(0x2009C091)
#define FIO0MASK2 LPC17_REG8(0x2009C012)
#define FIO1MASK2 LPC17_REG8(0x2009C032)
#define FIO2MASK2 LPC17_REG8(0x2009C052)
#define FIO3MASK2 LPC17_REG8(0x2009C072)
#define FIO4MASK2 LPC17_REG8(0x2009C092)
#define FIO0MASK3 LPC17_REG8(0x2009C013)
#define FIO1MASK3 LPC17_REG8(0x2009C033)
#define FIO2MASK3 LPC17_REG8(0x2009C053)
#define FIO3MASK3 LPC17_REG8(0x2009C073)
#define FIO4MASK3 LPC17_REG8(0x2009C093)

/* half-word accessible FIOMASK registers */
#define FIO0MASKL LPC17_REG16(0x2009C010)
#define FIO1MASKL LPC17_REG16(0x2009C030)
#define FIO2MASKL LPC17_REG16(0x2009C050)
#define FIO3MASKL LPC17_REG16(0x2009C070)
#define FIO4MASKL LPC17_REG16(0x2009C090)
#define FIO0MASKU LPC17_REG16(0x2009C012)
#define FIO1MASKU LPC17_REG16(0x2009C032)
#define FIO2MASKU LPC17_REG16(0x2009C052)
#define FIO3MASKU LPC17_REG16(0x2009C072)
#define FIO4MASKU LPC17_REG16(0x2009C092)

/* GPIO overall Interrupt Status register (IOIntStatus - 0x4002 8080) */
#define IOIntStatus_P0Int (0x1 << 0)
#define IOIntStatus_P2Int (0x1 << 2)

/*
 * skipped:
 *
 * GPIO Interrupt Enable for port 0 Rising Edge (IO0IntEnR - 0x4002 8090)
 * GPIO Interrupt Enable for port 2 Rising Edge (IO2IntEnR - 0x4002 80B0)
 * GPIO Interrupt Enable for port 0 Falling Edge (IO0IntEnF - 0x4002 8094)
 * GPIO Interrupt Enable for port 2 Falling Edge (IO2IntEnF - 0x4002 80B4)
 * GPIO Interrupt Status for port 0 Rising Edge Interrupt (IO0IntStatR - 0x4002 8084)
 * GPIO Interrupt Status for port 2 Rising Edge Interrupt (IO2IntStatR - 0x4002 80A4)
 * GPIO Interrupt Status for port 0 Falling Edge Interrupt (IO0IntStatF - 0x4002 8088)
 * GPIO Interrupt Status for port 2 Falling Edge Interrupt (IO2IntStatF - 0x4002 80A8)
 * GPIO Interrupt Clear register for port 0 (IO0IntClr - 0x4002 808C)
 * GPIO Interrupt Clear register for port 0 (IO2IntClr - 0x4002 80AC)
 */


/* ethernet registers */

