greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* MAC registers */
#define MAC1 LPC17_REG(0x50000000) /* MAC configuration register 1 */
#define MAC2 LPC17_REG(0x50000004) /* MAC configuration register 2 */
#define IPGT LPC17_REG(0x50000008) /* Back-to-Back Inter-Packet-Gap register */
#define IPGR LPC17_REG(0x5000000C) /* Non Back-to-Back Inter-Packet-Gap register */
#define CLRT LPC17_REG(0x50000010) /* Collision window / Retry register */
#define MAXF LPC17_REG(0x50000014) /* Maximum Frame register */
#define SUPP LPC17_REG(0x50000018) /* PHY Support register */
#define TEST LPC17_REG(0x5000001C) /* Test register */
#define MCFG LPC17_REG(0x50000020) /* MII Mgmt Configuration register */
#define MCMD LPC17_REG(0x50000024) /* MII Mgmt Command register */
#define MADR LPC17_REG(0x50000028) /* MII Mgmt Address register */
#define MWTD LPC17_REG(0x5000002C) /* MII Mgmt Write Data register */
#define MRDD LPC17_REG(0x50000030) /* MII Mgmt Read Data register */
#define MIND LPC17_REG(0x50000034) /* MII Mgmt Indicators register */
#define SA0  LPC17_REG(0x50000040) /* Station Address 0 register */
#define SA1  LPC17_REG(0x50000044) /* Station Address 1 register */
#define SA2  LPC17_REG(0x50000048) /* Station Address 2 register */

/* Control registers */
#define Command            LPC17_REG(0x50000100) /* Command register */
#define Status             LPC17_REG(0x50000104) /* Status register */
#define RxDescriptor       LPC17_REG(0x50000108) /* Receive descriptor base address register */
#define RxStatus           LPC17_REG(0x5000010C) /* Receive status base address register */
#define RxDescriptorNumber LPC17_REG(0x50000110) /* Receive number of descriptors register */
#define RxProduceIndex     LPC17_REG(0x50000114) /* Receive produce index register */
#define RxConsumeIndex     LPC17_REG(0x50000118) /* Receive consume index register */
#define TxDescriptor       LPC17_REG(0x5000011C) /* Transmit descriptor base address register */
#define TxStatus           LPC17_REG(0x50000120) /* Transmit status base address register */
#define TxDescriptorNumber LPC17_REG(0x50000124) /* Transmit number of descriptors register */
#define TxProduceIndex     LPC17_REG(0x50000128) /* Transmit produce index register */
#define TxConsumeIndex     LPC17_REG(0x5000012C) /* Transmit consume index register */
#define TSV0               LPC17_REG(0x50000158) /* Transmit status vector 0 register */
#define TSV1               LPC17_REG(0x5000015C) /* Transmit status vector 1 register */
#define RSV                LPC17_REG(0x50000160) /* Receive status vector register */
#define FlowControlCounter LPC17_REG(0x50000170) /* Flow control counter register */
#define FlowControlStatus  LPC17_REG(0x50000170) /* Flow control status register */

/* Rx filter registers */
#define RxFliterCtrl      LPC17_REG(0x50000200) /* Receive filter control register */
#define RxFilterWoLStatus LPC17_REG(0x50000204) /* Receive filter WoL status register */
#define RxFilterWoLClear  LPC17_REG(0x50000208) /* Receive filter WoL clear register */
#define HashFilterL       LPC17_REG(0x50000210) /* Hash filter table LSBs register */
#define HashFilterH       LPC17_REG(0x50000214) /* Hash filter table MSBs register */

/* Module control registers */
#define IntStatus LPC17_REG(0x50000FE0) /* Interrupt status register */
#define IntEnable LPC17_REG(0x50000FE4) /* Interrupt enable register */
#define IntClear  LPC17_REG(0x50000FE8) /* Interrupt clear register */
#define IntSet    LPC17_REG(0x50000FEC) /* Interrupt set register */
#define PowerDown LPC17_REG(0x50000FF4) /* Power-down register */

/* MAC Configuration register 1 (MAC1 - 0x5000 0000) */
#define MAC1_RECEIVE_ENABLE          (0x1 << 0)
#define MAC1_PASS_ALL_RECEIVE_FRAMES (0x1 << 1)
#define MAC1_RX_FLOW_CONTROL         (0x1 << 2)
#define MAC1_TX_FLOW_CONTROL         (0x1 << 3)
#define MAC1_LOOPBACK                (0x1 << 4)
#define MAC1_RESET_TX                (0x1 << 8)
#define MAC1_RESET_MCS_TX            (0x1 << 9)
#define MAC1_RESET_RX                (0x1 << 10)
#define MAC1_RESET_MCS_RX            (0x1 << 11)
#define MAC1_SIMULATION_RESET        (0x1 << 14)
#define MAC1_SOFT_RESET              (0x1 << 15)

/* MAC Configuration register 2 (MAC2 - 0x5000 0004) */
#define MAC2_FULL_DUPLEX                (0x1 << 0)
#define MAC2_FRAME_LENGTH_CHECKING      (0x1 << 1)
#define MAC2_HUGE_FRAME_ENABLE          (0x1 << 2)
#define MAC2_DELAYED_CRC                (0x1 << 3)
#define MAC2_CRC_ENABLE                 (0x1 << 4)
#define MAC2_PAD_CRC_ENABLE             (0x1 << 5)
#define MAC2_VLAN_PAD_ENABLE            (0x1 << 6)
#define MAC2_AUTO_DETECT_PAD_ENABLE     (0x1 << 7)
#define MAC2_PURE_PREAMBLE_ENFORCEMENT  (0x1 << 8)
#define MAC2_LONG_PREAMBLE_ENFORCEMENT  (0x1 << 9)
#define MAC2_NO_BACKOFF                 (0x1 << 12)
#define MAC2_BACK_PRESSURE_NO_BACKOFF   (0x1 << 13)
#define MAC2_EXCESS_DEFER               (0x1 << 14)

/* skipped Back-to-back Inter-packet-gap register (IPGT - 0x5000 0008) */

/* Non Back-to-back Inter-packet-gap register (IPGR - 0x5000 000C) */
#define IPGR_PART2 (0x7F << 0)
#define IPGR_PART1 (0x7F << 8)

/* Collision Window / Retry register (CLRT - 0x5000 0010) */
#define CLRT_RETRANSMISSION_MAXIMUM (0xF << 0)
#define CLRT_COLLISION_WINDOW       (0x3F << 8)

/* skipped Maximum Frame register (MAXF - 0x5000 0014) */

/* PHY Support register (SUPP - 0x5000 0018) */
#define SUPP_SPEED (0x1 << 8)

/* Test register (TEST - 0x5000 ) */
#define TEST_SHORTCUT_PAUSE_QUANTA (0x1 << 0)
#define TEST_PAUSE                 (0x1 << 1)
#define TEST_BACKPRESSURE          (0x1 << 2)

/* MII Mgmt Configuration register (MCFG - 0x5000 0020) */
#define MCFG_SCAN_INCREMENT    (0x1 << 0)
#define MCFG_SUPPRESS_PREAMBLE (0x1 << 1)
#define MCFG_CLOCK_SELECT      (0xF << 2)
#define MCFG_RESET_MII_MGMT    (0x1 << 15)

/* MII Mgmt Command register (MCMD - 0x5000 0024) */
#define MCMD_READ (0x1 << 0)
#define MCMD_SCAN (0x1 << 1)

/* MII Mgmt Address register (MADR - 0x5000 0028) */
#define MADR_REGISTER_ADDRESS (0x1F << 0)
#define MADR_PHY_ADDRESS      (0x1F << 8)

