greatscottgadgets/ubertooth/firmware/common/lpc17.h
/*
 * skipped:
 *
 * MII Mgmt Write Data register (MWTD - 0x5000 002C)
 * MII Mgmt Read Data register (MRDD - 0x5000 0030)
 */

/* MII Mgmt Indicators register (MIND - 0x5000 0034) */
#define MIND_BUSY          (0x1 << 0)
#define MIND_SCANNING      (0x1 << 1)
#define MIND_NOT_VALID     (0x1 << 2)
#define MIND_MII_LINK_FAIL (0x1 << 3)

/* Station Address register (SA0 - 0x5000 0040) */
#define SA0_OCTET2 (0xFF << 0)
#define SA0_OCTET1 (0xFF << 8)

/* Station Address register (SA1 - 0x5000 0044) */
#define SA1_OCTET4 (0xFF << 0)
#define SA1_OCTET3 (0xFF << 8)

/* Station Address register (SA2 - 0x5000 0048) */
#define SA2_OCTET6 (0xFF << 0)
#define SA2_OCTET5 (0xFF << 8)

/* Command register (Command - 0x5000 0100) */
#define Command_RxEnable      (0x1 << 0)
#define Command_TxEnable      (0x1 << 1)
#define Command_RegReset      (0x1 << 3)
#define Command_TxReset       (0x1 << 4)
#define Command_RxReset       (0x1 << 5)
#define Command_PassRuntFrame (0x1 << 6)
#define Command_PassRxFilter  (0x1 << 7)
#define Command_TxFlowControl (0x1 << 8)
#define Command_RMII          (0x1 << 9)
#define Command_FullDuplex    (0x1 << 10)

/* Status register (Status - 0x5000 0104) */
#define Status_RxStatus (0x1 << 0)
#define Status_TxStatus (0x1 << 1)

/*
 * skipped:
 *
 * Receive Descriptor Base Address register (RxDescriptor - 0x5000 0108)
 * Receive Status Base Address register (RxStatus - 0x5000 010C)
 * Receive Number of Descriptors register (RxDescriptor - 0x5000 0110) 
 * Receive Produce Index register (RxProduceIndex - 0x5000 0114)
 * Receive Consume Index register (RxConsumeIndex - 0x5000 0118)
 * Transmit Descriptor Base Address register (TxDescriptor - 0x5000 011C)
 * Transmit Status Base Address register (TxStatus - 0x5000 0120)
 * Transmit Number of Descriptors register (TxDescriptorNumber - 0x5000 0124)
 * Transmit Produce Index register (TxProduceIndex - 0x5000 0128)
 * Transmit Consume Index register (TxConsumeIndex - 0x5000 012C)
 */

/* Transmit Status Vector 0 register (TSV0 - 0x5000 0158) */
#define TSV0_CRC_error           (0x1 << 0)
#define TSV0_Length_check_error  (0x1 << 1)
#define TSV0_Length_out_of_range (0x1 << 2)
#define TSV0_Done                (0x1 << 3)
#define TSV0_Multicast           (0x1 << 4)
#define TSV0_Broadcast           (0x1 << 5)
#define TSV0_Packet_Defer        (0x1 << 6)
#define TSV0_Excessive_Defer     (0x1 << 7)
#define TSV0_Excessive_Collision (0x1 << 8)
#define TSV0_Late_Collision      (0x1 << 9)
#define TSV0_Giant               (0x1 << 10)
#define TSV0_Underrun            (0x1 << 11)
#define TSV0_Total_bytes         (0xFFFF << 12)
#define TSV0_Control_frame       (0x1 << 28)
#define TSV0_Pause               (0x1 << 29)
#define TSV0_Backpressure        (0x1 << 30)
#define TSV0_VLAN                (0x1 << 31)

/* Transmit Status Vector 1 register (TSV1 - 0x5000 015C) */
#define TSV1_Transmit_byte_count      (0xFFFF << 0)
#define TSV1_Transmit_collision_count (0xF << 16)

/* Receive Status Vector register (RSV - 0x5000 0160) */
#define RSV_Received_byte_count           (0xFFFF << 0)
#define RSV_Packet_previously_ignored     (0x1 << 16)
#define RSV_RXDV_event_previously_seen    (0x1 << 17)
#define RSV_Carrier_event_previously_seen (0x1 << 18)
#define RSV_Receive_code_violation        (0x1 << 19)
#define RSV_CRC_error                     (0x1 << 20)
#define RSV_Length_check_error            (0x1 << 21)
#define RSV_Length_out_of_range           (0x1 << 22)
#define RSV_Receive_OK                    (0x1 << 23)
#define RSV_Multicast                     (0x1 << 24)
#define RSV_Broadcast                     (0x1 << 25)
#define RSV_Dribble_Nibble                (0x1 << 26)
#define RSV_Control_frame                 (0x1 << 27)
#define RSV_PAUSE                         (0x1 << 28)
#define RSV_Unsupported_Opcode            (0x1 << 29)
#define RSV_VLAN                          (0x1 << 30)

/* Flow Control Counter register (FlowControlCounter - 0x5000 0170) */
#define FlowControlCounter_MirrorCounter (0xFFFF << 0)
#define FlowControlCounter_PauseTimer    (0xFFFF << 16)

/* Flow Control Status register (FlowControlStatus - 0x5000 0174) */
#define FlowControlStatus_MirrorCounterCurrent (0xFFFF << 0)

/* Receive Filter Control register (RxFilterCtrl - 0x5000 0200) */
#define RXFILTERCTRL_AcceptUnicastEn       (0x1 << 0)
#define RXFILTERCTRL_AcceptBroadcastEn     (0x1 << 1)
#define RXFILTERCTRL_AcceptMulticastEn     (0x1 << 2)
#define RXFILTERCTRL_AcceptUnicastHashEn   (0x1 << 3)
#define RXFILTERCTRL_AcceptMulticastHashEn (0x1 << 4)
#define RXFILTERCTRL_AcceptPerfectEn       (0x1 << 5)
#define RXFILTERCTRL_MagicPacketEnWoL      (0x1 << 12)
#define RXFILTERCTRL_RxFilterEnWoL         (0x1 << 13)

/* Receive Filter WoL Status register (RxFilterWoLStatus - 0x5000 0204) */
#define RxFilterWoLStatus_AcceptUnicastWoL       (0x1 << 0)
#define RxFilterWoLStatus_AcceptBroadcastWoL     (0x1 << 1)
#define RxFilterWoLStatus_AcceptMulticastWoL     (0x1 << 2)
#define RxFilterWoLStatus_AcceptUnicastHashWoL   (0x1 << 3)
#define RxFilterWoLStatus_AcceptMulticastHashWoL (0x1 << 4)
#define RxFilterWoLStatus_AcceptPerfectWoL       (0x1 << 5)
#define RxFilterWoLStatus_RxFilterWoL            (0x1 << 7)
#define RxFilterWoLStatus_MagicPacketWoL         (0x1 << 8)

/* Receive Filter WoL Clear register (RxFilterWoLClear - 0x5000 0208) */
#define RxFilterWoLClear_AcceptUnicastWoLClr       (0x1 << 0)
#define RxFilterWoLClear_AcceptBroadcastWoLClr     (0x1 << 1)
#define RxFilterWoLClear_AcceptMulticastWoLClr     (0x1 << 2)
#define RxFilterWoLClear_AcceptUnicastHashWoLClr   (0x1 << 3)
#define RxFilterWoLClear_AcceptMulticastHashWoLClr (0x1 << 4)
#define RxFilterWoLClear_AcceptPerfectWoLClr       (0x1 << 5)
#define RxFilterWoLClear_RxFilterWoLClr            (0x1 << 7)
#define RxFilterWoLClear_MagicPacketWoLClr         (0x1 << 6)

/*
 * skipped:
 *
 * Hash Filter Table LSBs register (HashFilterL - 0x5000 0210)
 * Hash Filter MSBs register (HashFilterH - 0x5000 0214)
 */

/* Interrupt Status register (IntStatus - 0x5000 0FE0) */
#define IntStatus_RxOverrunInt  (0x1 << 0)
#define IntStatus_RxErrorInt    (0x1 << 1)
#define IntStatus_RxFinishedInt (0x1 << 2)
#define IntStatus_RxDoneInt     (0x1 << 3)
#define IntStatus_TxUnderrunInt (0x1 << 4)
#define IntStatus_TxErrorInt    (0x1 << 5)
#define IntStatus_TxFinishedInt (0x1 << 6)
#define IntStatus_TxDoneInt     (0x1 << 7)
#define IntStatus_SoftInt       (0x1 << 12)
#define IntStatus_WakeupInt     (0x1 << 13)

/* Interrupt Enable register (intEnable - 0x5000 0FE4) */
#define IntEnable_RxOverrunIntEn  (0x1 << 0)
#define IntEnable_RxErrorIntEn    (0x1 << 1)
#define IntEnable_RxFinishedIntEn (0x1 << 2)
#define IntEnable_RxDoneIntEn     (0x1 << 3)
#define IntEnable_TxUnderrunIntEn (0x1 << 4)
#define IntEnable_TxErrorIntEn    (0x1 << 5)
#define IntEnable_TxFinishedIntEn (0x1 << 6)
#define IntEnable_TxDoneIntEn     (0x1 << 7)
#define IntEnable_SoftIntEn       (0x1 << 12)
#define IntEnable_WakeupIntEn     (0x1 << 13)

/* Interrupt Clear register (IntClear - 0x5000 0FE8) */
#define IntClear_RxOverrunIntClr  (0x1 << 0)
#define IntClear_RxErrorIntClr    (0x1 << 1)
#define IntClear_RxFinishedIntClr (0x1 << 2)
#define IntClear_RxDoneIntClr     (0x1 << 3)
#define IntClear_TxUnderrunIntClr (0x1 << 4)
#define IntClear_TxErrorIntClr    (0x1 << 5)
#define IntClear_TxFinishedIntClr (0x1 << 6)
#define IntClear_TxDoneIntClr     (0x1 << 7)
#define IntClear_SoftIntClr       (0x1 << 12)
#define IntClear_WakeupIntClr     (0x1 << 13)

