greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* Interrupt Set register (IntSet - 0x5000 0FEC) */
#define IntSet_RxOverrunIntSet  (0x1 << 0)
#define IntSet_RxErrorIntSet    (0x1 << 1)
#define IntSet_RxFinishedIntSet (0x1 << 2)
#define IntSet_RxDoneIntSet     (0x1 << 3)
#define IntSet_TxUnderrunIntSet (0x1 << 4)
#define IntSet_TxErrorIntSet    (0x1 << 5)
#define IntSet_TxFinishedIntSet (0x1 << 6)
#define IntSet_TxDoneIntSet     (0x1 << 7)
#define IntSet_SoftIntSet       (0x1 << 12)
#define IntSet_WakeupIntSet     (0x1 << 13)

/* Power-Down register (PowerDown - 0x5000 0FF4) */
#define PowerDown_PowerDownMACAHB (0x1 << 31)


/* USB device registers */

/* Clock control registers */
#define USBClkCtrl LPC17_REG(0x5000CFF4) /* USB Clock Control */
#define USBClkSt   LPC17_REG(0x5000CFF8) /* USB Clock Status */

/* Device interrupt registers */
#define USBIntSt     LPC17_REG(0x400FC1C0) /* USB Interrupt Status */
#define USBDevIntSt  LPC17_REG(0x5000C200) /* USB Device Interrupt Status */
#define USBDevIntEn  LPC17_REG(0x5000C204) /* USB Device Interrupt Enable */
#define USBDevIntClr LPC17_REG(0x5000C208) /* USB Device Interrupt Clear */
#define USBDevIntSet LPC17_REG(0x5000C20C) /* USB Device Interrupt Set */
#define USBDevIntPri LPC17_REG(0x5000C22C) /* USB Device Interrupt Priority */

/* Endpoint interrupt registers */
#define USBEpIntSt  LPC17_REG(0x5000C230) /* USB Endpoint Interrupt Status */
#define USBEpIntEn  LPC17_REG(0x5000C234) /* USB Endpoint Interrupt Enable */
#define USBEpIntClr LPC17_REG(0x5000C238) /* USB Endpoint Interrupt Clear */
#define USBEpIntSet LPC17_REG(0x5000C23C) /* USB Endpoint Interrupt Set */
#define USBEpIntPri LPC17_REG(0x5000C240) /* USB Endpoint Priority */

/* Endpoint realization registers */
#define USBReEp     LPC17_REG(0x5000C244) /* USB Realize Endpoint */
#define USBEpIn     LPC17_REG(0x5000C248) /* USB Endpoint Index */
#define USBMaxPSize LPC17_REG(0x5000C24C) /* USB MaxPacketSize */

/* USB transfer registers */
#define USBRxData LPC17_REG(0x5000C218) /* USB Receive Data */
#define USBRxPLen LPC17_REG(0x5000C220) /* USB Receive Packet Length */
#define USBTxData LPC17_REG(0x5000C21C) /* USB Transmit Data */
#define USBTxPLen LPC17_REG(0x5000C224) /* USB Transmit Packet Length */
#define USBCtrl   LPC17_REG(0x5000C228) /* USB Control */

/* SIE Command registers */
#define USBCmdCode LPC17_REG(0x5000C210) /* USB Command Code */
#define USBCmdData LPC17_REG(0x5000C214) /* USB Command Data */

/* DMA registers */
#define USBDMARSt       LPC17_REG(0x5000C250) /* USB DMA Request Status */
#define USBDMARClr      LPC17_REG(0x5000C254) /* USB DMA Request Clear */
#define USBDMARSet      LPC17_REG(0x5000C258) /* USB DMA Request Set */
#define USBUDCAH        LPC17_REG(0x5000C280) /* USB UDCA Head */
#define USBEpDMASt      LPC17_REG(0x5000C284) /* USB Endpoint DMA Status */
#define USBEpDMAEn      LPC17_REG(0x5000C288) /* USB Endpoint DMA Enable */
#define USBEpDMADis     LPC17_REG(0x5000C28C) /* USB Endpoint DMA Disable */
#define USBDMAIntSt     LPC17_REG(0x5000C290) /* USB DMA Interrupt Status */
#define USBDMAIntEn     LPC17_REG(0x5000C294) /* USB DMA Interrupt Enable */
#define USBEoTIntSt     LPC17_REG(0x5000C2A0) /* USB End of Transfer Interrupt Status */
#define USBEoTIntClr    LPC17_REG(0x5000C2A4) /* USB End of Transfer Interrupt Clear */
#define USBEoTIntSet    LPC17_REG(0x5000C2A8) /* USB End of Transfer Interrupt Set */
#define USBNDDRIntSt    LPC17_REG(0x5000C2AC) /* USB New DD Request Interrupt Status */
#define USBNDDRIntClr   LPC17_REG(0x5000C2B0) /* USB New DD Request Interrupt Clear */
#define USBNDDRIntSet   LPC17_REG(0x5000C2B4) /* USB New DD Request Interrupt Set */
#define USBSysErrIntSt  LPC17_REG(0x5000C2B8) /* USB System Error Interrupt Status */
#define USBSysErrIntClr LPC17_REG(0x5000C2BC) /* USB System Error Interrupt Clear */
#define USBSysErrIntSet LPC17_REG(0x5000C2C0) /* USB System Error Interrupt Set */

/* USBClkCtrl register (USBClkCtrl - 0x5000 CFF4) */
#define USBClkCtrl_DEV_CLK_EN (0x1 << 1)
#define USBClkCtrl_AHB_CLK_EN (0x1 << 4)

/* USB Clock Status register (USBClkSt - 0x5000 CFF8) */
#define USBClkSt_DEV_CLK_ON (0x1 << 1)
#define USBClkSt_AHB_CLK_ON (0x1 << 4)

/* USB Interrupt Status register (USBIntSt - 0x5000 C1C0) */
#define USBIntSt_USB_INT_REQ_LP  (0x1 << 0)
#define USBIntSt_USB_INT_REQ_HP  (0x1 << 1)
#define USBIntSt_USB_INT_REQ_DMA (0x1 << 2)
#define USBIntSt_USB_NEED_CLK    (0x1 << 8)
#define USBIntSt_EN_USB_INTS     (0x1 << 31)

/* USB Device Interrupt Status register (USBDevIntSt - 0x5000 C200) */
#define USBDevIntSt_FRAME    (0x1 << 0)
#define USBDevIntSt_EP_FAST  (0x1 << 1)
#define USBDevIntSt_EP_SLOW  (0x1 << 2)
#define USBDevIntSt_DEV_STAT (0x1 << 3)
#define USBDevIntSt_CCEMPTY  (0x1 << 4)
#define USBDevIntSt_CDFULL   (0x1 << 5)
#define USBDevIntSt_RxENDPKT (0x1 << 6)
#define USBDevIntSt_TxENDPKT (0x1 << 7)
#define USBDevIntSt_EP_RLZED (0x1 << 8)
#define USBDevIntSt_ERR_INT  (0x1 << 9)

/* USB Device Interrupt Enable register (USBDevIntEn - 0x5000 C204) */
#define USBDevIntEn_FRAME    (0x1 << 0)
#define USBDevIntEn_EP_FAST  (0x1 << 1)
#define USBDevIntEn_EP_SLOW  (0x1 << 2)
#define USBDevIntEn_DEV_STAT (0x1 << 3)
#define USBDevIntEn_CCEMPTY  (0x1 << 4)
#define USBDevIntEn_CDFULL   (0x1 << 5)
#define USBDevIntEn_RxENDPKT (0x1 << 6)
#define USBDevIntEn_TxENDPKT (0x1 << 7)
#define USBDevIntEn_EP_RLZED (0x1 << 8)
#define USBDevIntEn_ERR_INT  (0x1 << 9)

/* USB Device Interrupt Clear register (USBDevIntClr - 0x5000 C208) */
#define USBDevIntClr_FRAME    (0x1 << 0)
#define USBDevIntClr_EP_FAST  (0x1 << 1)
#define USBDevIntClr_EP_SLOW  (0x1 << 2)
#define USBDevIntClr_DEV_STAT (0x1 << 3)
#define USBDevIntClr_CCEMPTY  (0x1 << 4)
#define USBDevIntClr_CDFULL   (0x1 << 5)
#define USBDevIntClr_RxENDPKT (0x1 << 6)
#define USBDevIntClr_TxENDPKT (0x1 << 7)
#define USBDevIntClr_EP_RLZED (0x1 << 8)
#define USBDevIntClr_ERR_INT  (0x1 << 9)

/* USB Device Interrupt Set register (USBDevIntSet - 0x5000 C20C) */
#define USBDevIntSet_FRAME    (0x1 << 0)
#define USBDevIntSet_EP_FAST  (0x1 << 1)
#define USBDevIntSet_EP_SLOW  (0x1 << 2)
#define USBDevIntSet_DEV_STAT (0x1 << 3)
#define USBDevIntSet_CCEMPTY  (0x1 << 4)
#define USBDevIntSet_CDFULL   (0x1 << 5)
#define USBDevIntSet_RxENDPKT (0x1 << 6)
#define USBDevIntSet_TxENDPKT (0x1 << 7)
#define USBDevIntSet_EP_RLZED (0x1 << 8)
#define USBDevIntSet_ERR_INT  (0x1 << 9)

