greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* USB Device Interrupt Priority register (USBDevIntPri - 0x5000 C22C) */
#define USBDevIntPri_FRAME   (0x1 << 0)
#define USBDevIntPri_EP_FAST (0x1 << 1)

/* USB Endpoint Interrupt Status register (USBEpIntSt - 0x5000 C230) */
#define USBEpIntSt_EP0RX  (0x1 << 0)
#define USBEpIntSt_EP0TX  (0x1 << 1)
#define USBEpIntSt_EP1RX  (0x1 << 2)
#define USBEpIntSt_EP1TX  (0x1 << 3)
#define USBEpIntSt_EP2RX  (0x1 << 4)
#define USBEpIntSt_EP2TX  (0x1 << 5)
#define USBEpIntSt_EP3RX  (0x1 << 6)
#define USBEpIntSt_EP3TX  (0x1 << 7)
#define USBEpIntSt_EP4RX  (0x1 << 8)
#define USBEpIntSt_EP4TX  (0x1 << 9)
#define USBEpIntSt_EP5RX  (0x1 << 10)
#define USBEpIntSt_EP5TX  (0x1 << 11)
#define USBEpIntSt_EP6RX  (0x1 << 12)
#define USBEpIntSt_EP6TX  (0x1 << 13)
#define USBEpIntSt_EP7RX  (0x1 << 14)
#define USBEpIntSt_EP7TX  (0x1 << 15)
#define USBEpIntSt_EP8RX  (0x1 << 16)
#define USBEpIntSt_EP8TX  (0x1 << 17)
#define USBEpIntSt_EP9RX  (0x1 << 18)
#define USBEpIntSt_EP9TX  (0x1 << 19)
#define USBEpIntSt_EP10RX (0x1 << 20)
#define USBEpIntSt_EP10TX (0x1 << 21)
#define USBEpIntSt_EP11RX (0x1 << 22)
#define USBEpIntSt_EP11TX (0x1 << 23)
#define USBEpIntSt_EP12RX (0x1 << 24)
#define USBEpIntSt_EP12TX (0x1 << 25)
#define USBEpIntSt_EP13RX (0x1 << 26)
#define USBEpIntSt_EP13TX (0x1 << 27)
#define USBEpIntSt_EP14RX (0x1 << 28)
#define USBEpIntSt_EP14TX (0x1 << 29)
#define USBEpIntSt_EP15RX (0x1 << 30)
#define USBEpIntSt_EP15TX (0x1 << 31)

/* USB Endpoint Interrupt Enable register (USBEpIntEn - 0x5000 C234) */
#define USBEpIntEn_EP0RX  (0x1 << 0)
#define USBEpIntEn_EP0TX  (0x1 << 1)
#define USBEpIntEn_EP1RX  (0x1 << 2)
#define USBEpIntEn_EP1TX  (0x1 << 3)
#define USBEpIntEn_EP2RX  (0x1 << 4)
#define USBEpIntEn_EP2TX  (0x1 << 5)
#define USBEpIntEn_EP3RX  (0x1 << 6)
#define USBEpIntEn_EP3TX  (0x1 << 7)
#define USBEpIntEn_EP4RX  (0x1 << 8)
#define USBEpIntEn_EP4TX  (0x1 << 9)
#define USBEpIntEn_EP5RX  (0x1 << 10)
#define USBEpIntEn_EP5TX  (0x1 << 11)
#define USBEpIntEn_EP6RX  (0x1 << 12)
#define USBEpIntEn_EP6TX  (0x1 << 13)
#define USBEpIntEn_EP7RX  (0x1 << 14)
#define USBEpIntEn_EP7TX  (0x1 << 15)
#define USBEpIntEn_EP8RX  (0x1 << 16)
#define USBEpIntEn_EP8TX  (0x1 << 17)
#define USBEpIntEn_EP9RX  (0x1 << 18)
#define USBEpIntEn_EP9TX  (0x1 << 19)
#define USBEpIntEn_EP10RX (0x1 << 20)
#define USBEpIntEn_EP10TX (0x1 << 21)
#define USBEpIntEn_EP11RX (0x1 << 22)
#define USBEpIntEn_EP11TX (0x1 << 23)
#define USBEpIntEn_EP12RX (0x1 << 24)
#define USBEpIntEn_EP12TX (0x1 << 25)
#define USBEpIntEn_EP13RX (0x1 << 26)
#define USBEpIntEn_EP13TX (0x1 << 27)
#define USBEpIntEn_EP14RX (0x1 << 28)
#define USBEpIntEn_EP14TX (0x1 << 29)
#define USBEpIntEn_EP15RX (0x1 << 30)
#define USBEpIntEn_EP15TX (0x1 << 31)

/* USB Endpoint Interrupt Clear register (USBEpIntClr - 0x5000 C238) */
#define USBEpIntClr_EP0RX  (0x1 << 0)
#define USBEpIntClr_EP0TX  (0x1 << 1)
#define USBEpIntClr_EP1RX  (0x1 << 2)
#define USBEpIntClr_EP1TX  (0x1 << 3)
#define USBEpIntClr_EP2RX  (0x1 << 4)
#define USBEpIntClr_EP2TX  (0x1 << 5)
#define USBEpIntClr_EP3RX  (0x1 << 6)
#define USBEpIntClr_EP3TX  (0x1 << 7)
#define USBEpIntClr_EP4RX  (0x1 << 8)
#define USBEpIntClr_EP4TX  (0x1 << 9)
#define USBEpIntClr_EP5RX  (0x1 << 10)
#define USBEpIntClr_EP5TX  (0x1 << 11)
#define USBEpIntClr_EP6RX  (0x1 << 12)
#define USBEpIntClr_EP6TX  (0x1 << 13)
#define USBEpIntClr_EP7RX  (0x1 << 14)
#define USBEpIntClr_EP7TX  (0x1 << 15)
#define USBEpIntClr_EP8RX  (0x1 << 16)
#define USBEpIntClr_EP8TX  (0x1 << 17)
#define USBEpIntClr_EP9RX  (0x1 << 18)
#define USBEpIntClr_EP9TX  (0x1 << 19)
#define USBEpIntClr_EP10RX (0x1 << 20)
#define USBEpIntClr_EP10TX (0x1 << 21)
#define USBEpIntClr_EP11RX (0x1 << 22)
#define USBEpIntClr_EP11TX (0x1 << 23)
#define USBEpIntClr_EP12RX (0x1 << 24)
#define USBEpIntClr_EP12TX (0x1 << 25)
#define USBEpIntClr_EP13RX (0x1 << 26)
#define USBEpIntClr_EP13TX (0x1 << 27)
#define USBEpIntClr_EP14RX (0x1 << 28)
#define USBEpIntClr_EP14TX (0x1 << 29)
#define USBEpIntClr_EP15RX (0x1 << 30)
#define USBEpIntClr_EP15TX (0x1 << 31)

/* USB Endpoint Interrupt Set register (USBEpIntSet - 0x5000 C23C) */
#define USBEpIntSet_EP0RX  (0x1 << 0)
#define USBEpIntSet_EP0TX  (0x1 << 1)
#define USBEpIntSet_EP1RX  (0x1 << 2)
#define USBEpIntSet_EP1TX  (0x1 << 3)
#define USBEpIntSet_EP2RX  (0x1 << 4)
#define USBEpIntSet_EP2TX  (0x1 << 5)
#define USBEpIntSet_EP3RX  (0x1 << 6)
#define USBEpIntSet_EP3TX  (0x1 << 7)
#define USBEpIntSet_EP4RX  (0x1 << 8)
#define USBEpIntSet_EP4TX  (0x1 << 9)
#define USBEpIntSet_EP5RX  (0x1 << 10)
#define USBEpIntSet_EP5TX  (0x1 << 11)
#define USBEpIntSet_EP6RX  (0x1 << 12)
#define USBEpIntSet_EP6TX  (0x1 << 13)
#define USBEpIntSet_EP7RX  (0x1 << 14)
#define USBEpIntSet_EP7TX  (0x1 << 15)
#define USBEpIntSet_EP8RX  (0x1 << 16)
#define USBEpIntSet_EP8TX  (0x1 << 17)
#define USBEpIntSet_EP9RX  (0x1 << 18)
#define USBEpIntSet_EP9TX  (0x1 << 19)
#define USBEpIntSet_EP10RX (0x1 << 20)
#define USBEpIntSet_EP10TX (0x1 << 21)
#define USBEpIntSet_EP11RX (0x1 << 22)
#define USBEpIntSet_EP11TX (0x1 << 23)
#define USBEpIntSet_EP12RX (0x1 << 24)
#define USBEpIntSet_EP12TX (0x1 << 25)
#define USBEpIntSet_EP13RX (0x1 << 26)
#define USBEpIntSet_EP13TX (0x1 << 27)
#define USBEpIntSet_EP14RX (0x1 << 28)
#define USBEpIntSet_EP14TX (0x1 << 29)
#define USBEpIntSet_EP15RX (0x1 << 30)
#define USBEpIntSet_EP15TX (0x1 << 31)

/* USB Endpoint Interrupt Priority register (USBEpIntPri - 0x5000 C240) */
#define USBEpIntPri_EP0RX  (0x1 << 0)
#define USBEpIntPri_EP0TX  (0x1 << 1)
#define USBEpIntPri_EP1RX  (0x1 << 2)
#define USBEpIntPri_EP1TX  (0x1 << 3)
#define USBEpIntPri_EP2RX  (0x1 << 4)
#define USBEpIntPri_EP2TX  (0x1 << 5)
#define USBEpIntPri_EP3RX  (0x1 << 6)
#define USBEpIntPri_EP3TX  (0x1 << 7)
#define USBEpIntPri_EP4RX  (0x1 << 8)
#define USBEpIntPri_EP4TX  (0x1 << 9)
#define USBEpIntPri_EP5RX  (0x1 << 10)
#define USBEpIntPri_EP5TX  (0x1 << 11)
#define USBEpIntPri_EP6RX  (0x1 << 12)
#define USBEpIntPri_EP6TX  (0x1 << 13)
#define USBEpIntPri_EP7RX  (0x1 << 14)
#define USBEpIntPri_EP7TX  (0x1 << 15)
#define USBEpIntPri_EP8RX  (0x1 << 16)
#define USBEpIntPri_EP8TX  (0x1 << 17)
#define USBEpIntPri_EP9RX  (0x1 << 18)
#define USBEpIntPri_EP9TX  (0x1 << 19)
#define USBEpIntPri_EP10RX (0x1 << 20)
#define USBEpIntPri_EP10TX (0x1 << 21)
#define USBEpIntPri_EP11RX (0x1 << 22)
#define USBEpIntPri_EP11TX (0x1 << 23)
#define USBEpIntPri_EP12RX (0x1 << 24)
#define USBEpIntPri_EP12TX (0x1 << 25)
#define USBEpIntPri_EP13RX (0x1 << 26)
#define USBEpIntPri_EP13TX (0x1 << 27)
#define USBEpIntPri_EP14RX (0x1 << 28)
#define USBEpIntPri_EP14TX (0x1 << 29)
#define USBEpIntPri_EP15RX (0x1 << 30)
#define USBEpIntPri_EP15TX (0x1 << 31)

