greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* skipped USB Realize Endpoint register (USBReEp - 0x5000 C244) */

/* USB Endpoint Index register (USBEpIn - 0x5000 C248) */
#define USBEpIn_PHY_EP (0x1F << 0)

/*
 * skipped:
 *
 * USB MaxPacketSize register (USBMaxPSize - 0x5000 C24C)
 * USB Receive Data register (USBRxData - 0x5000 C218)
 */

/* USB Receive Packet Length register (USBRxPlen - 0x5000 C220) */
#define USBRxPLen_PKT_LNGTH (0x3FF << 0)
#define USBRxPLen_DV        (0x1 << 10)
#define USBRxPLen_PKT_RDY   (0x1 << 11)

/*
 * skipped:
 *
 * USB Transmit Data register (USBTxData - 0x5000 C21C)
 * USB Transmit Packet Length register (USBTxPLen - 0x5000 C224)
 */

/* USB Control register (USBCtrl - 0x5000 C228) */
#define USBCtrl_RD_EN        (0x1 << 0)
#define USBCtrl_WR_EN        (0x1 << 1)
#define USBCtrl_LOG_ENDPOINT (0xF << 2)

/* USB Command Code register (USBCmdCode - 0x5000 C210) */
#define USBCmdCode_CMD_PHASE          (0xFF << 8)
#define USBCmdCode_CMD_CODE_CMD_WDATA (0xFF << 16)

/*
 * skipped:
 *
 * USB Command Data register (USBCmdData - 0x5000 C214)
 * USB DMA Request Status register (USBDMARSt - 0x5000 C250)
 * USB DMA Request Clear register (USBDMARClr - 0x5000 C254)
 * USB DMA Request Set register (USBDMARSet - 0x5000 C258)
 * USB UDCA Head register (USBUDCAH - 0x5000 C280)
 * USB EP DMA Status register (USBEpDMASt - 0x5000 C284)
 * USB EP DMA Enable register (USBEpDMAEn - 0x5000 C288)
 * USB EP DMA Disable register (USBEpDMADis - 0x5000 C28C)
 */

/* USB DMA Interrupt Status register (USBDMAIntSt - 0x5000 C290) */
#define USBDMAIntSt_EOT  (0x1 << 0)
#define USBDMAIntSt_NDDR (0x1 << 1)
#define USBDMAIntSt_ERR  (0x1 << 2)

/* USB DMA Interrupt Enable register (USBDMAIntEn - 0x5000 C294) */
#define USBDMAIntEn_EOT  (0x1 << 0)
#define USBDMAIntEn_NDDR (0x1 << 1)
#define USBDMAIntEn_ERR  (0x1 << 2)

/*
 * skipped:
 *
 * USB End of Transfer Interrupt Status register (USBEoTIntSt - 0x5000 C2A0s)
 * USB End of Transfer Interrupt Clear register (USBEoTIntClr - 0x5000 C2A4)
 * USB End of Transfer Interrupt Set register (USBEoTIntSet - 0x5000 C2A8)
 * USB New DD Request Interrupt Status register (USBNDDRIntSt - 0x5000 C2AC)
 * USB New DD Request Interrupt Clear register (USBNDDRIntClr - 0x5000 C2B0)
 * USB New DD Request Interrupt Set register (USBNDDRIntSet - 0x5000 C2B4)
 * USB System Error Interrupt Status register (USBSysErrIntSt - 0x5000 C2B8)
 * USB System Error Interrupt Clear register (USBSysErrIntClr - 0x5000 C2BC)
 * USB System Error Interrupt Set register (USBSysErrIntSet - 0x5000 C2C0)
 */


/* USB host registers */
#define HcRevision           LPC17_REG(0x5000C000)
#define HcControl            LPC17_REG(0x5000C004)
#define HcCommandStatus      LPC17_REG(0x5000C008)
#define HcInterruptStatus    LPC17_REG(0x5000C00C)
#define HcInterruptEnable    LPC17_REG(0x5000C010)
#define HcInterruptDisable   LPC17_REG(0x5000C014)
#define HcHCCA               LPC17_REG(0x5000C018)
#define HcPeriodCurrentED    LPC17_REG(0x5000C01C)
#define HcControlHeadED      LPC17_REG(0x5000C020)
#define HcControlCurrentED   LPC17_REG(0x5000C024)
#define HcBulkHeadED         LPC17_REG(0x5000C028)
#define HcBulkCurrentED      LPC17_REG(0x5000C02C)
#define HcDoneHead           LPC17_REG(0x5000C030)
#define HcFmInterval         LPC17_REG(0x5000C034)
#define HcFmRemaining        LPC17_REG(0x5000C038)
#define HcFmNumber           LPC17_REG(0x5000C03C)
#define HcPeriodicStart      LPC17_REG(0x5000C040)
#define HcLSThreshold        LPC17_REG(0x5000C044)
#define HcRhDescriptorA      LPC17_REG(0x5000C048)
#define HcRhDescriptorB      LPC17_REG(0x5000C04C)
#define HcRhStatus           LPC17_REG(0x5000C050)
#define HcRhPortStatus1      LPC17_REG(0x5000C054)
#define HcRhPortStatus2      LPC17_REG(0x5000C058)
#define Module_ID_Ver_Rev_ID LPC17_REG(0x5000C0FC)


/* USB OTG and I2C registers */

/* Interrupt register */
#define USBIntSt   LPC17_REG(0x400FC1C0) /* USB Interrupt Status */

/* OTG registers */
#define OTGIntSt   LPC17_REG(0x5000C100) /* OTG Interrupt Status */
#define OTGIntEn   LPC17_REG(0x5000C104) /* OTG Interrupt Enable */
#define OTGIntSet  LPC17_REG(0x5000C108) /* OTG Interrupt Set */
#define OTGIntClr  LPC17_REG(0x5000C10C) /* OTG Interrupt Clear */
#define OTGStCtrl  LPC17_REG(0x5000C110) /* OTG Status and Control */
#define OTGTmr     LPC17_REG(0x5000C114) /* OTG Timer */

/* I2C registers */
#define I2C_RX     LPC17_REG(0x5000C300) /* I2C Receive */
#define I2C_TX     LPC17_REG(0x5000C300) /* I2C Transmit */
#define I2C_STS    LPC17_REG(0x5000C304) /* I2C Status */
#define I2C_CTL    LPC17_REG(0x5000C308) /* I2C Control */
#define I2C_CLKHI  LPC17_REG(0x5000C30C) /* I2C Clock High */
#define I2C_CLKLO  LPC17_REG(0x5000C310) /* I2C Clock Low */

/* Clock control registers */
#define OTGClkCtrl LPC17_REG(0x5000CFF4) /* OTG clock controller */
#define OTGClkSt   LPC17_REG(0x5000CFF8) /* OTG clock status */

/* USB Interrupt Status register - (USBIntSt - 0x5000 C1C0) */
#define USBIntSt_USB_INT_REQ_LP  (0x1 << 0)
#define USBIntSt_USB_INT_REQ_HP  (0x1 << 1)
#define USBIntSt_USB_INT_REQ_DMA (0x1 << 2)
#define USBIntSt_USB_HOST_INT    (0x1 << 3)
#define USBIntSt_USB_ATX_INT     (0x1 << 4)
#define USBIntSt_USB_OTG_INT     (0x1 << 5)
#define USBIntSt_USB_I2C_INT     (0x1 << 6)
#define USBIntSt_USB_NEED_CLK    (0x1 << 8)
#define USBIntSt_EN_USB_INTS     (0x1 << 31)

/* OTG Interrupt Status register (OTGIntSt - 0x5000 C100) */
#define OTGIntSt_TMR         (0x1 << 0)
#define OTGIntSt_REMOVE_PU   (0x1 << 1)
#define OTGIntSt_HNP_FAILURE (0x1 << 2)
#define OTGIntSt_HNP_SUCCESS (0x1 << 3)

/* OTG Interrupt Enable Register (OTGIntEn - 0x5000 C104) */
#define OTGIntEn_TMR         (0x1 << 0)
#define OTGIntEn_REMOVE_PU   (0x1 << 1)
#define OTGIntEn_HNP_FAILURE (0x1 << 2)
#define OTGIntEn_HNP_SUCCESS (0x1 << 3)

/* OTG Interrupt Set Register (OTGIntSet - 0x5000 C20C) */
#define OTGIntSet_TMR         (0x1 << 0)
#define OTGIntSet_REMOVE_PU   (0x1 << 1)
#define OTGIntSet_HNP_FAILURE (0x1 << 2)
#define OTGIntSet_HNP_SUCCESS (0x1 << 3)

/* OTG Interrupt Clear Register (OTGIntClr - 0x5000 C10C) */
#define OTGIntClr_TMR         (0x1 << 0)
#define OTGIntClr_REMOVE_PU   (0x1 << 1)
#define OTGIntClr_HNP_FAILURE (0x1 << 2)
#define OTGIntClr_HNP_SUCCESS (0x1 << 3)

/* OTG Status and Control Register (OTGStCtrl - 0x5000 C110) */
#define OTGStCtrl_PORT_FUNC   (0x3 << 0)
#define OTGStCtrl_TMR_SCALE   (0x3 << 2)
#define OTGStCtrl_TMR_MODE    (0x1 << 4)
#define OTGStCtrl_TMR_EN      (0x1 << 5)
#define OTGStCtrl_TMR_RST     (0x1 << 6)
#define OTGStCtrl_B_HNP_TRACK (0x1 << 8)
#define OTGStCtrl_A_HNP_TRACK (0x1 << 9)
#define OTGStCtrl_PU_REMOVED  (0x1 << 10)
#define OTGStCtrl_TMR_CNT     (0xFFFF << 16)

