greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* OTG Timer Register (OTGTmr - 0x5000 C114) */
#define OTGTmr_TIMEOUT_CNT (0xFFFF << 0)

/* OTG Clock Control Register (OTGClkCtrl - 0x5000 CFF4) */
#define OTGClkCtrl_HOST_CLK_EN (0x1 << 0)
#define OTGClkCtrl_DEV_CLK_EN  (0x1 << 1)
#define OTGClkCtrl_I2C_CLK_EN  (0x1 << 2)
#define OTGClkCtrl_OTG_CLK_EN  (0x1 << 3)
#define OTGClkCtrl_AHB_CLK_EN  (0x1 << 4)

/* OTG Clock Status Register (OTGClkSt - 0x5000 CFF8) */
#define OTGClkSt_HOST_CLK_ON (0x1 << 0)
#define OTGClkSt_DEV_CLK_ON  (0x1 << 1)
#define OTGClkSt_I2C_CLK_ON  (0x1 << 2)
#define OTGClkSt_OTG_CLK_ON  (0x1 << 3)
#define OTGClkSt_AHB_CLK_ON  (0x1 << 4)

/* skipped I2C Receive Register (I2C_RX - 0x5000 C300) */

/* I2C Transmit register (I2C_TX - 0x5000 C300)  */
#define I2C_TX_TX_Data (0xFF << 0)
#define I2C_TX_START   (0x1 << 8)
#define I2C_TX_STOP    (0x1 << 9)

/* I2C Status Register (I2C_STS - 0x5000 C304) */
#define I2C_STS_TDI   (0x1 << 0)
#define I2C_STS_AFI   (0x1 << 1)
#define I2C_STS_NAI   (0x1 << 2)
#define I2C_STS_DRM   (0x1 << 3)
#define I2C_STS_DRSI  (0x1 << 4)
#define I2C_STS_Activ (0x1 << 5)
#define I2C_STS_SCL   (0x1 << 6)
#define I2C_STS_SDA   (0x1 << 7)
#define I2C_STS_RFF   (0x1 << 8)
#define I2C_STS_RFE   (0x1 << 9)
#define I2C_STS_TFF   (0x1 << 10)
#define I2C_STS_TFE   (0x1 << 11)

/* I2C Control Register (I2C_CTL - 0x5000 C308) */
#define I2C_CTL_TDIE   (0x1 << 0)
#define I2C_CTL_AFIE   (0x1 << 1)
#define I2C_CTL_NAIE   (0x1 << 2)
#define I2C_CTL_DRMIE  (0x1 << 3)
#define I2C_CTL_DRSIE  (0x1 << 4)
#define I2C_CTL_REFIE  (0x1 << 5)
#define I2C_CTL_RFDAIE (0x1 << 6)
#define I2C_CTL_TFFIE  (0x1 << 7)
#define I2C_CTL_SRST   (0x1 << 8)

/*
 * skipped:
 *
 * I2C Clock High Register (I2C_CLKHI - 0x5000 C30C)
 * I2C Clock Low Register (I2C_CLKLO - 0x5000 C310)5
 */


/* UART 0/2/3 registers */

/* UART 0 */
#define U0RBR LPC17_REG(0x4000C000) /* Receiver Buffer Register */
#define U0THR LPC17_REG(0x4000C000) /* Transmit Holding Register */
#define U0DLL LPC17_REG(0x4000C000) /* Divisor Latch LSB */
#define U0DLM LPC17_REG(0x4000C004) /* Divisor Latch MSB */
#define U0IER LPC17_REG(0x4000C004) /* Interrupt Enable Register */
#define U0IIR LPC17_REG(0x4000C008) /* Interrupt ID Register */
#define U0FCR LPC17_REG(0x4000C008) /* FIFO Control Register */
#define U0LCR LPC17_REG(0x4000C00C) /* Line Control Register */
#define U0LSR LPC17_REG(0x4000C014) /* Line Status Register */
#define U0SCR LPC17_REG(0x4000C01C) /* Scratch Pad Register */
#define U0ACR LPC17_REG(0x4000C020) /* Auto-baud Control Register */
#define U0ICR LPC17_REG(0x4000C024) /* IrDA Control Register */
#define U0FDR LPC17_REG(0x4000C028) /* Fractional Divider Register */
#define U0TER LPC17_REG(0x4000C030) /* Transmit Enable Register */

/* UART 2 */
#define U2RBR LPC17_REG(0x40098000) /* Receiver Buffer Register */
#define U2THR LPC17_REG(0x40098000) /* Transmit Holding Register */
#define U2DLL LPC17_REG(0x40098000) /* Divisor Latch LSB */
#define U2DLM LPC17_REG(0x40098004) /* Divisor Latch MSB */
#define U2IER LPC17_REG(0x40098004) /* Interrupt Enable Register */
#define U2IIR LPC17_REG(0x40098008) /* Interrupt ID Register */
#define U2FCR LPC17_REG(0x40098008) /* FIFO Control Register */
#define U2LCR LPC17_REG(0x4009800C) /* Line Control Register */
#define U2LSR LPC17_REG(0x40098014) /* Line Status Register */
#define U2SCR LPC17_REG(0x4009801C) /* Scratch Pad Register */
#define U2ACR LPC17_REG(0x40098020) /* Auto-baud Control Register */
#define U2ICR LPC17_REG(0x40098024) /* IrDA Control Register */
#define U2FDR LPC17_REG(0x40098028) /* Fractional Divider Register */
#define U2TER LPC17_REG(0x40098030) /* Transmit Enable Register */

/* UART 3 */
#define U3RBR LPC17_REG(0x4009C000) /* Receiver Buffer Register */
#define U3THR LPC17_REG(0x4009C000) /* Transmit Holding Register */
#define U3DLL LPC17_REG(0x4009C000) /* Divisor Latch LSB */
#define U3DLM LPC17_REG(0x4009C004) /* Divisor Latch MSB */
#define U3IER LPC17_REG(0x4009C004) /* Interrupt Enable Register */
#define U3IIR LPC17_REG(0x4009C008) /* Interrupt ID Register */
#define U3FCR LPC17_REG(0x4009C008) /* FIFO Control Register */
#define U3LCR LPC17_REG(0x4009C00C) /* Line Control Register */
#define U3LSR LPC17_REG(0x4009C014) /* Line Status Register */
#define U3SCR LPC17_REG(0x4009C01C) /* Scratch Pad Register */
#define U3ACR LPC17_REG(0x4009C020) /* Auto-baud Control Register */
#define U3ICR LPC17_REG(0x4009C024) /* IrDA Control Register */
#define U3FDR LPC17_REG(0x4009C028) /* Fractional Divider Register */
#define U3TER LPC17_REG(0x4009C030) /* Transmit Enable Register */

/*
 * skipped:
 *
 * UARTn Receiver Buffer Register (U0RBR - 0x4000 C000, U2RBR - 0x4009 8000, U3RBR - 0x4009 C000)
 * UARTn Transmit Holding Register (U0THR - 0x4000 C000, U2THR - 0x4009 8000, U3THR - 0x4009 C000)
 * UARTn Divisor Latch LSB register (U0DLL - 0x4000 C000, U2DLL - 0x4009 8000, U3DLL - 0x4009 C000)
 * UARTn Divisor Latch MSB register (U0DLM - 0x4000 C004, U2DLL - 0x4009 8004, U3DLL - 0x4009 C004)
 */

/* UARTn Interrupt Enable Register (U0IER - 0x4000 C004, U2IER - 0x4009 8004, U3IER - 0x4009 C004) */
#define UIER_RBR_Interrupt_Enable            (0x1 << 0)
#define UIER_THRE_Interrupt_Enable           (0x1 << 1)
#define UIER_RX_Line_Status_Interrupt_Enable (0x1 << 2)
#define UIER_ABEOIntEn                       (0x1 << 8)
#define UIER_ABTOIntEn                       (0x1 << 9)

/* UARTn Interrupt Identification Register (U0IIR - 0x4000 C008, U2IIR - 0x4009 8008, U3IIR - 0x4009 C008) */
#define UIIR_IntStatus   (0x1 << 0)
#define UIIR_IntId       (0x7 << 1)
#define UIIR_FIFO Enable (0x3 << 6)
#define UIIR_ABEOInt     (0x1 << 8)
#define UIIR_ABTOInt     (0x1 << 9)

/* UARTn FIFO Control Register (U0FCR - 0x4000 C008, U2FCR - 0x4009 8008, U3FCR - 0x4009 C008) */
#define UFCR_FIFO_Enable      (0x1 << 0)
#define UFCR_RX_FIFO_Reset    (0x1 << 1)
#define UFCR_TX_FIFO_Reset    (0x1 << 2)
#define UFCR_DMA_Mode_Select  (0x1 << 3)
#define UFCR_RX_Trigger_Level (0x3 << 6)

/* UARTn Line Control Register (U0LCR - 0x4000 C00C, U2LCR - 0x4009 800C, U3LCR - 0x4009 C00C) */
#define ULCR_Word_Length_Select (0x3 << 0)
#define ULCR_Stop_Bit_Select    (0x1 << 2)
#define ULCR_Parity_Enable      (0x1 << 3)
#define ULCR_Parity_Select      (0x3 << 4)
#define ULCR_Break_Control      (0x1 << 6)
#define ULCR_DLAB               (0x1 << 7)

/* UARTn Line Status Register (U0LSR - 0x4000 C014, U2LSR - 0x4009 8014, U3LSR - 0x4009 C014) */
#define ULSR_RDR  (0x1 << 0)
#define ULSR_OE   (0x1 << 1)
#define ULSR_PE   (0x1 << 2)
#define ULSR_FE   (0x1 << 3)
#define ULSR_BI   (0x1 << 4)
#define ULSR_THRE (0x1 << 5)
#define ULSR_TEMT (0x1 << 6)
#define ULSR_RXFE (0x1 << 7)

/* skipped UARTn Scratch Pad Register (U0SCR - 0x4000 C01C, U2SCR - 0x4009 801C U3SCR - 0x4009 C01C) */

/* UARTn Auto-baud Control Register (U0ACR - 0x4000 C020, U2ACR - 0x4009 8020, U3ACR - 0x4009 C020) */
#define UACR_Start       (0x1 << 0)
#define UACR_Mode        (0x1 << 1)
#define UACR_AutoRestart (0x1 << 2)
#define UACR_ABEOIntClr  (0x1 << 8)
#define UACR_ABTOIntClr  (0x1 << 9)

