greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* UARTn IrDA Control Register (U0ICR - 0x4000 C024, U2ICR - 0x4009 8024, U3ICR - 0x4009 C024) */
#define UICR_IrDAEn     (0x1 << 0)
#define UICR_IrDAInv    (0x1 << 1)
#define UICR_FixPulseEn (0x1 << 2)
#define UICR_PulseDiv   (0x7 << 3)

/* UARTn Fractional Divider Register (U0FDR - 0x4000 C028, U2FDR - 0x4009 8028, U3FDR - 0x4009 C028) */
#define UFDR_DIVADDVAL (0xF << 0)
#define UFDR_MULVAL    (0xF << 4)

/* UARTn Transmit Enable Register (U0TER - 0x4000 C030, U2TER - 0x4009 8030, U3TER - 0x4009 C030) */
#define UTER_TXEN (0x1 << 7)

/* UART 1 registers */

#define U1RBR       LPC17_REG(0x40010000) /* Receiver Buffer Register */
#define U1THR       LPC17_REG(0x40010000) /* Transmit Holding Register */
#define U1DLL       LPC17_REG(0x40010000) /* Divisor Latch LSB */
#define U1DLM       LPC17_REG(0x40010004) /* Divisor Latch MSB */
#define U1IER       LPC17_REG(0x40010004) /* Interrupt Enable Register */
#define U1IIR       LPC17_REG(0x40010008) /* Interrupt ID Register */
#define U1FCR       LPC17_REG(0x40010008) /* FIFO Control Register */
#define U1LCR       LPC17_REG(0x4001000C) /* Line Control Register */
#define U1MCR       LPC17_REG(0x40010010) /* Modem Control Register */
#define U1LSR       LPC17_REG(0x40010014) /* Line Status Register */
#define U1MSR       LPC17_REG(0x40010018) /* Modem Status Register */
#define U1SCR       LPC17_REG(0x4001001C) /* Scratch Pad Register */
#define U1ACR       LPC17_REG(0x40010020) /* Auto-baud Control Register */
#define U1FDR       LPC17_REG(0x40010028) /* Fractional Divider Register */
#define U1TER       LPC17_REG(0x40010030) /* Transmit Enable Register */
#define U1RS485CTRL LPC17_REG(0x4001004C) /* RS-485/EIA-485 Control */
#define U1ADRMATCH  LPC17_REG(0x40010050) /* RS-485/EIA-485 address match */
#define U1RS485DLY  LPC17_REG(0x40010054) /* RS-485/EIA-485 direction control delay */

/*
 * skipped:
 *
 * UART1 Receiver Buffer Register (U1RBR - 0x4001 0000)
 * UART1 Transmitter Holding Register (U1THR - 0x4001 0000)
 * UART1 Divisor Latch LSB Register (U1DLL - 0x4001 0000)
 * UART1 Divisor Latch MSB Register (U1DLM - 0x4001 0004)
 */

/* UART1 Interrupt Enable Register (U1IER - 0x4001 0004) */
#define U1IER_RBR          (0x1 << 0)
#define U1IER_THRE         (0x1 << 1)
#define U1IER_RX_Line      (0x1 << 2)
#define U1IER_Modem_Status (0x1 << 3)
#define U1IER_CTS          (0x1 << 7)
#define U1IER_ABEOIntEn    (0x1 << 8)
#define U1IER_ABTOIntEn    (0x1 << 9)

/* UART1 Interrupt Identification Register (U1IIR - 0x4001 0008) */
#define U1IIR_IntStatus   (0x1 << 0)
#define U1IIR_IntId       (0x7 << 1)
#define U1IIR_FIFO_Enable (0x3 << 6)
#define U1IIR_ABEOInt     (0x1 << 8)
#define U1IIR_ABTOInt     (0x1 << 9)

/* UART1 FIFO Control Register (U1FCR - 0x4001 0008) */
#define U1FCR_FIFO_Enable      (0x1 << 0)
#define U1FCR_RX_FIFO_Reset    (0x1 << 1)
#define U1FCR_TX_FIFO_Reset    (0x1 << 2)
#define U1FCR_DMA_Mode_Select  (0x1 << 3)
#define U1FCR_RX_Trigger_Level (0x3 << 6)

/* UART1 Line Control Register (U1LCR - 0x4001 000C) */
#define U1LCR_Word_Length_Select (0x3 << 0)
#define U1LCR_Stop_Bit_Select    (0x1 << 2)
#define U1LCR_Parity_Enable      (0x1 << 3)
#define U1LCR_Parity_Select      (0x3 << 4)
#define U1LCR_Break_Control      (0x1 << 6)
#define U1LCR_DLAB               (0x1 << 7)

/* UART1 Modem Control Register (U1MCR - 0x4001 0010) */
#define U1MCR_DTR_Control          (0x1 << 0)
#define U1MCR_RTS_Control          (0x1 << 1)
#define U1MCR_Loopback_Mode_Select (0x1 << 4)
#define U1MCR_RTSen                (0x1 << 6)
#define U1MCR_CTSen                (0x1 << 7)

/* UART1 Line Status Register (U1LSR - 0x4001 0014) */
#define U1LSR_RDR  (0x1 << 0)
#define U1LSR_OE   (0x1 << 1)
#define U1LSR_PE   (0x1 << 2)
#define U1LSR_FE   (0x1 << 3)
#define U1LSR_BI   (0x1 << 4)
#define U1LSR_THRE (0x1 << 5)
#define U1LSR_TEMT (0x1 << 6)
#define U1LSR_RXFE (0x1 << 7)

/* UART1 Modem Status Register (U1MSR - 0x4001 0018) */
#define U1MSR_Delta_CTS        (0x1 << 0)
#define U1MSR_Delta_DSR        (0x1 << 1)
#define U1MSR_Trailing_Edge_RI (0x1 << 2)
#define U1MSR_Delta_DCD        (0x1 << 3)
#define U1MSR_CTS              (0x1 << 4)
#define U1MSR_DSR              (0x1 << 5)
#define U1MSR_RI               (0x1 << 6)
#define U1MSR_DCD              (0x1 << 7)

/* skipped UART1 Scratch Pad Register (U1SCR - 0x4001 001C) */

/* UART1 Auto-baud Control Register (U1ACR - 0x4001 0020) */
#define U1ACR_Start       (0x1 << 0)
#define U1ACR_Mode        (0x1 << 1)
#define U1ACR_AutoRestart (0x1 << 2)
#define U1ACR_ABEOIntClr  (0x1 << 8)
#define U1ACR_ABTOIntClr  (0x1 << 9)

/* UART1 Fractional Divider Register (U1FDR - 0x4001 0028) */
#define U1FDR_DIVADDVAL (0xF << 0)
#define U1FDR_MULVAL    (0xF << 4)

/* UART1 Transmit Enable Register (U1TER - 0x4001 0030) */
#define U1TER_TXEN (0x1 << 7)

/* UART1 RS485 Control register (U1RS485CTRL - 0x4001 004C) */
#define U1RS485CTRL_NMMEN (0x1 << 0)
#define U1RS485CTRL_RXDIS (0x1 << 1)
#define U1RS485CTRL_AADEN (0x1 << 2)
#define U1RS485CTRL_SEL   (0x1 << 3)
#define U1RS485CTRL_DCTRL (0x1 << 4)
#define U1RS485CTRL_OINV  (0x1 << 5)

/*
 * skipped:
 *
 * UART1 RS-485 Address Match register (U1RS485ADRMATCH - 0x4001 0050)
 * UART1 RS-485 Delay value register (U1RS485DLY - 0x4001 0054)
 */


/* CAN registers */

/* CAN acceptance filter and central CAN registers */
#define AFMR         LPC17_REG(0x4003C000) /* Acceptance Filter Register */
#define SFF_sa       LPC17_REG(0x4003C004) /* Standard Frame Individual Start Address Register */
#define SFF_GRP_sa   LPC17_REG(0x4003C008) /* Standard Frame Group Start Address Register */
#define EFF_sa       LPC17_REG(0x4003C00C) /* Extended Frame Start Address Register */
#define EFF_GRP_sa   LPC17_REG(0x4003C010) /* Extended Frame Group Start Address Register */
#define ENDofTable   LPC17_REG(0x4003C014) /* End of AF Tables register */
#define LUTerrAd     LPC17_REG(0x4003C018) /* LUT Error Address register */
#define LUTerr       LPC17_REG(0x4003C01C) /* LUT Error Register */
#define CANTxSR      LPC17_REG(0x40040000) /* CAN Central Transmit Status Register */
#define CANRxSR      LPC17_REG(0x40040004) /* CAN Central Receive Status Register */
#define CANMSR       LPC17_REG(0x40040008) /* CAN Central Miscellaneous Register */

/* CAN1 controller registers */
#define CAN1MOD      LPC17_REG(0x40044000) /* MOD  Controls the operating mode */
#define CAN1CMR      LPC17_REG(0x40044004) /* CMR  Command bits that affect the state of the CAN Controller */
#define CAN1GSR      LPC17_REG(0x40044008) /* GSR  Global Controller Status and Error Counters */
#define CAN1ICR      LPC17_REG(0x4004400C) /* ICR  Interrupt status, Arbitration Lost Capture, Error Code Capture */
#define CAN1IER      LPC17_REG(0x40044010) /* IER  Interrupt Enable */
#define CAN1BTR      LPC17_REG(0x40044014) /* BTR  Bus Timing */
#define CAN1EWL      LPC17_REG(0x40044018) /* EWL  Error Warning Limit */
#define CAN1SR       LPC17_REG(0x4004401C) /* SR   Status Register */
#define CAN1RFS      LPC17_REG(0x40044020) /* RFS  Receive frame status */
#define CAN1RID      LPC17_REG(0x40044024) /* RID  Received Identifier */
#define CAN1RDA      LPC17_REG(0x40044028) /* RDA  Received data bytes 1-4 */
#define CAN1RDB      LPC17_REG(0x4004402C) /* RDB  Received data bytes 5-8 */
#define CAN1TFI1     LPC17_REG(0x40044030) /* TFI1 Transmit frame info (Tx Buffer 1) */
#define CAN1TID1     LPC17_REG(0x40044034) /* TID1 Transmit Identifier (Tx Buffer 1) */
#define CAN1TDA1     LPC17_REG(0x40044038) /* TDA1 Transmit data bytes 1-4 (Tx Buffer 1) */
#define CAN1TDB1     LPC17_REG(0x4004403C) /* TDB1 Transmit data bytes 5-8 (Tx Buffer 1) */
#define CAN1TFI2     LPC17_REG(0x40044040) /* TFI2 Transmit frame info (Tx Buffer 2) */
#define CAN1TID2     LPC17_REG(0x40044044) /* TID2 Transmit Identifier (Tx Buffer 2) */
#define CAN1TDA2     LPC17_REG(0x40044048) /* TDA2 Transmit data bytes 1-4 (Tx Buffer 2) */
#define CAN1TDB2     LPC17_REG(0x4004404C) /* TDB2 Transmit data bytes 5-8 (Tx Buffer 2) */
#define CAN1TFI3     LPC17_REG(0x40044050) /* TFI3 Transmit frame info (Tx Buffer 3) */
#define CAN1TID3     LPC17_REG(0x40044054) /* TID3 Transmit Identifier (Tx Buffer 3) */
#define CAN1TDA3     LPC17_REG(0x40044058) /* TDA3 Transmit data bytes 1-4 (Tx Buffer 3) */
#define CAN1TDB3     LPC17_REG(0x4004405C) /* TDB3 Transmit data bytes 5-8 (Tx Buffer 3) */

/* CAN2 controller registers */
#define CAN2MOD      LPC17_REG(0x40048000) /* MOD  Controls the operating mode */
#define CAN2CMR      LPC17_REG(0x40048004) /* CMR  Command bits that affect the state of the CAN Controller */
#define CAN2GSR      LPC17_REG(0x40048008) /* GSR  Global Controller Status and Error Counters */
#define CAN2ICR      LPC17_REG(0x4004800C) /* ICR  Interrupt status, Arbitration Lost Capture, Error Code Capture */
#define CAN2IER      LPC17_REG(0x40048010) /* IER  Interrupt Enable */
#define CAN2BTR      LPC17_REG(0x40048014) /* BTR  Bus Timing */
#define CAN2EWL      LPC17_REG(0x40048018) /* EWL  Error Warning Limit */
#define CAN2SR       LPC17_REG(0x4004801C) /* SR   Status Register */
#define CAN2RFS      LPC17_REG(0x40048020) /* RFS  Receive frame status */
#define CAN2RID      LPC17_REG(0x40048024) /* RID  Received Identifier */
#define CAN2RDA      LPC17_REG(0x40048028) /* RDA  Received data bytes 1-4 */
#define CAN2RDB      LPC17_REG(0x4004802C) /* RDB  Received data bytes 5-8 */
#define CAN2TFI1     LPC17_REG(0x40048030) /* TFI1 Transmit frame info (Tx Buffer 1) */
#define CAN2TID1     LPC17_REG(0x40048034) /* TID1 Transmit Identifier (Tx Buffer 1) */
#define CAN2TDA1     LPC17_REG(0x40048038) /* TDA1 Transmit data bytes 1-4 (Tx Buffer 1) */
#define CAN2TDB1     LPC17_REG(0x4004803C) /* TDB1 Transmit data bytes 5-8 (Tx Buffer 1) */
#define CAN2TFI2     LPC17_REG(0x40048040) /* TFI2 Transmit frame info (Tx Buffer 2) */
#define CAN2TID2     LPC17_REG(0x40048044) /* TID2 Transmit Identifier (Tx Buffer 2) */
#define CAN2TDA2     LPC17_REG(0x40048048) /* TDA2 Transmit data bytes 1-4 (Tx Buffer 2) */
#define CAN2TDB2     LPC17_REG(0x4004804C) /* TDB2 Transmit data bytes 5-8 (Tx Buffer 2) */
#define CAN2TFI3     LPC17_REG(0x40048050) /* TFI3 Transmit frame info (Tx Buffer 3) */
#define CAN2TID3     LPC17_REG(0x40048054) /* TID3 Transmit Identifier (Tx Buffer 3) */
#define CAN2TDA3     LPC17_REG(0x40048058) /* TDA3 Transmit data bytes 1-4 (Tx Buffer 3) */
#define CAN2TDB3     LPC17_REG(0x4004805C) /* TDB3 Transmit data bytes 5-8 (Tx Buffer 3) */

/* CAN Wake and Sleep registers */
#define CANSLEEPCLR  LPC17_REG(0x400FC110) /* clear and read CAN channel sleep state */
#define CANWAKEFLAGS LPC17_REG(0x400FC114) /* read the wake-up state of the CAN channels */

