greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* CAN Mode register (CAN1MOD - 0x4004 4000, CAN2MOD - 0x4004 8000) */
#define CANMOD_RM  (0x1 << 0)
#define CANMOD_LOM (0x1 << 1)
#define CANMOD_STM (0x1 << 2)
#define CANMOD_TPM (0x1 << 3)
#define CANMOD_SM  (0x1 << 4)
#define CANMOD_RPM (0x1 << 5)
#define CANMOD_TM  (0x1 << 7)

/* CAN Command Register (CAN1CMR - 0x4004 x004, CAN2CMR - 0x4004 8004) */
#define CANCMR_TR   (0x1 << 0)
#define CANCMR_AT   (0x1 << 1)
#define CANCMR_RRB  (0x1 << 2)
#define CANCMR_CDO  (0x1 << 3)
#define CANCMR_SRR  (0x1 << 4)
#define CANCMR_STB1 (0x1 << 5)
#define CANCMR_STB2 (0x1 << 6)
#define CANCMR_STB3 (0x1 << 7)

/* CAN Global Status Register (CAN1GSR - 0x4004 x008, CAN2GSR - 0x4004 8008) */
#define CANGSR_RBS   (0x1 << 0)
#define CANGSR_DOS   (0x1 << 1)
#define CANGSR_TBS   (0x1 << 2)
#define CANGSR_TCS   (0x1 << 3)
#define CANGSR_RS    (0x1 << 4)
#define CANGSR_TS    (0x1 << 5)
#define CANGSR_ES    (0x1 << 6)
#define CANGSR_BS    (0x1 << 7)
#define CANGSR_RXERR (0xFF << 16)
#define CANGSR_TXERR (0xFF << 24)

/* CAN Interrupt and Capture Register (CAN1ICR - 0x4004 400C, CAN2ICR - 0x4004 800C) */
#define CANICR_RI     (0x1 << 0)
#define CANICR_TI1    (0x1 << 1)
#define CANICR_EI     (0x1 << 2)
#define CANICR_DOI    (0x1 << 3)
#define CANICR_WUI    (0x1 << 4)
#define CANICR_EPI    (0x1 << 5)
#define CANICR_ALI    (0x1 << 6)
#define CANICR_BEI    (0x1 << 7)
#define CANICR_IDI    (0x1 << 8)
#define CANICR_TI2    (0x1 << 9)
#define CANICR_TI3    (0x1 << 10)
#define CANICR_ERRBIT (0x1F << 16)
#define CANICR_ERRDIR (0x1 << 21)
#define CANICR_ERRC   (0x3 << 22)
#define CANICR_ALCBIT (0xFF << 24)

/* CAN Interrupt Enable Register (CAN1IER - 0x4004 4010, CAN2IER - 0x4004 8010) */
#define CANIER_RIE  (0x1 << 0)
#define CANIER_TIE1 (0x1 << 1)
#define CANIER_EIE  (0x1 << 2)
#define CANIER_DOIE (0x1 << 3)
#define CANIER_WUIE (0x1 << 4)
#define CANIER_EPIE (0x1 << 5)
#define CANIER_ALIE (0x1 << 6)
#define CANIER_BEIE (0x1 << 7)
#define CANIER_IDIE (0x1 << 8)
#define CANIER_TIE2 (0x1 << 9)
#define CANIER_TIE3 (0x1 << 10)

/* CAN Bus Timing Register (CAN1BTR - 0x4004 4014, CAN2BTR - 0x4004 8014) */
#define CANBTR_BRP   (0x3FF << 0)
#define CANBTR_SJW   (0x3 << 14)
#define CANBTR_TESG1 (0xF << 16)
#define CANBTR_TESG2 (0x7 << 20)
#define CANBTR_SAM   (0x1 << 23)

/* skipped CAN Error Warning Limit register (CAN1EWL - 0x4004 4018, CAN2EWL - 0x4004 8018) */

/* CAN Status Register (CAN1SR - 0x4004 401C, CAN2SR - 0x4004 801C) */
#define CANSR_RBS1 (0x1 << 0)
#define CANSR_DOS1 (0x1 << 1)
#define CANSR_TBS1 (0x1 << 2)
#define CANSR_TCS1 (0x1 << 3)
#define CANSR_RS1  (0x1 << 4)
#define CANSR_TS1  (0x1 << 5)
#define CANSR_ES1  (0x1 << 6)
#define CANSR_BS1  (0x1 << 7)
#define CANSR_RBS2 (0x1 << 8)
#define CANSR_DOS2 (0x1 << 9)
#define CANSR_TBS2 (0x1 << 10)
#define CANSR_TCS2 (0x1 << 11)
#define CANSR_RS2  (0x1 << 12)
#define CANSR_TS2  (0x1 << 13)
#define CANSR_ES2  (0x1 << 14)
#define CANSR_BS2  (0x1 << 15)
#define CANSR_RBS3 (0x1 << 16)
#define CANSR_DOS3 (0x1 << 17)
#define CANSR_TBS3 (0x1 << 18)
#define CANSR_TCS3 (0x1 << 19)
#define CANSR_RS3  (0x1 << 20)
#define CANSR_TS3  (0x1 << 21)
#define CANSR_ES3  (0x1 << 22)
#define CANSR_BS3  (0x1 << 23)

/* CAN Receive Frame Status register (CAN1RFS - 0x4004 4020, CAN2RFS - 0x4004 8020) */
#define CANRFS_ID_Index (0x3FF << 0)
#define CANRFS_BP       (0x1 << 10)
#define CANRFS_DLC      (0xF << 16)
#define CANRFS_RTR      (0x1 << 30)
#define CANRFS_FF       (0x1 << 31)

/* skipped CAN Receive Identifier register (CAN1RID - 0x4004 4024, CAN2RID - 0x4004 8024) */

/* CAN Receive Data register A (CAN1RDA - 0x4004 4028, CAN2RDA - 0x4004 8028) */
#define CANRDA_Data_1 (0xFF << 0)
#define CANRDA_Data_2 (0xFF << 8)
#define CANRDA_Data_3 (0xFF << 16)
#define CANRDA_Data_4 (0xFF << 24)

/* CAN Receive Data register B (CAN1RDB - 0x4004 402C, CAN2RDB - 0x4004 802C) */
#define CANRDB_Data_5 (0xFF << 0)
#define CANRDB_Data_6 (0xFF << 8)
#define CANRDB_Data_7 (0xFF << 16)
#define CANRDB_Data_8 (0xFF << 24)

/* CAN Transmit Frame Information register (CAN1TFI[1/2/3] - 0x4004 40[30/ 40/50], CAN2TFI[1/2/3] - 0x4004 80[30/40/50]) */
#define CANTFIm_PRIO (0xFF << 0)
#define CANTFIm_DLC  (0xF << 16)
#define CANTFIm_RTR  (0x1 << 30)
#define CANTFIm_FF   (0x1 << 31)

/* skipped CAN Transmit Identifier register (CAN1TID[1/2/3] - 0x4004 40[34/44/54], CAN2TID[1/2/3] - 0x4004 80[34/44/54]) */

/* CAN Transmit Data register A (CAN1TDA[1/2/3] - 0x4004 40[38/48/58], CAN2TDA[1/2/3] - 0x4004 80[38/48/58]) */
#define CANTDAm_Data_1 (0xFF << 0)
#define CANTDAm_Data_2 (0xFF << 8)
#define CANTDAm_Data_3 (0xFF << 16)
#define CANTDAm_Data_4 (0xFF << 24)

/* CAN Transmit Data register B (CAN1TDB[1/2/3] - 0x4004 40[3C/4C/5C], CAN2TDB[1/2/3] - 0x4004 80[3C/4C/5C]) */
#define CANTDBm_Data_5 (0xFF << 0)
#define CANTDBm_Data_6 (0xFF << 8)
#define CANTDBm_Data_7 (0xFF << 16)
#define CANTDBm_Data_8 (0xFF << 24)

/* CAN Sleep Clear register (CANSLEEPCLR - 0x400F C110) */
#define CANSLEEPCLR_CAN1SLEEP (0x1 << 1)
#define CANSLEEPCLR_CAN2SLEEP (0x1 << 2)

/* CAN Wake-up Flags register (CANWAKEFLAGS - 0x400F C114) */
#define CANWAKEFLAGS_CAN1WAKE (0x1 << 1)
#define CANWAKEFLAGS_CAN2WAKE (0x1 << 2)

/* Central Transmit Status Register (CANTxSR - 0x4004 0000) */
#define CANTxSR_TS1  (0x1 << 0)
#define CANTxSR_TS2  (0x1 << 1)
#define CANTxSR_TBS1 (0x1 << 8)
#define CANTxSR_TBS2 (0x1 << 9)
#define CANTxSR_TCS1 (0x1 << 16)
#define CANTxSR_TCS2 (0x1 << 17)

/* Central Receive Status Register (CANRxSR - 0x4004 0004) */
#define CANRxSR_RS1  (0x1 << 0)
#define CANRxSR_RS2  (0x1 << 1)
#define CANRxSR_RB1  (0x1 << 8)
#define CANRxSR_RB2  (0x1 << 9)
#define CANRxSR_DOS1 (0x1 << 16)
#define CANRxSR_DOS2 (0x1 << 17)

/* Central Miscellaneous Status Register (CANMSR - 0x4004 0008) */
#define CANMSR_E1  (0x1 << 0)
#define CANMSR_E2  (0x1 << 1)
#define CANMSR_BS1 (0x1 << 8)
#define CANMSR_BS2 (0x1 << 9)

/* Acceptance Filter Mode Register (AFMR - 0x4003 C000) */
#define AFMR_AccOff (0x1 << 0)
#define AFMR_AccBP  (0x1 << 1)
#define AFMR_eFCAN  (0x1 << 2)

