greatscottgadgets/ubertooth/firmware/common/lpc17.h
/*
 * skipped:
 *
 * Standard Frame Individual Start Address register (SFF_sa - 0x4003 C004)
 * Standard Frame Group Start Address register (SFF_GRP_sa - 0x4003 C008)
 * Extended Frame Start Address register (EFF_sa - 0x4003 C00C)
 * Extended Frame Group Start Address register (EFF_GRP_sa - 0x4003 C010)
 * End of AF Tables register (ENDofTable - 0x4003 C014)
 * LUT Error Address register (LUTerrAd - 0x4003 C018)
 * LUT Error register (LUTerr - 0x4003 C01C)
 * Global FullCANInterrupt Enable register (FCANIE - 0x4003 C020)
 */

/* FullCAN Interrupt and Capture registers (FCANIC0 - 0x4003 C024 and FCANIC1 - 0x4003 C028) */
#define FCANIC0_IntPnd0  (0x1 << 0)
#define FCANIC0_IntPnd1  (0x1 << 1)
#define FCANIC0_IntPnd2  (0x1 << 2)
#define FCANIC0_IntPnd3  (0x1 << 3)
#define FCANIC0_IntPnd4  (0x1 << 4)
#define FCANIC0_IntPnd5  (0x1 << 5)
#define FCANIC0_IntPnd6  (0x1 << 6)
#define FCANIC0_IntPnd7  (0x1 << 7)
#define FCANIC0_IntPnd8  (0x1 << 8)
#define FCANIC0_IntPnd9  (0x1 << 9)
#define FCANIC0_IntPnd10 (0x1 << 10)
#define FCANIC0_IntPnd11 (0x1 << 11)
#define FCANIC0_IntPnd12 (0x1 << 12)
#define FCANIC0_IntPnd13 (0x1 << 13)
#define FCANIC0_IntPnd14 (0x1 << 14)
#define FCANIC0_IntPnd15 (0x1 << 15)
#define FCANIC0_IntPnd16 (0x1 << 16)
#define FCANIC0_IntPnd17 (0x1 << 17)
#define FCANIC0_IntPnd18 (0x1 << 18)
#define FCANIC0_IntPnd19 (0x1 << 19)
#define FCANIC0_IntPnd20 (0x1 << 20)
#define FCANIC0_IntPnd21 (0x1 << 21)
#define FCANIC0_IntPnd22 (0x1 << 22)
#define FCANIC0_IntPnd23 (0x1 << 23)
#define FCANIC0_IntPnd24 (0x1 << 24)
#define FCANIC0_IntPnd25 (0x1 << 25)
#define FCANIC0_IntPnd26 (0x1 << 26)
#define FCANIC0_IntPnd27 (0x1 << 27)
#define FCANIC0_IntPnd28 (0x1 << 28)
#define FCANIC0_IntPnd29 (0x1 << 29)
#define FCANIC0_IntPnd30 (0x1 << 30)
#define FCANIC0_IntPnd31 (0x1 << 31)
#define FCANIC1_IntPnd32 (0x1 << 0)
#define FCANIC1_IntPnd33 (0x1 << 1)
#define FCANIC1_IntPnd34 (0x1 << 2)
#define FCANIC1_IntPnd35 (0x1 << 3)
#define FCANIC1_IntPnd36 (0x1 << 4)
#define FCANIC1_IntPnd37 (0x1 << 5)
#define FCANIC1_IntPnd38 (0x1 << 6)
#define FCANIC1_IntPnd39 (0x1 << 7)
#define FCANIC1_IntPnd40 (0x1 << 8)
#define FCANIC1_IntPnd41 (0x1 << 9)
#define FCANIC1_IntPnd42 (0x1 << 10)
#define FCANIC1_IntPnd43 (0x1 << 11)
#define FCANIC1_IntPnd44 (0x1 << 12)
#define FCANIC1_IntPnd45 (0x1 << 13)
#define FCANIC1_IntPnd46 (0x1 << 14)
#define FCANIC1_IntPnd47 (0x1 << 15)
#define FCANIC1_IntPnd48 (0x1 << 16)
#define FCANIC1_IntPnd49 (0x1 << 17)
#define FCANIC1_IntPnd50 (0x1 << 18)
#define FCANIC1_IntPnd51 (0x1 << 19)
#define FCANIC1_IntPnd52 (0x1 << 20)
#define FCANIC1_IntPnd53 (0x1 << 21)
#define FCANIC1_IntPnd54 (0x1 << 22)
#define FCANIC1_IntPnd55 (0x1 << 23)
#define FCANIC1_IntPnd56 (0x1 << 24)
#define FCANIC1_IntPnd57 (0x1 << 25)
#define FCANIC1_IntPnd58 (0x1 << 26)
#define FCANIC1_IntPnd59 (0x1 << 27)
#define FCANIC1_IntPnd60 (0x1 << 28)
#define FCANIC1_IntPnd61 (0x1 << 29)
#define FCANIC1_IntPnd62 (0x1 << 30)
#define FCANIC1_IntPnd63 (0x1 << 31)


/* SPI registers */
#define S0SPCR  LPC17_REG(0x40020000) /* SPI Control Register */
#define S0SPSR  LPC17_REG(0x40020004) /* SPI Status Register */
#define S0SPDR  LPC17_REG(0x40020008) /* SPI Data Register */
#define S0SPCCR LPC17_REG(0x4002000C) /* SPI Clock Counter Register */
#define S0SPINT LPC17_REG(0x4002001C) /* SPI Interrupt Flag */

/* SPI Control Register (S0SPCR - 0x4002 0000) */
#define S0SPCR_BitEnab (0x1 << 2)
#define S0SPCR_CPHA    (0x1 << 3)
#define S0SPCR_CPOL    (0x1 << 4)
#define S0SPCR_MSTR    (0x1 << 5)
#define S0SPCR_LSBF    (0x1 << 6)
#define S0SPCR_SPIE    (0x1 << 7)
#define S0SPCR_BITS    (0xF << 8)

/* SPI Status Register (S0SPSR - 0x4002 0004) */
#define S0SPSR_ABRT (0x1 << 3)
#define S0SPSR_MODF (0x1 << 4)
#define S0SPSR_ROVR (0x1 << 5)
#define S0SPSR_WCOL (0x1 << 6)
#define S0SPSR_SPIF (0x1 << 7)

/*
 * skipped:
 *
 * SPI Data Register (S0SPDR - 0x4002 0008)
 * SPI Clock Counter Register (S0SPCCR - 0x4002 000C)
 */

/* SPI Test Control Register (SPTCR - 0x4002 0010) */
#define SPTCR_Test (0x7F << 1)

/* SPI Test Status Register (SPTSR - 0x4002 0014) */
#define SPTSR_ABRT (0x1 << 3)
#define SPTSR_MODF (0x1 << 4)
#define SPTSR_ROVR (0x1 << 5)
#define SPTSR_WCOL (0x1 << 6)
#define SPTSR_SPIF (0x1 << 7)

/* skipped SPI Interrupt Register (S0SPINT - 0x4002 001C) */


/* SSP registers */

/* SSP0 registers */
#define SSP0CR0   LPC17_REG(0x40088000) /* CR0   Control Register 0 */
#define SSP0CR1   LPC17_REG(0x40088004) /* CR1   Control Register 1 */
#define SSP0DR    LPC17_REG(0x40088008) /* DR    Data Register */
#define SSP0SR    LPC17_REG(0x4008800C) /* SR    Status Register */
#define SSP0CPSR  LPC17_REG(0x40088010) /* CPSR  Clock Prescale Register */
#define SSP0IMSC  LPC17_REG(0x40088014) /* IMSC  Interrupt Mask Set and Clear Register                                     */
#define SSP0RIS   LPC17_REG(0x40088018) /* RIS   Raw Interrupt Status Register */
#define SSP0MIS   LPC17_REG(0x4008801C) /* MIS   Masked Interrupt Status Register */
#define SSP0ICR   LPC17_REG(0x40088020) /* ICR   SSPICR Interrupt Clear Register */
#define SSP0DMACR LPC17_REG(0x40088024) /* DMACR DMA Control Register */

/* SSP1 registers */
#define SSP1CR0   LPC17_REG(0x40030000) /* CR0   Control Register 0 */
#define SSP1CR1   LPC17_REG(0x40030004) /* CR1   Control Register 1 */
#define SSP1DR    LPC17_REG(0x40030008) /* DR    Data Register */
#define SSP1SR    LPC17_REG(0x4003000C) /* SR    Status Register */
#define SSP1CPSR  LPC17_REG(0x40030010) /* CPSR  Clock Prescale Register */
#define SSP1IMSC  LPC17_REG(0x40030014) /* IMSC  Interrupt Mask Set and Clear Register                                     */
#define SSP1RIS   LPC17_REG(0x40030018) /* RIS   Raw Interrupt Status Register */
#define SSP1MIS   LPC17_REG(0x4003001C) /* MIS   Masked Interrupt Status Register */
#define SSP1ICR   LPC17_REG(0x40030020) /* ICR   SSPICR Interrupt Clear Register */
#define SSP1DMACR LPC17_REG(0x40030024) /* DMACR DMA Control Register */

/* SSPn Control Register 0 (SSP0CR0 - 0x4008 8000, SSP1CR0 - 0x4003 0000) */
#define SSPCR0_DSS  (0xF << 0)
#define SSPCR0_FRF  (0x3 << 4)
#define SSPCR0_CPOL (0x1 << 6)
#define SSPCR0_CPHA (0x1 << 7)
#define SSPCR0_SCR  (0xFF << 8)

/* SSPn Control Register 1 (SSP0CR1 - 0x4008 8004, SSP1CR1 - 0x4003 0004) */
#define SSPCR1_LBM (0x1 << 0)
#define SSPCR1_SSE (0x1 << 1)
#define SSPCR1_MS  (0x1 << 2)
#define SSPCR1_SOD (0x1 << 3)

