greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* skipped SSPn Data Register (SSP0DR - 0x4008 8008, SSP1DR - 0x4003 0008) */

/* SSPn Status Register (SSP0SR - 0x4008 800C, SSP1SR - 0x4003 000C) */
#define SSPSR_TFE (0x1 << 0)
#define SSPSR_TNF (0x1 << 1)
#define SSPSR_RNE (0x1 << 2)
#define SSPSR_RFF (0x1 << 3)
#define SSPSR_BSY (0x1 << 4)

/* skipped SSPn Clock Prescale Register (SSP0CPSR - 0x4008 8010, SSP1CPSR - 0x4003 0010) */

/* SSPn Interrupt Mask Set/Clear Register (SSP0IMSC - 0x4008 8014, SSP1IMSC - 0x4003 0014) */
#define SSPIMSC_RORIM (0x1 << 0)
#define SSPIMSC_RTIM  (0x1 << 1)
#define SSPIMSC_RXIM  (0x1 << 2)
#define SSPIMSC_TXIM  (0x1 << 3)

/* SSPn Raw Interrupt Status Register (SSP0RIS - 0x4008 8018, SSP1RIS - 0x4003 0018) */
#define SSPRIS_RORRIS (0x1 << 0)
#define SSPRIS_RTRIS  (0x1 << 1)
#define SSPRIS_RXRIS  (0x1 << 2)
#define SSPRIS_TXRIS  (0x1 << 3)

/* SSPn Masked Interrupt Status Register (SSP0MIS - 0x4008 801C, SSP1MIS - 0x4003 001C) */
#define SSPMIS_RORMIS (0x1 << 0)
#define SSPMIS_RTMIS  (0x1 << 1)
#define SSPMIS_RXMIS  (0x1 << 2)
#define SSPMIS_TXMIS  (0x1 << 3)

/* SSPn Interrupt Clear Register (SSP0ICR - 0x4008 8020, SSP1ICR - 0x4003 0020) */
#define SSPICR_RORIC (0x1 << 0)
#define SSPICR_RTIC  (0x1 << 1)

/* SSPn DMA Control Register (SSP0DMACR - 0x4008 8024, SSP1DMACR - 0x4003 0024) */
#define SSPDMACR_RXDMAE (0x1 << 0)
#define SSPDMACR_TXDMAE (0x1 << 1)


/* I2C registers */

/* I2C0 registers */
#define I2C0CONSET      LPC17_REG(0x4001C000) /* I2CONSET I2C Control Set Register */
#define I2C0STAT        LPC17_REG(0x4001C004) /* I2STAT   I2C Status Register */
#define I2C0DAT         LPC17_REG(0x4001C008) /* I2DAT    I2C Data Register */
#define I2C0ADR0        LPC17_REG(0x4001C00C) /* I2ADR0   I2C Slave Address Register 0 */
#define I2C0SCLH        LPC17_REG(0x4001C010) /* I2SCLH   SCH Duty Cycle Register High Half Word */
#define I2C0SCLL        LPC17_REG(0x4001C014) /* I2SCLL   SCL Duty Cycle Register Low Half Word */
#define I2C0CONCLR      LPC17_REG(0x4001C018) /* I2CONCLR I2C Control Clear Register */
#define I2C0MMCTRL      LPC17_REG(0x4001C01C) /* MMCTRL   Monitor mode control register */
#define I2C0ADR1        LPC17_REG(0x4001C020) /* I2ADR1   I2C Slave Address Register 1 */
#define I2C0ADR2        LPC17_REG(0x4001C024) /* 2ADR2    I2C Slave Address Register 2 */
#define I2C0ADR3        LPC17_REG(0x4001C028) /* I2ADR3   I2C Slave Address Register 3 */
#define I2C0DATA_BUFFER LPC17_REG(0x4001C02C) /* I2DATA_BUFFER Data buffer register */
#define I2C0MASK0       LPC17_REG(0x4001C030) /* I2MASK0  I2C Slave address mask register 0 */
#define I2C0MASK1       LPC17_REG(0x4001C034) /* I2MASK1  I2C Slave address mask register 1 */
#define I2C0MASK2       LPC17_REG(0x4001C038) /* I2MASK2  I2C Slave address mask register 2 */
#define I2C0MASK3       LPC17_REG(0x4001C03C) /* I2MASK3  I2C Slave address mask register 3 */

/* I2C1 registers */
#define I2C1CONSET      LPC17_REG(0x4005C000) /* I2CONSET I2C Control Set Register */
#define I2C1STAT        LPC17_REG(0x4005C004) /* I2STAT   I2C Status Register */
#define I2C1DAT         LPC17_REG(0x4005C008) /* I2DAT    I2C Data Register */
#define I2C1ADR0        LPC17_REG(0x4005C00C) /* I2ADR0   I2C Slave Address Register 0 */
#define I2C1SCLH        LPC17_REG(0x4005C010) /* I2SCLH   SCH Duty Cycle Register High Half Word */
#define I2C1SCLL        LPC17_REG(0x4005C014) /* I2SCLL   SCL Duty Cycle Register Low Half Word */
#define I2C1CONCLR      LPC17_REG(0x4005C018) /* I2CONCLR I2C Control Clear Register */
#define I2C1MMCTRL      LPC17_REG(0x4005C01C) /* MMCTRL   Monitor mode control register */
#define I2C1ADR1        LPC17_REG(0x4005C020) /* I2ADR1   I2C Slave Address Register 1 */
#define I2C1ADR2        LPC17_REG(0x4005C024) /* 2ADR2    I2C Slave Address Register 2 */
#define I2C1ADR3        LPC17_REG(0x4005C028) /* I2ADR3   I2C Slave Address Register 3 */
#define I2C1DATA_BUFFER LPC17_REG(0x4005C02C) /* I2DATA_BUFFER Data buffer register */
#define I2C1MASK0       LPC17_REG(0x4005C030) /* I2MASK0  I2C Slave address mask register 0 */
#define I2C1MASK1       LPC17_REG(0x4005C034) /* I2MASK1  I2C Slave address mask register 1 */
#define I2C1MASK2       LPC17_REG(0x4005C038) /* I2MASK2  I2C Slave address mask register 2 */
#define I2C1MASK3       LPC17_REG(0x4005C03C) /* I2MASK3  I2C Slave address mask register 3 */

/* I2C2 registers */
#define I2C2CONSET      LPC17_REG(0x400A0000) /* I2CONSET I2C Control Set Register */
#define I2C2STAT        LPC17_REG(0x400A0004) /* I2STAT   I2C Status Register */
#define I2C2DAT         LPC17_REG(0x400A0008) /* I2DAT    I2C Data Register */
#define I2C2ADR0        LPC17_REG(0x400A000C) /* I2ADR0   I2C Slave Address Register 0 */
#define I2C2SCLH        LPC17_REG(0x400A0010) /* I2SCLH   SCH Duty Cycle Register High Half Word */
#define I2C2SCLL        LPC17_REG(0x400A0014) /* I2SCLL   SCL Duty Cycle Register Low Half Word */
#define I2C2CONCLR      LPC17_REG(0x400A0018) /* I2CONCLR I2C Control Clear Register */
#define I2C2MMCTRL      LPC17_REG(0x400A001C) /* MMCTRL   Monitor mode control register */
#define I2C2ADR1        LPC17_REG(0x400A0020) /* I2ADR1   I2C Slave Address Register 1 */
#define I2C2ADR2        LPC17_REG(0x400A0024) /* 2ADR2    I2C Slave Address Register 2 */
#define I2C2ADR3        LPC17_REG(0x400A0028) /* I2ADR3   I2C Slave Address Register 3 */
#define I2C2DATA_BUFFER LPC17_REG(0x400A002C) /* I2DATA_BUFFER Data buffer register */
#define I2C2MASK0       LPC17_REG(0x400A0030) /* I2MASK0  I2C Slave address mask register 0 */
#define I2C2MASK1       LPC17_REG(0x400A0034) /* I2MASK1  I2C Slave address mask register 1 */
#define I2C2MASK2       LPC17_REG(0x400A0038) /* I2MASK2  I2C Slave address mask register 2 */
#define I2C2MASK3       LPC17_REG(0x400A003C) /* I2MASK3  I2C Slave address mask register 3 */

/* I2C Control Set register (I2CONSET: I2C0, I2C0CONSET - 0x4001 C000; I2C1, I2C1CONSET - 0x4005 C000; I2C2, I2C2CONSET - 0x400A 0000) */
#define I2CONSET_AA   (0x1 << 2)
#define I2CONSET_SI   (0x1 << 3)
#define I2CONSET_STO  (0x1 << 4)
#define I2CONSET_STA  (0x1 << 5)
#define I2CONSET_I2EN (0x1 << 6)

