greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* I2C Control Clear register (I2CONCLR: I2C0, I2C0CONCLR - 0x4001 C018; I2C1, I2C1CONCLR - 0x4005 C018; I2C2, I2C2CONCLR - 0x400A 0018) */
#define I2CONCLR_AAC   (0x1 << 2)
#define I2CONCLR_SIC   (0x1 << 3)
#define I2CONCLR_STAC  (0x1 << 5)
#define I2CONCLR_I2ENC (0x1 << 6)

/*
 * skipped:
 *
 * I2C Status register (I2STAT: I2C0, I2C0STAT - 0x4001 C004; I2C1, I2C1STAT - 0x4005 C004; I2C2, I2C2STAT - 0x400A 0004)
 * I2C Data register (I2DAT: I2C0, I2C0DAT - 0x4001 C008; I2C1, I2C1DAT - 0x4005 C008; I2C2, I2C2DAT - 0x400A 0008)
 */

/* I2C Monitor mode control register (I2MMCTRL: I2C0, I2C0MMCTRL - 0x4001 C01C; I2C1, I2C1MMCTRL- 0x4005 C01C; I2C2, I2C2MMCTRL- 0x400A 001C) */
#define I2MMCTRL_MM_ENA    (0x1 << 0)
#define I2MMCTRL_ENA_SCL   (0x1 << 1)
#define I2MMCTRL_MATCH_ALL (0x1 << 2)

/* skipped I2C Data buffer register (I2DATA_BUFFER: I2C0, I2CDATA_BUFFER - 0x4001 C02C; I2C1, I2C1DATA_BUFFER- 0x4005 C02C; I2C2, I2C2DATA_BUFFER- 0x400A 002C) */

/* I2C Slave Address registers (I2ADR0 to 3: I2C0, I2C0ADR[0, 1, 2, 3]- 0x4001 C0[0C, 20, 24, 28]; I2C1, I2C1ADR[0, 1, 2, 3] - address 0x4005 C0[0C, 20, 24, 28]; I2C2, I2C2ADR[0, 1, 2, 3] - address 0x400A 00[0C, 20, 24, 28]) */
#define I2ADR_GC      (0x1 << 0)
#define I2ADR_Address (0x7F << 1)

/* I2C Mask registers (I2MASK0 to 3: I2C0, I2C0MASK[0, 1, 2, 3] - 0x4001 C0[30, 34, 38, 3C]; I2C1, I2C1MASK[0, 1, 2, 3] - address 0x4005 C0[30, 34, 38, 3C]; I2C2, I2C2MASK[0, 1, 2, 3] - address 0x400A 00[30, 34, 38, 3C]) */
#define I2MASK_MASK (0x7F << 1)

/*
 * skipped:
 *
 * I2C SCL HIGH duty cycle register (I2SCLH: I2C0, I2C0SCLH - 0x4001 C010; I2C1, I2C1SCLH - 0x4005 C010; I2C2, I2C2SCLH - 0x400A 0010)
 * I2C SCL Low duty cycle register (I2SCLL: I2C0 - I2C0SCLL: 0x4001 C014; I2C1 - I2C1SCLL: 0x4005 C014; I2C2 - I2C2SCLL: 0x400A 0014)
 */


/* I2S registers */

#define I2SDAO       LPC17_REG(0x400A8000) /* Digital Audio Output Register */
#define I2SDAI       LPC17_REG(0x400A8004) /* Digital Audio Input Register */
#define I2STXFIFO    LPC17_REG(0x400A8008) /* Transmit FIFO */
#define I2SRXFIFO    LPC17_REG(0x400A800C) /* Receive FIFO */
#define I2SSTATE     LPC17_REG(0x400A8010) /* Status Feedback Register */
#define I2SDMA1      LPC17_REG(0x400A8014) /* DMA Configuration Register 1 */
#define I2SDMA2      LPC17_REG(0x400A8018) /* DMA Configuration Register 2 */
#define I2SIRQ       LPC17_REG(0x400A801C) /* Interrupt Request Control Register */
#define I2STXRATE    LPC17_REG(0x400A8020) /* Transmit MCLK divider */
#define I2SRXRATE    LPC17_REG(0x400A8024) /* Receive MCLK divider */
#define I2STXBITRATE LPC17_REG(0x400A8028) /* Transmit bit rate divider */
#define I2SRXBITRATE LPC17_REG(0x400A802C) /* Receive bit rate divider */
#define I2STXMODE    LPC17_REG(0x400A8030) /* Transmit mode control */
#define I2SRXMODE    LPC17_REG(0x400A8034) /* Receive mode control */

/* Digital Audio Output register (I2SDAO - 0x400A 8000) */
#define I2SDAO_wordwidth     (0x3 << 0)
#define I2SDAO_mono          (0x1 << 2)
#define I2SDAO_stop          (0x1 << 3)
#define I2SDAO_reset         (0x1 << 4)
#define I2SDAO_ws_sel        (0x1 << 5)
#define I2SDAO_ws_halfperiod (0x1FF << 6)
#define I2SDAO_mute          (0x1 << 15)

/* Digital Audio Input register (I2SDAI - 0x400A 8004) */
#define I2SDAI_wordwidth     (0x3 << 0)
#define I2SDAI_mono          (0x1 << 2)
#define I2SDAI_stop          (0x1 << 3)
#define I2SDAI_reset         (0x1 << 4)
#define I2SDAI_ws_sel        (0x1 << 5)
#define I2SDAI_ws_halfperiod (0x1FF << 6)

/*
 * skipped:
 *
 * Transmit FIFO register (I2STXFIFO - 0x400A 8008)
 * Receive FIFO register (I2SRXFIFO - 0x400A 800C)
 */

/* Status Feedback register (I2SSTATE - 0x400A 8010) */
#define I2SSTATE_irq      (0x1 << 0)
#define I2SSTATE_dmareq1  (0x1 << 1)
#define I2SSTATE_dmareq2  (0x1 << 2)
#define I2SSTATE_Unused   (0x1F << 3)
#define I2SSTATE_rx_level (0xF << 8)
#define I2SSTATE_tx_level (0xF << 16)

/* DMA Configuration Register 1 (I2SDMA1 - 0x400A 8014) */
#define I2SDMA1_rx_dma1_enable (0x1 << 0)
#define I2SDMA1_tx_dma1_enable (0x1 << 1)
#define I2SDMA1_rx_depth_dma1  (0xF << 8)
#define I2SDMA1_tx_depth_dma1  (0xF << 16)

/* DMA Configuration Register 2 (I2SDMA2 - 0x400A 8018) */
#define I2SDMA2_rx_dma2_enable (0x1 << 0)
#define I2SDMA2_tx_dma2_enable (0x1 << 1)
#define I2SDMA2_rx_depth_dma2  (0xF << 8)
#define I2SDMA2_tx_depth_dma2  (0xF << 16)

/* Interrupt Request Control register (I2SIRQ - 0x400A 801C) */
#define I2SIRQ_rx_Irq_enable (0x1 << 0)
#define I2SIRQ_tx_Irq_enable (0x1 << 1)
#define I2SIRQ_rx_depth_irq  (0xF << 8)
#define I2SIRQ_tx_depth_irq  (0xF << 16)

/* Transmit Clock Rate register (I2STXRATE - 0x400A 8020) */
#define I2STXRATE_Y_divider (0xFF << 0)
#define I2STXRATE_X_divider (0xFF << 8)

/* Receive Clock Rate register (I2SRXRATE - 0x400A 8024) */
#define I2SRXRATE_Y_divider (0xFF << 0)
#define I2SRXRATE_X_divider (0xFF << 8)

/*
 * skipped:
 *
 * Transmit Clock Bit Rate register (I2STXBITRATE - 0x400A 8028)
 * Receive Clock Bit Rate register (I2SRXBITRATE - 0x400A 802C)
 */

/* Transmit Mode Control register (I2STXMODE - 0x400A 8030) */
#define I2STXMODE_TXCLKSEL (0x3 << 0)
#define I2STXMODE_TX4PIN   (0x1 << 2)
#define I2STXMODE_TXMCENA  (0x1 << 3)

/* Receive Mode Control register (I2SRXMODE - 0x400A 8034) */
#define I2SRXMODE_RXCLKSEL (0x3 << 0)
#define I2SRXMODE_RX4PIN   (0x1 << 2)
#define I2SRXMODE_RXMCENA  (0x1 << 3)


/* timer registers */

/* timer 1 registers */
#define T0IR   LPC17_REG(0x40004000) /* IR   Interrupt Register */
#define T0TCR  LPC17_REG(0x40004004) /* TCR  Timer Control Register */
#define T0TC   LPC17_REG(0x40004008) /* TC   Timer Counter */
#define T0PR   LPC17_REG(0x4000400C) /* PR   Prescale Register */
#define T0PC   LPC17_REG(0x40004010) /* PC   Prescale Counter */
#define T0MCR  LPC17_REG(0x40004014) /* MCR  Match Control Register */
#define T0MR0  LPC17_REG(0x40004018) /* MR0  Match Register 0 */
#define T0MR1  LPC17_REG(0x4000401C) /* MR1  Match Register 1 */
#define T0MR2  LPC17_REG(0x40004020) /* MR2  Match Register 2 */
#define T0MR3  LPC17_REG(0x40004024) /* MR3  Match Register 3 */
#define T0CCR  LPC17_REG(0x40004028) /* CCR  Capture Control Register */
#define T0CR0  LPC17_REG(0x4000402C) /* CR0  Capture Register 0 */
#define T0CR1  LPC17_REG(0x40004030) /* CR1  Capture Register 1 */
#define T0EMR  LPC17_REG(0x4000403C) /* EMR  External Match Register */
#define T0CTCR LPC17_REG(0x40004070) /* CTCR Count Control Register */

/* timer 2 registers */
#define T1IR   LPC17_REG(0x40008000) /* IR   Interrupt Register */
#define T1TCR  LPC17_REG(0x40008004) /* TCR  Timer Control Register */
#define T1TC   LPC17_REG(0x40008008) /* TC   Timer Counter */
#define T1PR   LPC17_REG(0x4000800C) /* PR   Prescale Register */
#define T1PC   LPC17_REG(0x40008010) /* PC   Prescale Counter */
#define T1MCR  LPC17_REG(0x40008014) /* MCR  Match Control Register */
#define T1MR0  LPC17_REG(0x40008018) /* MR0  Match Register 0 */
#define T1MR1  LPC17_REG(0x4000801C) /* MR1  Match Register 1 */
#define T1MR2  LPC17_REG(0x40008020) /* MR2  Match Register 2 */
#define T1MR3  LPC17_REG(0x40008024) /* MR3  Match Register 3 */
#define T1CCR  LPC17_REG(0x40008028) /* CCR  Capture Control Register */
#define T1CR0  LPC17_REG(0x4000802C) /* CR0  Capture Register 0 */
#define T1CR1  LPC17_REG(0x40008030) /* CR1  Capture Register 1 */
#define T1EMR  LPC17_REG(0x4000803C) /* EMR  External Match Register */
#define T1CTCR LPC17_REG(0x40008070) /* CTCR Count Control Register */

/* timer 3 registers */
#define T2IR   LPC17_REG(0x40090000) /* IR   Interrupt Register */
#define T2TCR  LPC17_REG(0x40090004) /* TCR  Timer Control Register */
#define T2TC   LPC17_REG(0x40090008) /* TC   Timer Counter */
#define T2PR   LPC17_REG(0x4009000C) /* PR   Prescale Register */
#define T2PC   LPC17_REG(0x40090010) /* PC   Prescale Counter */
#define T2MCR  LPC17_REG(0x40090014) /* MCR  Match Control Register */
#define T2MR0  LPC17_REG(0x40090018) /* MR0  Match Register 0 */
#define T2MR1  LPC17_REG(0x4009001C) /* MR1  Match Register 1 */
#define T2MR2  LPC17_REG(0x40090020) /* MR2  Match Register 2 */
#define T2MR3  LPC17_REG(0x40090024) /* MR3  Match Register 3 */
#define T2CCR  LPC17_REG(0x40090028) /* CCR  Capture Control Register */
#define T2CR0  LPC17_REG(0x4009002C) /* CR0  Capture Register 0 */
#define T2CR1  LPC17_REG(0x40090030) /* CR1  Capture Register 1 */
#define T2EMR  LPC17_REG(0x4009003C) /* EMR  External Match Register */
#define T2CTCR LPC17_REG(0x40090070) /* CTCR Count Control Register */

/* timer 4 registers */
#define T3IR   LPC17_REG(0x40094000) /* IR   Interrupt Register */
#define T3TCR  LPC17_REG(0x40094004) /* TCR  Timer Control Register */
#define T3TC   LPC17_REG(0x40094008) /* TC   Timer Counter */
#define T3PR   LPC17_REG(0x4009400C) /* PR   Prescale Register */
#define T3PC   LPC17_REG(0x40094010) /* PC   Prescale Counter */
#define T3MCR  LPC17_REG(0x40094014) /* MCR  Match Control Register */
#define T3MR0  LPC17_REG(0x40094018) /* MR0  Match Register 0 */
#define T3MR1  LPC17_REG(0x4009401C) /* MR1  Match Register 1 */
#define T3MR2  LPC17_REG(0x40094020) /* MR2  Match Register 2 */
#define T3MR3  LPC17_REG(0x40094024) /* MR3  Match Register 3 */
#define T3CCR  LPC17_REG(0x40094028) /* CCR  Capture Control Register */
#define T3CR0  LPC17_REG(0x4009402C) /* CR0  Capture Register 0 */
#define T3CR1  LPC17_REG(0x40094030) /* CR1  Capture Register 1 */
#define T3EMR  LPC17_REG(0x4009403C) /* EMR  External Match Register */
#define T3CTCR LPC17_REG(0x40094070) /* CTCR Count Control Register */

/* Interrupt Register (T[0/1/2/3]IR - 0x4000 4000, 0x4000 8000, 0x4009 0000, 0x4009 4000) */
#define TIR_MR0_Interrupt (0x1 << 0)
#define TIR_MR1_Interrupt (0x1 << 1)
#define TIR_MR2 Interrupt (0x1 << 2)
#define TIR_MR3_Interrupt (0x1 << 3)
#define TIR_CR0_Interrupt (0x1 << 4)
#define TIR_CR1_Interrupt (0x1 << 5)

/* Timer Control Register (T[0/1/2/3]CR - 0x4000 4004, 0x4000 8004, 0x4009 0004, 0x4009 4004) */
#define TCR_Counter_Enable (0x1 << 0)
#define TCR_Counter_Reset  (0x1 << 1)

/* Count Control Register (T[0/1/2/3]CTCR - 0x4000 4070, 0x4000 8070, 0x4009 0070, 0x4009 4070) */
#define TCTCR_Counter_Timer_Mode (0x3 << 0)
#define TCTCR_Count_Input_Select (0x3 << 2)

