greatscottgadgets/ubertooth/firmware/common/lpc17.h
/*
 * skipped:
 *
 * Timer Counter registers (T0TC - T3TC, 0x4000 4008, 0x4000 8008, 0x4009 0008, 0x4009 4008)
 * Prescale register (T0PR - T3PR, 0x4000 400C, 0x4000 800C, 0x4009 000C, 0x4009 400C)
 * Prescale Counter register (T0PC - T3PC, 0x4000 4010, 0x4000 8010, 0x4009 0010, 0x4009 4010)
 * Match Registers (MR0 - MR3)
 */

/* Match Control Register (T[0/1/2/3]MCR - 0x4000 4014, 0x4000 8014, 0x4009 0014, 0x4009 4014) */
#define TMCR_MR0I (0x1 << 0)
#define TMCR_MR0R (0x1 << 1)
#define TMCR_MR0S (0x1 << 2)
#define TMCR_MR1I (0x1 << 3)
#define TMCR_MR1R (0x1 << 4)
#define TMCR_MR1S (0x1 << 5)
#define TMCR_MR2I (0x1 << 6)
#define TMCR_MR2R (0x1 << 7)
#define TMCR_MR2S (0x1 << 8)
#define TMCR_MR3I (0x1 << 9)
#define TMCR_MR3R (0x1 << 10)
#define TMCR_MR3S (0x1 << 11)

/* skipped Capture Registers (CR0 - CR1) */

/* Capture Control Register (T[0/1/2/3]CCR - 0x4000 4028, 0x4000 8028, 0x4009 0028, 0x4009 4028) */
#define TCCR_CAP0RE (0x1 << 0)
#define TCCR_CAP0FE (0x1 << 1)
#define TCCR_CAP0I  (0x1 << 2)
#define TCCR_CAP1RE (0x1 << 3)
#define TCCR_CAP1FE (0x1 << 4)
#define TCCR_CAP1I  (0x1 << 5)

/* External Match Register (T[0/1/2/3]EMR - 0x4000 403C, 0x4000 803C, 0x4009 003C, 0x4009 403C) */
#define TEMR_EM0  (0x1 << 0)
#define TEMR_EM1  (0x1 << 1)
#define TEMR_EM2  (0x1 << 2)
#define TEMR_EM3  (0x1 << 3)
#define TEMR_EMC0 (0x3 << 4)
#define TEMR_EMC1 (0x3 << 6)
#define TEMR_EMC2 (0x3 << 8)
#define TEMR_EMC3 (0x3 << 10)


/* repetitive interrupt timer registers */

#define RICOMPVAL LPC17_REG(0x400B0000) /* Compare register */
#define RIMASK    LPC17_REG(0x400B0004) /* Mask register */
#define RICTRL    LPC17_REG(0x400B0008) /* Control register */
#define RICOUNTER LPC17_REG(0x400B000C) /* 32-bit counter */

/*
 * skipped:
 *
 * RI Compare Value register (RICOMPVAL - 0x400B 0000)
 * RI Mask register (RIMASK - 0x400B 0004)
 */

/* RI Control register (RICTRL - 0x400B 0008) */
#define RICTRL_RITINT   (0x1 << 0)
#define RICTRL_RITENCLR (0x1 << 1)
#define RICTRL_RITENBR  (0x1 << 2)
#define RICTRL_RITEN    (0x1 << 3)

/* skipped RI Counter register (RICOUNTER - 0x400B 000C) */

/* system tick timer resgisters */

#define STCTRL   LPC17_REG(0xE000E010) /* System Timer Control and status register */
#define STRELOAD LPC17_REG(0xE000E014) /* System Timer Reload value register */
#define STCURR   LPC17_REG(0xE000E018) /* System Timer Current value register */
#define STCALIB  LPC17_REG(0xE000E01C) /* System Timer Calibration value register */

/* System Timer Control and status register (STCTRL - 0xE000 E010) */
#define STCTRL_ENABLE    (0x1 << 0)
#define STCTRL_TICKINT   (0x1 << 1)
#define STCTRL_CLKSOURCE (0x1 << 2)
#define STCTRL_COUNTFLAG (0x1 << 16)

/*
 * skipped:
 *
 * System Timer Reload value register (STRELOAD - 0xE000 E014)
 * System Timer Current value register (STCURR - 0xE000 E018)
 */

/* System Timer Calibration value register (STCALIB - 0xE000 E01C) */
#define STCALIB_TENMS (0xFFFFFF << 0)
#define STCALIB_SKEW  (0x1 << 30)
#define STCALIB_NOREF (0x1 << 31)


/* PWM1 registers */

#define PWM1IR   LPC17_REG(0x40018000) /* IR   Interrupt Register */
#define PWM1TCR  LPC17_REG(0x40018004) /* TCR  Timer Control Register */
#define PWM1TC   LPC17_REG(0x40018008) /* TC   Timer Counter */
#define PWM1PR   LPC17_REG(0x4001800C) /* PR   Prescale Register */
#define PWM1PC   LPC17_REG(0x40018010) /* PC   Prescale Counter */
#define PWM1MCR  LPC17_REG(0x40018014) /* MCR  Match Control Register */
#define PWM1MR0  LPC17_REG(0x40018018) /* MR0  Match Register 0 */
#define PWM1MR1  LPC17_REG(0x4001801C) /* MR1  Match Register 1 */
#define PWM1MR2  LPC17_REG(0x40018020) /* MR2  Match Register 2 */
#define PWM1MR3  LPC17_REG(0x40018024) /* MR3  Match Register 3 */
#define PWM1CCR  LPC17_REG(0x40018028) /* CCR  Capture Control Register */
#define PWM1CR0  LPC17_REG(0x4001802C) /* CR0  Capture Register 0 */
#define PWM1CR1  LPC17_REG(0x40018030) /* CR1  Capture Register 1 */
#define PWM1CR2  LPC17_REG(0x40018034) /* CR2  Capture Register 2 */
#define PWM1CR3  LPC17_REG(0x40018038) /* CR3  Capture Register 3 */
#define PWM1MR4  LPC17_REG(0x40018040) /* MR4  Match Register 4 */
#define PWM1MR5  LPC17_REG(0x40018044) /* MR5  Match Register 5 */
#define PWM1MR6  LPC17_REG(0x40018048) /* MR6  Match Register 6 */
#define PWM1PCR  LPC17_REG(0x4001804C) /* PCR  PWM Control Register */
#define PWM1LER  LPC17_REG(0x40018050) /* LER  Load Enable Register */
#define PWM1CTCR LPC17_REG(0x40018070) /* CTCR Count Control Register */

/* PWM Interrupt Register (PWM1IR - 0x4001 8000) */
#define PWM1IR_PWMMR0_Interrupt  (0x1 << 0)
#define PWM1IR_PWMMR1_Interrupt  (0x1 << 1)
#define PWM1IR_PWMMR2_Interrupt  (0x1 << 2)
#define PWM1IR_PWMMR3_Interrupt  (0x1 << 3)
#define PWM1IR_PWMCAP0_Interrupt (0x1 << 4)
#define PWM1IR_PWMCAP1_Interrupt (0x1 << 5)
#define PWM1IR_PWMMR4_Interrupt  (0x1 << 8)
#define PWM1IR_PWMMR5_Interrupt  (0x1 << 9)
#define PWM1IR_PWMMR6_Interrupt  (0x1 << 10)

/* PWM Timer Control Register (PWM1TCR 0x4001 8004) */
#define PWM1TCR_Counter_Enable (0x1 << 0)
#define PWM1TCR_Counter_Reset  (0x1 << 1)
#define PWM1TCR_PWM_Enable     (0x1 << 3)

/* PWM Count Control Register (PWM1CTCR - 0x4001 8070) */
#define PWM1CTCR_Counter_Timer_Mode (0x3 << 0)
#define PWM1CTCR_Count_Input_Select (0x3 << 2)

/* PWM Match Control Register (PWM1MCR - 0x4001 8014) */
#define PWM1MCR_PWMMR0I (0x1 << 0)
#define PWM1MCR_PWMMR0R (0x1 << 1)
#define PWM1MCR_PWMMR0S (0x1 << 2)
#define PWM1MCR_PWMMR1I (0x1 << 3)
#define PWM1MCR_PWMMR1R (0x1 << 4)
#define PWM1MCR_PWMMR1S (0x1 << 5)
#define PWM1MCR_PWMMR2I (0x1 << 6)
#define PWM1MCR_PWMMR2R (0x1 << 7)
#define PWM1MCR_PWMMR2S (0x1 << 8)
#define PWM1MCR_PWMMR3I (0x1 << 9)
#define PWM1MCR_PWMMR3R (0x1 << 10)
#define PWM1MCR_PWMMR3S (0x1 << 11)
#define PWM1MCR_PWMMR4I (0x1 << 12)
#define PWM1MCR_PWMMR4R (0x1 << 13)
#define PWM1MCR_PWMMR4S (0x1 << 14)
#define PWM1MCR_PWMMR5I (0x1 << 15)
#define PWM1MCR_PWMMR5R (0x1 << 16)
#define PWM1MCR_PWMMR5S (0x1 << 17)
#define PWM1MCR_PWMMR6I (0x1 << 18)
#define PWM1MCR_PWMMR6R (0x1 << 19)
#define PWM1MCR_PWMMR6S (0x1 << 20)

/* PWM Capture Control Register (PWM1CCR - 0x4001 8028) */
#define PWM1CCR_Capture_on_CAPn0_rising_edge  (0x1 << 0)
#define PWM1CCR_Capture_on_CAPn0_falling_edge (0x1 << 1)
#define PWM1CCR_Interrupt_on_CAPn0_event      (0x1 << 2)
#define PWM1CCR_Capture_on_CAPn1_rising_edge  (0x1 << 3)
#define PWM1CCR_Capture_on_CAPn1_falling_edge (0x1 << 4)
#define PWM1CCR_Interrupt_on_CAPn1_event      (0x1 << 5)

/* PWM Control Register (PWM1PCR - 0x4001 804C) */
#define PWM1PCR_PWMSEL2 (0x1 << 2)
#define PWM1PCR_PWMSEL3 (0x1 << 3)
#define PWM1PCR_PWMSEL4 (0x1 << 4)
#define PWM1PCR_PWMSEL5 (0x1 << 5)
#define PWM1PCR_PWMSEL6 (0x1 << 6)
#define PWM1PCR_PWMENA1 (0x1 << 9)
#define PWM1PCR_PWMENA2 (0x1 << 10)
#define PWM1PCR_PWMENA3 (0x1 << 11)
#define PWM1PCR_PWMENA4 (0x1 << 12)
#define PWM1PCR_PWMENA5 (0x1 << 13)
#define PWM1PCR_PWMENA6 (0x1 << 14)

