greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* skipped PWM Latch Enable Register (PWM1LER - 0x4001 8050) */


/* MCPWM registers */

#define MCCON        LPC17_REG(0x400B8000) /* PWM Control read address */
#define MCCON_SET    LPC17_REG(0x400B8004) /* PWM Control set address */
#define MCCON_CLR    LPC17_REG(0x400B8008) /* PWM Control clear address */
#define MCCAPCON     LPC17_REG(0x400B800C) /* Capture Control read address */
#define MCCAPCON_SET LPC17_REG(0x400B8010) /* Capture Control set address */
#define MCCAPCON_CLR LPC17_REG(0x400B8014) /* Event Control clear address */
#define MCTC0        LPC17_REG(0x400B8018) /* Timer Counter register, channel 0 */
#define MCTC1        LPC17_REG(0x400B801C) /* Timer Counter register, channel 1 */
#define MCTC2        LPC17_REG(0x400B8020) /* Timer Counter register, channel 2 */
#define MCLIM0       LPC17_REG(0x400B8024) /* Limit register, channel 0 */
#define MCLIM1       LPC17_REG(0x400B8028) /* Limit register, channel 1 */
#define MCLIM2       LPC17_REG(0x400B802C) /* Limit register, channel 2 */
#define MCMAT0       LPC17_REG(0x400B8030) /* Match register, channel 0 */
#define MCMAT1       LPC17_REG(0x400B8034) /* Match register, channel 1 */
#define MCMAT2       LPC17_REG(0x400B8038) /* Match register, channel 2 */
#define MCDT         LPC17_REG(0x400B803C) /* Dead time register */
#define MCCP         LPC17_REG(0x400B8040) /* Commutation Pattern register */
#define MCCAP0       LPC17_REG(0x400B8044) /* Capture register, channel 0 */
#define MCCAP1       LPC17_REG(0x400B8048) /* Capture register, channel 1 */
#define MCCAP2       LPC17_REG(0x400B804C) /* Capture register, channel 2 */
#define MCINTEN      LPC17_REG(0x400B8050) /* Interrupt Enable read address */
#define MCINTEN_SET  LPC17_REG(0x400B8054) /* Interrupt Enable set address */
#define MCINTEN_CLR  LPC17_REG(0x400B8058) /* Interrupt Enable clear address */
#define MCCNTCON     LPC17_REG(0x400B805C) /* Count Control read address */
#define MCCNTCON_SET LPC17_REG(0x400B8060) /* Count Control set address */
#define MCCNTCON_CLR LPC17_REG(0x400B8064) /* Count Control clear address */
#define MCINTF       LPC17_REG(0x400B8068) /* Interrupt flags read address */
#define MCINTF_SET   LPC17_REG(0x400B806C) /* Interrupt flags set address */
#define MCINTF_CLR   LPC17_REG(0x400B8070) /* Interrupt flags clear address */
#define MCCAP_CLR    LPC17_REG(0x400B8074) /* Capture clear address */

/* MCPWM Control read address (MCCON - 0x400B 8000) */
#define MCCON_RUN0    (0x1 << 0)
#define MCCON_CENTER0 (0x1 << 1)
#define MCCON_POLA0   (0x1 << 2)
#define MCCON_DTE0    (0x1 << 3)
#define MCCON_DISUP0  (0x1 << 4)
#define MCCON_RUN1    (0x1 << 8)
#define MCCON_CENTER1 (0x1 << 9)
#define MCCON_POLA1   (0x1 << 10)
#define MCCON_DTE1    (0x1 << 11)
#define MCCON_DISUP1  (0x1 << 12)
#define MCCON_RUN2    (0x1 << 16)
#define MCCON_CENTER2 (0x1 << 17)
#define MCCON_POLA2   (0x1 << 18)
#define MCCON_DTE2    (0x1 << 19)
#define MCCON_DISUP2  (0x1 << 20)
#define MCCON_INVBDC  (0x1 << 29)
#define MCCON_ACMODE  (0x1 << 30)
#define MCCON_DCMODE  (0x1 << 31)

/*
 * skipped:
 *
 * MCPWM Control set address (MCCON_SET - 0x400B 8004)
 * MCPWM Control clear address (MCCON_CLR - 0x400B 8008)
 */

/* MCPWM Capture Control read address (MCCAPCON - 0x400B 800C) */
#define MCCAPCON_CAP0MCI0_RE (0x1 << 0)
#define MCCAPCON_CAP0MCI0_FE (0x1 << 1)
#define MCCAPCON_CAP0MCI1_RE (0x1 << 2)
#define MCCAPCON_CAP0MCI1_FE (0x1 << 3)
#define MCCAPCON_CAP0MCI2_RE (0x1 << 4)
#define MCCAPCON_CAP0MCI2_FE (0x1 << 5)
#define MCCAPCON_CAP1MCI0_RE (0x1 << 6)
#define MCCAPCON_CAP1MCI0_FE (0x1 << 7)
#define MCCAPCON_CAP1MCI1_RE (0x1 << 8)
#define MCCAPCON_CAP1MCI1_FE (0x1 << 9)
#define MCCAPCON_CAP1MCI2_RE (0x1 << 10)
#define MCCAPCON_CAP1MCI2_FE (0x1 << 11)
#define MCCAPCON_CAP2MCI0_RE (0x1 << 12)
#define MCCAPCON_CAP2MCI0_FE (0x1 << 13)
#define MCCAPCON_CAP2MCI1_RE (0x1 << 14)
#define MCCAPCON_CAP2MCI1_FE (0x1 << 15)
#define MCCAPCON_CAP2MCI2_RE (0x1 << 16)
#define MCCAPCON_CAP2MCI2_FE (0x1 << 17)
#define MCCAPCON_RT0         (0x1 << 18)
#define MCCAPCON_RT1         (0x1 << 19)
#define MCCAPCON_RT2         (0x1 << 20)
#define MCCAPCON_HNFCAP0     (0x1 << 21)
#define MCCAPCON_HNFCAP1     (0x1 << 22)
#define MCCAPCON_HNFCAP2     (0x1 << 23)

/*
 * skipped:
 *
 * MCPWM Capture Control set address (MCCAPCON_SET - 0x400B 8010)
 * MCPWM Capture Control clear address (MCCAPCON_CLR - 0x400B 8014)
 */

/* MCPWM Interrupt Enable read address (MCINTEN - 0x400B 8050) */
#define MCINTEN_ILIM0 (0x1 << 0)
#define MCINTEN_IMAT0 (0x1 << 1)
#define MCINTEN_ICAP0 (0x1 << 2)
#define MCINTEN_ILIM1 (0x1 << 4)
#define MCINTEN_IMAT1 (0x1 << 5)
#define MCINTEN_ICAP1 (0x1 << 6)
#define MCINTEN_ILIM2 (0x1 << 8)
#define MCINTEN_IMAT2 (0x1 << 9)
#define MCINTEN_ICAP2 (0x1 << 10)
#define MCINTEN_ABORT (0x1 << 15)

/* MCPWM Interrupt Enable set address (MCINTEN_SET - 0x400B 8054) */
#define MCINT_SET_ILIM0 (0x1 << 0)
#define MCINT_SET_IMAT0 (0x1 << 1)
#define MCINT_SET_ICAP0 (0x1 << 2)
#define MCINT_SET_ILIM1 (0x1 << 4)
#define MCINT_SET_IMAT1 (0x1 << 5)
#define MCINT_SET_ICAP1 (0x1 << 6)
#define MCINT_SET_ILIM2 (0x1 << 8)
#define MCINT_SET_IMAT2 (0x1 << 9)
#define MCINT_SET_ICAP2 (0x1 << 10)
#define MCINT_SET_ABORT (0x1 << 15)

/* MCPWM Interrupt Enable clear address (MCINTEN_CLR - 0x400B 8058) */
#define MCINT_CLR_ILIM0 (0x1 << 0)
#define MCINT_CLR_IMAT0 (0x1 << 1)
#define MCINT_CLR_ICAP0 (0x1 << 2)
#define MCINT_CLR_ILIM1 (0x1 << 4)
#define MCINT_CLR_IMAT1 (0x1 << 5)
#define MCINT_CLR_ICAP1 (0x1 << 6)
#define MCINT_CLR_ILIM2 (0x1 << 8)
#define MCINT_CLR_IMAT2 (0x1 << 9)
#define MCINT_CLR_ICAP2 (0x1 << 10)
#define MCINT_CLR_ABORT (0x1 << 15)

/* MCPWM Interrupt Flags read address (MCINTF - 0x400B 8068) */
#define MCINTF_ILIM0 (0x1 << 0)
#define MCINTF_IMAT0 (0x1 << 1)
#define MCINTF_ICAP0 (0x1 << 2)
#define MCINTF_ILIM1 (0x1 << 4)
#define MCINTF_IMAT1 (0x1 << 5)
#define MCINTF_ICAP1 (0x1 << 6)
#define MCINTF_ILIM2 (0x1 << 8)
#define MCINTF_IMAT2 (0x1 << 9)
#define MCINTF_ICAP2 (0x1 << 10)
#define MCINTF_ABORT (0x1 << 15)

/* MCPWM Interrupt Flags set address (MCINTF_SET - 0x400B 806C) */
#define MCINTF_SET_ILIM0 (0x1 << 0)
#define MCINTF_SET_IMAT0 (0x1 << 1)
#define MCINTF_SET_ICAP0 (0x1 << 2)
#define MCINTF_SET_ILIM1 (0x1 << 4)
#define MCINTF_SET_IMAT1 (0x1 << 5)
#define MCINTF_SET_ICAP1 (0x1 << 6)
#define MCINTF_SET_ILIM2 (0x1 << 8)
#define MCINTF_SET_IMAT2 (0x1 << 9)
#define MCINTF_SET_ICAP2 (0x1 << 10)
#define MCINTF_SET_ABORT (0x1 << 15)

