greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* MCPWM Interrupt Flags clear address (MCINTF_CLR - 0x400B 8070) */
#define MCINTF_CLR_ILIM0 (0x1 << 0)
#define MCINTF_CLR_IMAT0 (0x1 << 1)
#define MCINTF_CLR_ICAP0 (0x1 << 2)
#define MCINTF_CLR_ILIM1 (0x1 << 4)
#define MCINTF_CLR_IMAT1 (0x1 << 5)
#define MCINTF_CLR_ICAP1 (0x1 << 6)
#define MCINTF_CLR_ILIM2 (0x1 << 8)
#define MCINTF_CLR_IMAT2 (0x1 << 9)
#define MCINTF_CLR_ICAP2 (0x1 << 10)
#define MCINTF_CLR_ABORT (0x1 << 15)

/* MCPWM Count Control read address (MCCNTCON - 0x400B 805C) */
#define MCCNTCON_TC0MCI0_RE (0x1 << 0)
#define MCCNTCON_TC0MCI0_FE (0x1 << 1)
#define MCCNTCON_TC0MCI1_RE (0x1 << 2)
#define MCCNTCON_TC0MCI1_FE (0x1 << 3)
#define MCCNTCON_TC0MCI2_RE (0x1 << 4)
#define MCCNTCON_TC0MCI2_FE (0x1 << 5)
#define MCCNTCON_TC1MCI0_RE (0x1 << 6)
#define MCCNTCON_TC1MCI0_FE (0x1 << 7)
#define MCCNTCON_TC1MCI1_RE (0x1 << 8)
#define MCCNTCON_TC1MCI1_FE (0x1 << 9)
#define MCCNTCON_TC1MCI2_RE (0x1 << 10)
#define MCCNTCON_TC1MCI2_FE (0x1 << 11)
#define MCCNTCON_TC2MCI0_RE (0x1 << 12)
#define MCCNTCON_TC2MCI0_FE (0x1 << 13)
#define MCCNTCON_TC2MCI1_RE (0x1 << 14)
#define MCCNTCON_TC2MCI1_FE (0x1 << 15)
#define MCCNTCON_TC2MCI2_RE (0x1 << 16)
#define MCCNTCON_TC2MCI2_FE (0x1 << 17)
#define MCCNTCON_CNTR0      (0x1 << 29)
#define MCCNTCON_CNTR1      (0x1 << 30)
#define MCCNTCON_CNTR2      (0x1 << 31)

/*
 * skipped:
 *
 * MCPWM Count Control set address (MCCNTCON_SET - 0x400B 8060)
 * MCPWM Count Control clear address (MCCNTCON_CLR - 0x400B 8064)
 * MCPWM Timer/Counter 0-2 registers (MCTC0-2 - 0x400B 8018, 0x400B 801C, 0x400B 8020)
 * MCPWM Limit 0-2 registers (MCLIM0-2 - 0x400B 8024, 0x400B 8028, 0x400B 802C)
 * MCPWM Match 0-2 registers (MCMAT0-2 - 0x400B 8030, 0x400B 8034, 0x400B 8038)
 */

/* MCPWM Dead-time register (MCDT - 0x400B 803C) */
#define MCDT_DT0 (0x3FF << 0)
#define MCDT_DT1 (0x3FF << 10)
#define MCDT_DT2 (0x3FF << 20)

/* MCPWM Commutation Pattern register (MCCP - 0x400B 8040) */
#define MCCP_CCPA0 (0x1 << 0)
#define MCCP_CCPB0 (0x1 << 1)
#define MCCP_CCPA1 (0x1 << 2)
#define MCCP_CCPB1 (0x1 << 3)
#define MCCP_CCPA2 (0x1 << 4)
#define MCCP_CCPB2 (0x1 << 5)

/* skipped  MCPWM Capture read addresses (MCCAP0-2 - 0x400B 8044, 0x400B 8048, 0x400B 804C) */

/* MCPWM Capture clear address (MCCAP_CLR - 0x400B 8074) */
#define MCCAP_CLR_CAP_CLR0 (0x1 << 0)
#define MCCAP_CLR_CAP_CLR1 (0x1 << 1)
#define MCCAP_CLR_CAP_CLR2 (0x1 << 2)


/* QEI registers */

/* Control registers */
#define QEICON     LPC17_REG(0x400BC000) /* Control register */
#define QEICONF    LPC17_REG(0x400BC008) /* Configuration register */
#define QEISTAT    LPC17_REG(0x400BC004) /* Encoder status register */

/* Position, index, and timer registers */
#define QEIPOS     LPC17_REG(0x400BC00C) /* Position register */
#define QEIMAXPOS  LPC17_REG(0x400BC010) /* Maximum position register */
#define CMPOS0     LPC17_REG(0x400BC014) /* position compare register 0 */
#define CMPOS1     LPC17_REG(0x400BC018) /* position compare register 1 */
#define CMPOS2     LPC17_REG(0x400BC01C) /* position compare register 2 */
#define INXCNT     LPC17_REG(0x400BC020) /* Index count register */
#define INXCMP     LPC17_REG(0x400BC024) /* Index compare register */
#define QEILOAD    LPC17_REG(0x400BC028) /* Velocity timer reload register */
#define QEITIME    LPC17_REG(0x400BC02C) /* Velocity timer register */
#define QEIVEL     LPC17_REG(0x400BC030) /* Velocity counter register */
#define QEICAP     LPC17_REG(0x400BC034) /* Velocity capture register */
#define VELCOMP    LPC17_REG(0x400BC038) /* Velocity compare register */
#define FILTER     LPC17_REG(0x400BC03C) /* Digital filter register */

/* Interrupt registers */
#define QEIINTSTAT LPC17_REG(0x400BCFE0) /* Interrupt status register */
#define QEISET     LPC17_REG(0x400BCFEC) /* Interrupt status set register */
#define QEICLR     LPC17_REG(0x400BCFE8) /* Interrupt status clear register */
#define QEIIE      LPC17_REG(0x400BCFE4) /* Interrupt enable register */
#define QEIIES     LPC17_REG(0x400BCFDC) /* Interrupt enable set register */
#define QEIIEC     LPC17_REG(0x400BCFD8) /* Interrupt enable clear register */

/* QEI Control register (QEICON - 0x400B C000) */
#define QEICON_RESP  (0x1 << 0)
#define QEICON_RESPI (0x1 << 1)
#define QEICON_RESV  (0x1 << 2)
#define QEICON_RESI  (0x1 << 3)

/* QEI Configuration register (QEICONF - 0x400B C008) */
#define QEICONF_DIRINV  (0x1 << 0)
#define QEICONF_SIGMODE (0x1 << 1)
#define QEICONF_CAPMODE (0x1 << 2)
#define QEICONF_INVINX  (0x1 << 3)

/* QEI Status register (QEISTAT - 0x400B C004) */
#define QEISTAT_DIR (0x1 << 0)

/*
 * skipped:
 *
 * QEI Position register (QEIPOS - 0x400B C00C)
 * QEI Maximum Position register (QEIMAXPOS - 0x400B C010)
 * QEI Position Compare register 0 (CMPOS0 - 0x400B C014)
 * QEI Position Compare register 1 (CMPOS1 - 0x400B C018)
 * QEI Position Compare register 2 (CMPOS2 - 0x400B C01C)
 * QEI Index Count register (INXCNT - 0x400B C020)
 * QEI Index Compare register (INXCMP - 0x400B C024)
 * QEI Timer Reload register (QEILOAD - 0x400B C028)
 * QEI Timer register (QEITIME - 0x400B C02C)
 * QEI Velocity register (QEIVEL - 0x400B C030)
 * QEI Velocity Capture register (QEICAP - 0x400B C034)
 * QEI Velocity Compare register (VELCOMP - 0x400B C038)
 * QEI Digital Filter register (FILTER - 0x400B C03C)
 */

/* QEI Interrupt Status register (QEIINTSTAT) */
#define QEIINTSTAT_INX_Int     (0x1 << 0)
#define QEIINTSTAT_TIM_Int     (0x1 << 1)
#define QEIINTSTAT_VELC_Int    (0x1 << 2)
#define QEIINTSTAT_DIR_Int     (0x1 << 3)
#define QEIINTSTAT_ERR_Int     (0x1 << 4)
#define QEIINTSTAT_ENCLK_Int   (0x1 << 5)
#define QEIINTSTAT_POS0_Int    (0x1 << 6)
#define QEIINTSTAT_POS1_Int    (0x1 << 7)
#define QEIINTSTAT_POS2_Int    (0x1 << 8)
#define QEIINTSTAT_REV_Int     (0x1 << 9)
#define QEIINTSTAT_POS0REV_Int (0x1 << 10)
#define QEIINTSTAT_POS1REV_Int (0x1 << 11)
#define QEIINTSTAT_POS2REV_Int (0x1 << 12)

/* QEI Interrupt Set register (QEISET - 0x400B CFEC) */
#define QEISET_INX_Int     (0x1 << 0)
#define QEISET_TIM_Int     (0x1 << 1)
#define QEISET_VELC_Int    (0x1 << 2)
#define QEISET_DIR_Int     (0x1 << 3)
#define QEISET_ERR_Int     (0x1 << 4)
#define QEISET_ENCLK_Int   (0x1 << 5)
#define QEISET_POS0_Int    (0x1 << 6)
#define QEISET_POS1_Int    (0x1 << 7)
#define QEISET_POS2_Int    (0x1 << 8)
#define QEISET_REV_Int     (0x1 << 9)
#define QEISET_POS0REV_Int (0x1 << 10)
#define QEISET_POS1REV_Int (0x1 << 11)
#define QEISET_POS2REV_Int (0x1 << 12)

/* QEI Interrupt Clear register (QEICLR - 0x400B CFE8) */
#define QEICLR_INX_Int     (0x1 << 0)
#define QEICLR_TIM_Int     (0x1 << 1)
#define QEICLR_VELC_Int    (0x1 << 2)
#define QEICLR_DIR_Int     (0x1 << 3)
#define QEICLR_ERR_Int     (0x1 << 4)
#define QEICLR_ENCLK_Int   (0x1 << 5)
#define QEICLR_POS0_Int    (0x1 << 6)
#define QEICLR_POS1_Int    (0x1 << 7)
#define QEICLR_POS2_Int    (0x1 << 8)
#define QEICLR_REV_Int     (0x1 << 9)
#define QEICLR_POS0REV_Int (0x1 << 10)
#define QEICLR_POS1REV_Int (0x1 << 11)
#define QEICLR_POS2REV_Int (0x1 << 12)

/* QEI Interrupt Enable register (QEIIE - 0x400B CFE4) */
#define QEIIE_INX_Int     (0x1 << 0)
#define QEIIE_TIM_Int     (0x1 << 1)
#define QEIIE_VELC_Int    (0x1 << 2)
#define QEIIE_DIR_Int     (0x1 << 3)
#define QEIIE_ERR_Int     (0x1 << 4)
#define QEIIE_ENCLK_Int   (0x1 << 5)
#define QEIIE_POS0_Int    (0x1 << 6)
#define QEIIE_POS1_Int    (0x1 << 7)
#define QEIIE_POS2_Int    (0x1 << 8)
#define QEIIE_REV_Int     (0x1 << 9)
#define QEIIE_POS0REV_Int (0x1 << 10)
#define QEIIE_POS1REV_Int (0x1 << 11)
#define QEIIE_POS2REV_Int (0x1 << 12)

/* QEI Interrupt Enable Set register (QEIIES - 0x400B CFDC) */
#define QEIIES_INX_Int     (0x1 << 0)
#define QEIIES_TIM_Int     (0x1 << 1)
#define QEIIES_VELC_Int    (0x1 << 2)
#define QEIIES_DIR_Int     (0x1 << 3)
#define QEIIES_ERR_Int     (0x1 << 4)
#define QEIIES_ENCLK_Int   (0x1 << 5)
#define QEIIES_POS0_Int    (0x1 << 6)
#define QEIIES_POS1_Int    (0x1 << 7)
#define QEIIES_POS2_Int    (0x1 << 8)
#define QEIIES_REV_Int     (0x1 << 9)
#define QEIIES_POS0REV_Int (0x1 << 10)
#define QEIIES_POS1REV_Int (0x1 << 11)
#define QEIIES_POS2REV_Int (0x1 << 12)

/* QEI Interrupt Enable Clear register (QEIIEC - 0x400B CFD8) */
#define QEIIEC_INX_Int     (0x1 << 0)
#define QEIIEC_TIM_Int     (0x1 << 1)
#define QEIIEC_VELC_Int    (0x1 << 2)
#define QEIIEC_DIR_Int     (0x1 << 3)
#define QEIIEC_ERR_Int     (0x1 << 4)
#define QEIIEC_ENCLK_Int   (0x1 << 5)
#define QEIIEC_POS0_Int    (0x1 << 6)
#define QEIIEC_POS1_Int    (0x1 << 7)
#define QEIIEC_POS2_Int    (0x1 << 8)
#define QEIIEC_REV_Int     (0x1 << 9)
#define QEIIEC_POS0REV_Int (0x1 << 10)
#define QEIIEC_POS1REV_Int (0x1 << 11)
#define QEIIEC_POS2REV_Int (0x1 << 12)


/* real-time clock (RTC) registers */

/* Miscellaneous registers */
#define ILR         LPC17_REG(0x40024000) /* Interrupt Location Register */
#define CCR         LPC17_REG(0x40024008) /* Clock Control Register */
#define CIIR        LPC17_REG(0x4002400C) /* Counter Increment Interrupt Register */
#define AMR         LPC17_REG(0x40024010) /* Alarm Mask Register */
#define RTC_AUX     LPC17_REG(0x4002405C) /* RTC Auxiliary control register */
#define RTC_AUXEN   LPC17_REG(0x40024058) /* RTC Auxiliary Enable register */

/* Consolidated time registers */
#define CTIME0      LPC17_REG(0x40024014) /* Consolidated Time Register 0 */
#define CTIME1      LPC17_REG(0x40024018) /* Consolidated Time Register 1 */
#define CTIME2      LPC17_REG(0x4002401C) /* Consolidated Time Register 2 */

/* Time counter registers */
#define SEC         LPC17_REG(0x40024020) /* Seconds Counter */
#define MIN         LPC17_REG(0x40024024) /* Minutes Register */
#define HOUR        LPC17_REG(0x40024028) /* Hours Register */
#define DOM         LPC17_REG(0x4002402C) /* Day of Month Register */
#define DOW         LPC17_REG(0x40024030) /* Day of Week Register */
#define DOY         LPC17_REG(0x40024034) /* Day of Year Register */
#define MONTH       LPC17_REG(0x40024038) /* Months Register */
#define YEAR        LPC17_REG(0x4002403C) /* Years Register */
#define CALIBRATION LPC17_REG(0x40024040) /* Calibration Value Register */

/* General purpose registers */
#define GPREG0      LPC17_REG(0x40024044) /* General Purpose Register 0 */
#define GPREG1      LPC17_REG(0x40024048) /* General Purpose Register 1 */
#define GPREG2      LPC17_REG(0x4002404C) /* General Purpose Register 2 */
#define GPREG3      LPC17_REG(0x40024050) /* General Purpose Register 3 */
#define GPREG4      LPC17_REG(0x40024054) /* General Purpose Register 4 */

