greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* Alarm register group */
#define ALSEC       LPC17_REG(0x40024060) /* Alarm value for Seconds */
#define ALMIN       LPC17_REG(0x40024064) /* Alarm value for Minutes */
#define ALHOUR      LPC17_REG(0x40024068) /* Alarm value for Hours */
#define ALDOM       LPC17_REG(0x4002406C) /* Alarm value for Day of Month */
#define ALDOW       LPC17_REG(0x40024070) /* Alarm value for Day of Week */
#define ALDOY       LPC17_REG(0x40024074) /* Alarm value for Day of Year */
#define ALMON       LPC17_REG(0x40024078) /* Alarm value for Months */
#define ALYEAR      LPC17_REG(0x4002407C) /* Alarm value for Year */

/* Interrupt Location Register (ILR - 0x4002 4000) */
#define ILR_RTCCIF (0x1 << 0)
#define ILR_RTCALF (0x1 << 1)

/* Clock Control Register (CCR - 0x4002 4008) */
#define CCR_CLKEN  (0x1 << 0)
#define CCR_CTCRST (0x1 << 1)
#define CCR_CCALEN (0x1 << 4)

/* Counter Increment Interrupt Register (CIIR - 0x4002 400C) */
#define CIIR_IMSEC  (0x1 << 0)
#define CIIR_IMMIN  (0x1 << 1)
#define CIIR_IMHOUR (0x1 << 2)
#define CIIR_IMDOM  (0x1 << 3)
#define CIIR_IMDOW  (0x1 << 4)
#define CIIR_IMDOY  (0x1 << 5)
#define CIIR_IMMON  (0x1 << 6)
#define CIIR_IMYEAR (0x1 << 7)

/* Alarm Mask Register (AMR - 0x4002 4010) */
#define AMR_AMRSEC  (0x1 << 0)
#define AMR_AMRMIN  (0x1 << 1)
#define AMR_AMRHOUR (0x1 << 2)
#define AMR_AMRDOM  (0x1 << 3)
#define AMR_AMRDOW  (0x1 << 4)
#define AMR_AMRDOY  (0x1 << 5)
#define AMR_AMRMON  (0x1 << 6)
#define AMR_AMRYEAR (0x1 << 7)

/* RTC Auxiliary control register (RTC_AUX - 0x4002 405C) */
#define RTC_AUX_RTC_OSCF (0x1 << 4)

/* RTC Auxiliary Enable register (RTC_AUXEN - 0x4002 4058) */
#define RTC_AUXEN_RTC_OSCFEN (0x1 << 4)

/* Consolidated Time Register 0 (CTIME0 - 0x4002 4014) */
#define CTIME0_Seconds     (0x3F << 0)
#define CTIME0_Minutes     (0x3F << 8)
#define CTIME0_Hours       (0x1F << 16)
#define CTIME0_Day_Of_Week (0x7 << 24)

/* Consolidated Time Register 1 (CTIME1 - 0x4002 4018) */
#define CTIME1_Day_of_Month (0x1F << 0)
#define CTIME1_Month        (0xF << 8)
#define CTIME1_Year         (0xFFF << 0)

/* Consolidated Time Register 2 (CTIME2 - 0x4002 401C) */
#define CTIME2_Day_of_Year (0xFFF << 0)

/* skipped Time Counter registers (SEC, MIN, etc.) */

/* Calibration register (CALIBRATION - address 0x4002 4040) */
#define CALIBRATION_CALVAL (0x1FFFF << 0)
#define CALIBRATION_CALDIR (0x1 << 17)

/*
 * skipped:
 *
 * General purpose registers 0 to 4 (GPREG0 to GPREG4 - addresses 0x4002 4044 to 0x4002 4054)
 * Alarm register group (ALSEC, ALMIN, etc.)
 */


/* watchdog timer (WDT) registers */

#define WDMOD    LPC17_REG(0x40000000) /* Watchdog mode register */
#define WDTC     LPC17_REG(0x40000004) /* Watchdog timer constant register */
#define WDFEED   LPC17_REG(0x40000008) /* Watchdog feed sequence register */
#define WDTV     LPC17_REG(0x4000000C) /* Watchdog timer value register */
#define WDCLKSEL LPC17_REG(0x40000010) /* Watchdog clock source selection register */

/* Watchdog Mode register (WDMOD - 0x4000 0000) */
#define WDMOD_WDEN    (0x1 << 0)
#define WDMOD_WDRESET (0x1 << 1)
#define WDMOD_WDTOF   (0x1 << 2)
#define WDMOD_WDINT   (0x1 << 3)

/*
 * skipped:
 *
 * Watchdog Timer Constant register (WDTC - 0x4000 0004)
 * Watchdog Timer Value register (WDTV - 0x4000 000C)
 */

/* Watchdog Feed register (WDFEED - 0x4000 0008) */
#define WDFEED_SEQUENCE WDFEED = 0xAA; WDFEED = 0x55

/* Watchdog Timer Clock Source Selection register (WDCLKSEL - 0x4000 0010) */
#define WDCLKSEL_WDSEL  (0x3 << 0)
#define WDCLKSEL_WDLOCK (0x1 << 31)


/* ADC registers */

#define AD0CR    LPC17_REG(0x40034000) /* ADCR    A/D Control Register */
#define AD0GDR   LPC17_REG(0x40034004) /* ADGDR   A/D Global Data Register */
#define AD0INTEN LPC17_REG(0x4003400C) /* ADINTEN A/D Interrupt Enable Register */
#define AD0DR0   LPC17_REG(0x40034010) /* ADDR0   A/D Channel 0 Data Register */
#define AD0DR1   LPC17_REG(0x40034014) /* ADDR1   A/D Channel 1 Data Register */
#define AD0DR2   LPC17_REG(0x40034018) /* ADDR2   A/D Channel 2 Data Register */
#define AD0DR3   LPC17_REG(0x4003401C) /* ADDR3   A/D Channel 3 Data Register */
#define AD0DR4   LPC17_REG(0x40034020) /* ADDR4   A/D Channel 4 Data Register */
#define AD0DR5   LPC17_REG(0x40034024) /* ADDR5   A/D Channel 5 Data Register */
#define AD0DR6   LPC17_REG(0x40034028) /* ADDR6   A/D Channel 6 Data Register */
#define AD0DR7   LPC17_REG(0x4003402C) /* ADDR7   A/D Channel 7 Data Register */
#define AD0STAT  LPC17_REG(0x40034030) /* ADSTAT  A/D Status Register */
#define AD0TRM   LPC17_REG(0x40034034) /* ADTRM   ADC trim register */

/* A/D Control Register (AD0CR - 0x4003 4000) */
#define AD0CR_SEL    (0xFF << 0)
#define AD0CR_CLKDIV (0xFF << 8)
#define AD0CR_BURST  (0x1 << 16)
#define AD0CR_PDN    (0x1 << 21)
#define AD0CR_START  (0x7 << 24)
#define AD0CR_EDGE   (0x1 << 27)

/* A/D Global Data Register (AD0GDR - 0x4003 4004) */
#define AD0GDR_RESULT  (0xFFF << 4)
#define AD0GDR_CHN     (0x7 << 24)
#define AD0GDR_OVERRUN (0x1 << 30)
#define AD0GDR_DONE    (0x1 << 31)

/* A/D Interrupt Enable register (AD0INTEN - 0x4003 400C) */
#define AD0INTEN_ADINTEN0 (0x1 << 0)
#define AD0INTEN_ADINTEN1 (0x1 << 1)
#define AD0INTEN_ADINTEN2 (0x1 << 2)
#define AD0INTEN_ADINTEN3 (0x1 << 3)
#define AD0INTEN_ADINTEN4 (0x1 << 4)
#define AD0INTEN_ADINTEN5 (0x1 << 5)
#define AD0INTEN_ADINTEN6 (0x1 << 6)
#define AD0INTEN_ADINTEN7 (0x1 << 7)
#define AD0INTEN_ADGINTEN (0x1 << 8)

/* A/D Data Registers (AD0DR0 to AD0DR7 - 0x4003 4010 to 0x4003 402C) */
#define AD0DRn_RESULT  (0xFFF << 4)
#define AD0DRn_OVERRUN (0x1 << 30)
#define AD0DRn_DONE    (0x1 << 31)

/* A/D Status register (ADSTAT - 0x4003 4030) */
#define ADSTAT_DONE0    (0x1 << 0)
#define ADSTAT_DONE1    (0x1 << 1)
#define ADSTAT_DONE2    (0x1 << 2)
#define ADSTAT_DONE3    (0x1 << 3)
#define ADSTAT_DONE4    (0x1 << 4)
#define ADSTAT_DONE5    (0x1 << 5)
#define ADSTAT_DONE6    (0x1 << 6)
#define ADSTAT_DONE7    (0x1 << 7)
#define ADSTAT_OVERRUN0 (0x1 << 8)
#define ADSTAT_OVERRUN1 (0x1 << 9)
#define ADSTAT_OVERRUN2 (0x1 << 10)
#define ADSTAT_OVERRUN3 (0x1 << 11)
#define ADSTAT_OVERRUN4 (0x1 << 12)
#define ADSTAT_OVERRUN5 (0x1 << 13)
#define ADSTAT_OVERRUN6 (0x1 << 14)
#define ADSTAT_OVERRUN7 (0x1 << 15)
#define ADSTAT_ADINT    (0x1 << 16)

/* A/D Trim register (ADTRIM - 0x4003 4034) */
#define ADTRIM_ADCOFFS (0xF << 4)
#define ADTRIM_TRIM    (0xF << 8)


/* DAC registers */

#define DACR      LPC17_REG(0x4008C000) /* D/A Converter Register */
#define DACCTRL   LPC17_REG(0x4008C004) /* DAC Control register */
#define DACCNTVAL LPC17_REG(0x4008C008) /* DAC Counter Value register */

