greatscottgadgets/ubertooth/firmware/common/lpc17.h
/* D/A Converter Register (DACR - 0x4008 C000) */
#define DACR_VALUE (0x3FF << 6)
#define DACR_BIAS  (0x1 << 16)

/* D/A Converter Control register (DACCTRL - 0x4008 C004) */
#define DACCTRL_INT_DMA_REQ (0x1 << 0)
#define DACCTRL_DBLBUF_ENA  (0x1 << 1)
#define DACCTRL_CNT_ENA     (0x1 << 2)
#define DACCTRL_DMA_ENA     (0x1 << 3)

/* skipped D/A Converter Counter Value register (DACCNTVAL - 0x4008 C008) */


/* GPDMA registers */

/* General registers */
#define DMACIntStat       LPC17_REG(0x50004000) /* DMA Interrupt Status Register */
#define DMACIntTCStat     LPC17_REG(0x50004004) /* DMA Interrupt Terminal Count Request Status Register */
#define DMACIntTCClear    LPC17_REG(0x50004008) /* DMA Interrupt Terminal Count Request Clear Register */
#define DMACIntErrStat    LPC17_REG(0x5000400C) /* DMA Interrupt Error Status Register */
#define DMACIntErrClr     LPC17_REG(0x50004010) /* DMA Interrupt Error Clear Register */
#define DMACRawIntTCStat  LPC17_REG(0x50004014) /* DMA Raw Interrupt Terminal Count Status Register */
#define DMACRawIntErrStat LPC17_REG(0x50004018) /* DMA Raw Error Interrupt Status Register */
#define DMACEnbldChns     LPC17_REG(0x5000401C) /* DMA Enabled Channel Register */
#define DMACSoftBReq      LPC17_REG(0x50004020) /* DMA Software Burst Request Register */
#define DMACSoftSReq      LPC17_REG(0x50004024) /* DMA Software Single Request Register */
#define DMACSoftLBReq     LPC17_REG(0x50004028) /* DMA Software Last Burst Request Register */
#define DMACSoftLSReq     LPC17_REG(0x5000402C) /* DMA Software Last Single Request Register */
#define DMACConfig        LPC17_REG(0x50004030) /* DMA Configuration Register */
#define DMACSync          LPC17_REG(0x50004034) /* DMA Synchronization Register */
#define DMAREQSEL         LPC17_REG(0x400FC1C4) /* Selects between UART and timer DMA requests */

/* Channel 0 registers */
#define DMACC0SrcAddr     LPC17_REG(0x50004100) /* DMA Channel 0 Source Address Register */
#define DMACC0DestAddr    LPC17_REG(0x50004104) /* DMA Channel 0 Destination Address Register */
#define DMACC0LLI         LPC17_REG(0x50004108) /* DMA Channel 0 Linked List Item Register */
#define DMACC0Control     LPC17_REG(0x5000410C) /* DMA Channel 0 Control Register */
#define DMACC0Config      LPC17_REG(0x50004110) /* DMA Channel 0 Configuration Register */

/* Channel 1 registers */
#define DMACC1SrcAddr     LPC17_REG(0x50004120) /* DMA Channel 1 Source Address Register */
#define DMACC1DestAddr    LPC17_REG(0x50004124) /* DMA Channel 1 Destination Address Register */
#define DMACC1LLI         LPC17_REG(0x50004128) /* DMA Channel 1 Linked List Item Register */
#define DMACC1Control     LPC17_REG(0x5000412C) /* DMA Channel 1 Control Register */
#define DMACC1Config      LPC17_REG(0x50004130) /* DMA Channel 1 Configuration Register */

/* Channel 2 registers */
#define DMACC2SrcAddr     LPC17_REG(0x50004140) /* DMA Channel 2 Source Address Register */
#define DMACC2DestAddr    LPC17_REG(0x50004144) /* DMA Channel 2 Destination Address Register */
#define DMACC2LLI         LPC17_REG(0x50004148) /* DMA Channel 2 Linked List Item Register */
#define DMACC2Control     LPC17_REG(0x5000414C) /* DMA Channel 2 Control Register */
#define DMACC2Config      LPC17_REG(0x50004150) /* DMA Channel 2 Configuration Register */

/* Channel 3 registers */
#define DMACC3SrcAddr     LPC17_REG(0x50004160) /* DMA Channel 3 Source Address Register */
#define DMACC3DestAddr    LPC17_REG(0x50004164) /* DMA Channel 3 Destination Address Register */
#define DMACC3LLI         LPC17_REG(0x50004168) /* DMA Channel 3 Linked List Item Register */
#define DMACC3Control     LPC17_REG(0x5000416C) /* DMA Channel 3 Control Register */
#define DMACC3Config      LPC17_REG(0x50004170) /* DMA Channel 3 Configuration Register */

/* Channel 4 registers */
#define DMACC4SrcAddr     LPC17_REG(0x50004180) /* DMA Channel 4 Source Address Register */
#define DMACC4DestAddr    LPC17_REG(0x50004184) /* DMA Channel 4 Destination Address Register */
#define DMACC4LLI         LPC17_REG(0x50004188) /* DMA Channel 4 Linked List Item Register */
#define DMACC4Control     LPC17_REG(0x5000418C) /* DMA Channel 4 Control Register */
#define DMACC4Config      LPC17_REG(0x50004190) /* DMA Channel 4 Configuration Register */

/* Channel 5 registers */
#define DMACC5SrcAddr     LPC17_REG(0x500041A0) /* DMA Channel 5 Source Address Register */
#define DMACC5DestAddr    LPC17_REG(0x500041A4) /* DMA Channel 5 Destination Address Register */
#define DMACC5LLI         LPC17_REG(0x500041A8) /* DMA Channel 5 Linked List Item Register */
#define DMACC5Control     LPC17_REG(0x500041AC) /* DMA Channel 5 Control Register */
#define DMACC5Config      LPC17_REG(0x500041B0) /* DMA Channel 5 Configuration Register */

/* Channel 6 registers */
#define DMACC6SrcAddr     LPC17_REG(0x500041C0) /* DMA Channel 6 Source Address Register */
#define DMACC6DestAddr    LPC17_REG(0x500041C4) /* DMA Channel 6 Destination Address Register */
#define DMACC6LLI         LPC17_REG(0x500041C8) /* DMA Channel 6 Linked List Item Register */
#define DMACC6Control     LPC17_REG(0x500041CC) /* DMA Channel 6 Control Register */
#define DMACC6Config      LPC17_REG(0x500041D0) /* DMA Channel 6 Configuration Register */

/* Channel 7 registers */
#define DMACC7SrcAddr     LPC17_REG(0x500041E0) /* DMA Channel 7 Source Address Register */
#define DMACC7DestAddr    LPC17_REG(0x500041E4) /* DMA Channel 7 Destination Address Register */
#define DMACC7LLI         LPC17_REG(0x500041E8) /* DMA Channel 7 Linked List Item Register */
#define DMACC7Control     LPC17_REG(0x500041EC) /* DMA Channel 7 Control Register */
#define DMACC7Config      LPC17_REG(0x500041F0) /* DMA Channel 7 Configuration Register */

/*
 * skipped:
 *
 * DMA Interrupt Status register (DMACIntStat - 0x5000 4000)
 * DMA Interrupt Terminal Count Request Status register (DMACIntTCStat - 0x5000 4004)
 * DMA Interrupt Terminal Count Request Clear register (DMACIntTCClear - 0x5000 4008)
 * DMA Interrupt Error Status register (DMACIntErrStat - 0x5000 400C)
 * DMA Interrupt Error Clear register (DMACIntErrClr - 0x5000 4010)
 * DMA Raw Interrupt Terminal Count Status register (DMACRawIntTCStat - 0x5000 4014)
 * DMA Raw Interrupt Terminal Count Status register (DMACRawIntTCStat - 0x5000 4014)
 * DMA Enabled Channel register (DMACEnbldChns - 0x5000 401C)
 * DMA Software Burst Request register (DMACSoftBReq - 0x5000 4020)
 * DMA Software Single Request register (DMACSoftSReq - 0x5000 4024)
 * DMA Software Last Burst Request register (DMACSoftLBReq - 0x5000 4028)
 * DMA Software Last Single Request register (DMACSoftLSReq - 0x5000 402C)
 */

/* DMA Configuration register (DMACConfig - 0x5000 4030) */
#define DMACConfig_E (0x1 << 0)
#define DMACConfig_M (0x1 << 1)

/* skipped DMA Synchronization register (DMACSync - 0x5000 4034) */

/* DMA Request Select register (DMAReqSel - 0x400F C1C4) */
#define DMAReqSel_DMASEL08 (0x1 << 0)
#define DMAReqSel_DMASEL09 (0x1 << 1)
#define DMAReqSel_DMASEL10 (0x1 << 2)
#define DMAReqSel_DMASEL11 (0x1 << 3)
#define DMAReqSel_DMASEL12 (0x1 << 4)
#define DMAReqSel_DMASEL13 (0x1 << 5)
#define DMAReqSel_DMASEL14 (0x1 << 6)
#define DMAReqSel_DMASEL15 (0x1 << 7)

