greatscottgadgets/ubertooth/firmware/common/lpc17.h
/*
 * skipped:
 *
 * DMA Channel Source Address registers (DMACCxSrcAddr - 0x5000 41x0)
 * DMA Channel Destination Address registers (DMACCxDestAddr - 0x5000 41x4)
 * DMA Channel Linked List Item registers (DMACCxLLI - 0x5000 41x8)
 */

/* DMA channel control registers (DMACCxControl - 0x5000 41xC) */
#define DMACCxControl_TransferSize (0xFFF << 0)
#define DMACCxControl_SBSize       (0x7 << 12)
#define DMACCxControl_DBSize       (0x7 << 15)
#define DMACCxControl_SWidth       (0x7 << 18)
#define DMACCxControl_DWidth       (0x7 << 21)
#define DMACCxControl_SI           (0x1 << 26)
#define DMACCxControl_DI           (0x1 << 27)
#define DMACCxControl_Prot1        (0x1 << 28)
#define DMACCxControl_Prot2        (0x1 << 29)
#define DMACCxControl_Prot3        (0x1 << 30)
#define DMACCxControl_I            (0x1 << 31)

/* DMA Channel Configuration registers (DMACCxConfig - 0x5000 41x0) */
#define DMACCxConfig_E              (0x1 << 0)
#define DMACCxConfig_SrcPeripheral  (0x1F << 1)
#define DMACCxConfig_DestPeripheral (0x1F << 6)
#define DMACCxConfig_TransferType   (0x7 << 11)
#define DMACCxConfig_IE             (0x1 << 14)
#define DMACCxConfig_ITC            (0x1 << 15)
#define DMACCxConfig_L              (0x1 << 16)
#define DMACCxConfig_A              (0x1 << 17)
#define DMACCxConfig_H              (0x1 << 18)


/* FMC registers */

#define FMSSTART  LPC17_REG(0x40084020) /* Signature start address register */
#define FMSSTOP   LPC17_REG(0x40084024) /* Signature stop-address register */
#define FMSW0     LPC17_REG(0x4008402C) /* 128-bit signature Word 0 */
#define FMSW1     LPC17_REG(0x40084030) /* 128-bit signature Word 1 */
#define FMSW2     LPC17_REG(0x40084034) /* 128-bit signature Word 2 */
#define FMSW3     LPC17_REG(0x40084038) /* 128-bit signature Word 3 */
#define FMSTAT    LPC17_REG(0x40084FE0) /* Signature generation status register */
#define FMSTATCLR LPC17_REG(0x40084FE8) /* Signature generation status clear register */

/* skipped Flash Module Signature Start register (FMSSTART - 0x4008 4020) */

/* Flash Module Signature Stop register (FMSSTOP - 0x4008 4024) */
#define FMSSTOP_STOP      (0x1FFFF << 0)
#define FMSSTOP_SIG_START (0x1 << 17)

/*
 * skipped:
 *
 * FMSW0 register bit description (FMSW0, address: 0x4008 402C)
 * FMSW1 register bit description (FMSW1, address: 0x4008 4030)
 * FMSW2 register bit description (FMSW2, address: 0x4008 4034)
 * FMSW3 register bit description (FMSW3, address: 0x4008 4038)
 */

/* Flash module Status register (FMSTAT - 0x4008 4FE0) */
#define FMSTAT_SIG_DONE (0x1 << 2)

/* Flash Module Status Clear register (FMSTATCLR - 0x0x4008 4FE8) */
#define FMSTATCLR_SIG_DONE_CLR (0x1 << 2)

#endif /* __LPC17_H */
